{
    "posts": [
        {
            "category": "HOT",
            "title": "Exclusive: DOGE staffer, 'Big Balls', provided tech support to cybercrime ring, records show",
            "external_url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/?utm_source=reddit.com",
            "upvotes": 22162,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He still does, but he used to, too.",
                "The people involved with modifying code on our most sensitive electronic systems are not only just fresh out of school, but are sketchy as hell. \n\nAs a cybersecurity professional, I'm terrified. \n\nMost people can't comprehend how bad this stuff is.\n\nEdit: \n\nHere's a fun thought experiment:\n\n1) Look at the cybersecurity actions taken by this administration. \n2) Think about what actions a compromised President/Cabinet would take regarding cybersecurity. \n3) Ask yourself, what actions would a foreign agent of Russia take that ARE ANY DIFFERENT than what we all have seen up to this point. \n\nEducate yourself! The ONLY way ANY of this makes sense is with this context. Krasnov is destroying this country.\n\nhttps://www.csoonline.com/article/3829710/firing-of-130-cisa-staff-worries-cybersecurity-industry.html/amp/\n\nhttps://www.cybersecuritydive.com/news/dhs-disbands-advisory-board-csrb/737976/\n\nhttps://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343\n\nhttps://www.euronews.com/my-europe/2025/03/13/fact-checking-online-claims-that-donald-trump-was-recruited-by-the-kgb-as-krasnov",
                "Ok, as a reminder to everyone about \"Big Balls\".  \n\nHe is the grandson of a KGB spy.\n\nHe was fired from an internship at a cyber security company for leaking company info to a competitor. \n\nAnd now we know he's involved with crime rings.",
                "You mean the guys who use ICE to run the country like a mob hire people from the underworld?",
                "If you want to use criminal tactics to be successful criminals, hire criminals.",
                "I There's something so deeply unsettling about the fact that literally a group of people from 4chan are not only in charge of the US government, but have proceeded to transform said government according to 4chan's ideal of the perfect government and are also implementing 4chan lingo into the government itself. I don't think i'll ever be able to get used to this. Even 60 years from now i feel like i'll still remember this period and continue to wonder \"wtf happened there?\"",
                "We already know he's working with Elon and Trump. Nothing new.",
                "He will work for any cybercrime group. He has chosen DOGE in this case.",
                "This is not the level of professionalism we expect from Big Balls.",
                "SOB ... 28 years, 3 time polygraphed ... friends I hadn't seen in years contacted by Suits & Ray-Bans and they let this little fucker have free reign over entire CRITICAL systems???\n\nI'm fucking pissed.\n\nTHIS should get people out in the streets!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Trump signs election order calling for proof of U.S. citizenship to vote",
            "external_url": "https://www.reuters.com/world/us/trump-signs-election-order-calling-proof-us-citizenship-vote-2025-03-26/",
            "upvotes": 8291,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Meanwhile, Elon came over on a student visa. Stayed after it had expired… and now has more power than any US citizen",
                "Considering this isn’t a law, that voting is up to the states, this is mostly a Big Mac fueled fart in the wind.",
                "States rights except when it is against Trumps agenda",
                "Oh hey ... those people who were really upset about overreach of the federal government. Are you all gonna be mad about Trump taking away a right reserved for the states?",
                "They aren't doing this because they expect States to follow the requirements. They are doing it because they expect *certain* states *won't*.\n\nThis is setting up a pretext for invalidating legal votes from registered voters, American citizens, specifically from blue States. \n\nThis needs to be heavily challenged in the courts and we should all hope it is shot down, because hell will break loose if the will of the people of entire States is disregarded.",
                "Article I, Section 4, Clause 1\n\n>The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.\n\n\nStates or Congress.  The Executive have the power to do change state or federal laws.  This is yet another impeachable offense, yet congress is full of feckless cowards.",
                "If they provide free, EASILY ATTAINABLE, federal ID for this purpose then I say go ahead. We all know they won’t though",
                "Sounds like very thinly veiled attempt at voter suppression.  \n\nDon't the states regulate who, what, where voting takes place?  I am sure this will be in court in a matter of weeks.",
                "Trump will announce that the 2028 election has too many security failures and declare a state of emergency over election interference early in the year. The election may be cancelled.\n\nWe are right in the middle of it, folks. This is not my random redditor theory, this is the discussion being held about Trump trying to subvert term limits and how he'll do it. Prepare your pitchforks now, you'll need them in a few years.",
                "gonna be funny when a lot of people realize they don't have proof of citizenship. probably mostly older people, since their documents are more likely to be lost/damaged, and/or difficult/impossible to replace"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 3007,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were.",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "What was the reasoning to even share any of this info over the chat? I'm assuming everyone was already briefed that they would attack, why did they need to discuss details? None of them were directly involved, it's not like \"hey, here's the time of the strike so be ready to press the launch button!\"\n\nBeyond the stupidity of it all it seems so unnecessary."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "3 teen girls try to stab mom for turning off Wi-Fi: Sheriff",
            "external_url": "https://abcnews.go.com/US/3-teens-stab-mom-turning-off-wi-fi/story?id=120126479",
            "upvotes": 1368,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/57abeb79-c721-4134-b0bf-7962bc0fec4b/teens-wifi-stabbing-ktrk-jef-250325_1742907203519_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Because the mom turned off the Wi-Fi, the teens allegedly grabbed kitchen knives Sunday night and chased their mother through their Houston home and into the street, according to the sheriff. One of the girls threw a brick that hit their 39-year old mom in the ankle, and the girls' 70-year-old grandmother was knocked over while attempting to protect the mom, the sheriff's office said.\n\nAll three daughters tried to kill their mother over losing the internet. There's something more going on in that family dynamic if this kind of violent outburst happens.",
                "thank god I grew up in the 2000s when phones were only good for calls and texts and riding bikes all day with your friends till the sun set was still the thing to do ",
                "This is the behavior of addicts. I’ve been an addict most of my life. I’ve been clean for years and years but I recognize addictive behavior. Take away my drugs and I would have likely stabbed you at the worst points in my life. Social media is being designed to be addictive and it’s working.",
                "I was literally choked by my step son who at the time was 17 because I unplugged the router. He refused to go pick up his mother from work (he had taken her car and dropped her off) because he was in the middle of a League of Legends game. \n\nAt the time I was routinely doing dialysis and very weak, the only way I got him to release me was by biting his hand as hard as I fucking could. And then this little bastard rips the router out of the wall (cable) and throws it in the yard. \n\nThe addiction to the internet is absolutely crazy. Had the same kid punch a hole in my door and assault me again before he was literally thrown out. And then he has the audacity to invite me to his wedding like none of this happened. \n\nI feel for this mom. You love your kids and step kids, but these kids need to learn. Send their asses to jail or juvenile detention before they continue down this path in life.",
                "As a mom, I would not take them back. They belong to the state now.",
                "I would say I'm attached to my phone non stop. I am 32 though so for all of my childhood phones were useless, just good enough to call and text on and the odd game of snake. Then as I got into the work place as a young teen smart phones started but they were still \"ok\". Now I know the amount I use my phone is too much, but I'm also an adult that remembers not having one, so in situations where I can't use it, it doesn't bother me. I really do not envy a parent of a child old enough to use a phone.",
                "Bring back mental institutions but with wifi and gaming.  These kids will sign up for it.",
                "I'll just use the internet as a babysitter from birth. Nothing could possibly go wrong.",
                "The Veldt- Ray Bradbury",
                "Internet is too ever present in children’s lives"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court upholds Biden regulations on 'ghost gun' kits",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-biden-regulations-ghost-gun-kits-rcna180991",
            "upvotes": 645,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241007-ghost-gun-vl-105p-007c05.jpg",
            "top_comments": [
                "7-2 decision with Neil Gorsuch writing for the majority.",
                "Why hasn't trump abolished the NFA and the defunded ATF at this point?   The right has been against the ATF and has encumbered them at every turn.   Why not target those employees for cuts and effectively cripple the ATF?",
                "This was a no-brainer ruling with even normally far right judges ruling ghost guns need to be regulated. A kid was shot at a local high school (and survived) with a ghost gun. The 16 year old shooter ordered the kit online and made it himself at home. Why would anyone not think something should be done to prevent this?",
                "Bad news for corrupt NRA and MAGA gun lovers.",
                "How are the ghost busters gonna kill ghosts",
                "You can get individual parts for each gun you want to put together. It would be hard to regulate that for it's not a kit. They would be individual parts for a gun. Of course it would cost way more but I bet others have figured that out............"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Florida woman ‘Content creator’ arrested for posting video involving herself engaging in sexual activity with a dog.",
            "external_url": "https://www.wcjb.com/2025/03/24/content-creator-arrested-posting-video-involving-dog-marion-county/",
            "upvotes": 1284,
            "date": "03/26/2025",
            "thumbnail": "https://gray-wcjb-prod.gtv-cdn.com/resizer/v2/FJ27FPZAXRGM3MSUVYEXXSBX3M.png?auth=ce25180090c44ebf6f805c3c6f67f76e296458d536cb074b8a36a299977b6ac1&width=1200&height=600&smart=false&focal=209%2C193",
            "top_comments": [
                "According to the detective investigating the case: \"...I have seen it before so it's not out of the ordinary unfortunately.\"\n\nChihuahua sex: just another Tuesday in Florida.",
                "People paid $500 to watch her video. That should be the shocking part, but it’s not.",
                "As of this article, she is still in ownership of the abused animal(s).",
                "oh great which cabinet member this time?",
                "It 530AM where I’m at. That’s enough internet for today…",
                "Kids, that's not what we call \"content\"\n\nIt's just what we call \"fucking wrong\"",
                "Okay, that’s enough reddit for today",
                "https://imgur.com/a/m3UuPTE\n\nFrom her instagram 🤢",
                "We really need to just shut down all social media.  Humanity isn't ready.  As much as I'm assuming most people in the comments in here will think what she did is disgusting... we all know there is a group of people out there searching the internet for said video right now.",
                "\"Unfortunately this isn't my first case of this nature,\" said Batts. \"It's always shocking, it'll never not be shocking especially when you have to watch the video but I have seen it before so it's not out of the ordinary unfortunately.\"\n\n\nWTF."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Phoenix police officers suspended after sudden arrest of deaf man with cerebral palsy",
            "external_url": "https://www.abc15.com/news/local-news/investigations/phoenix-police-officers-suspended-after-sudden-arrest-of-deaf-man-with-cerebral-palsy",
            "upvotes": 727,
            "date": "03/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9559a2f/2147483647/strip/true/crop/1440x756+16+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F7a%2F42%2F85c1702048538496413ea6cd4b6b%2Fscreenshot-2024-10-17-at-6-08-24-pm.png",
            "top_comments": [
                "Backstory: white (homeless?) guy at a nearby convenience store was causing trouble, owner called cops.  Cops showed up, white guy told them it was the black guy across the street.  Cops roll around, jump out of the car and beat the everloving sh\\*t out of the black guy, who is deaf and has cerebral palsy so couldn't articulate anything before they assaulted him.  On top of it all, they charged him with with resisting arrest and aggravated assault on a police officer.  There are multiple videos of the whole encounter.\n\nNow the three cops involved get a 24hr suspension without pay.",
                "24 hour work hour suspension and \"de-escalation training\".  Cop was swinging fists the second he opened the car door and this is all he gets...\n\n  \nMeanwhile:\n\n“We are appalled by the determination made by Interim Chief Sullivan to suspend the three officers involved in the McAlpin case. A situation that was previously reviewed internally by subject matter experts of the Force Evaluation and Review Unit and deemed to be within policy has suddenly been reversed due to public pressure, based on biased media reporting.” The Phoenix Law Enforcement Association.",
                "Im.convinced these cops who do this just enjoy inflicting harm on others as a source of pleasure.",
                "Cops love it when you sue them. You pay for it. Either way it’s a win win for them.\n\nUntil you vote out their protections and make them do hard time and pay out of pocket, they will continue to do this with a smile on their face",
                "White person falsely accusing black person and police accepting it.  Check.  Barking incomprehensible orders.  Check.  Driving up on a person that makes confrontation almost a guarantee (like Tamir Rice).  Check.  Excessive force.  Check.  \"perpetrator assumed a fighting stance\" when nothing of the sort happened.  Check.  Doling out tasers like they were candy.  check.  Police lying on report.  Check.  Attacking someone whom any reasonable person would know had physical problems.  Check.  Lying on reports.  Check.  Letting obviously bogus charges hang over person so they can get leverage over lawsuits.  Check.\n\nThis case has it all and I'm sure I missed something.\n\nPeople can say, \"How did they know he was deaf?\"  Well, maybe they need to slow down and realize that people with hearing problems live full lives and do stuff like, you know, go to the store.  A person, deaf or not, has the benefit of the doubt and maybe takes a second or two to go, \"Woah..what's happening!?\"",
                "This is one of those situations people are alluding to when they say \"white privilege.\"  \n\nIt doesn't mean all white people have it *easy*, but it sure *does* make you less likely to get the ever living shit beaten out of you by police while minding your own business.",
                "24 hours, suspended for a single day.",
                "Deplorable, these cowards attacked a visibly handicapped person for kicks, just for fun. \n\nSo disappointing. If you're curious where this fascist takeover is going, just look at Arizona. It's been 20 years since civil rights meant anything in that state.",
                "Fuck the police so fucking hard. I hate living here",
                "just saw the video, fat sack of shit was huffing and puffing like he just ran a marathon. must be hard work punching disabled people in the back while your buddy is tazing them. quick reminder that Phoenix police ranks #1 in deadly use of force compared to other major departments"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Pentagon warned staffers against using Signal before White House chat leak",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/signal-app-leaked-war-plans",
            "upvotes": 48791,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e9d13fd637f3222076970307f6bf673f887580ab/0_210_5088_3052/master/5088.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bf6968ef97f9538f9c42cdd176beff5",
            "top_comments": [
                ">But according to a Pentagon “OPSEC special bulletin” seen by NPR reporters and sent on 18 March, Russian hacking groups may exploit the vulnerability in Signal to spy on encrypted organizations, potentially targeting “persons of interest”.\n\nI guess Pete Hegseth didn’t get the memo.",
                "There is no justification for using Signal for official communications other than evading record collection laws, something Republicans used to consider literally the most important thing in the world.",
                "So why is no one chanting \"lock him up\".",
                "Staffers used it in his first administration, in violation of the records law, and no one was prosecuted.",
                "And again it’s worth noting not a single person in that chat said anything like “why are we discussing this here? Is this normal? This seems weird to me”\n\nNo, they all went with it. This tells me that this scenario isn’t unusual for them. They do this shit all the time, which is HIGHLY DISTURBING (and illegal) and should concern EVERYONE.",
                "Where. Are. The. Consequences.",
                "As an IT Systems Engineer, it seems unfathomable that their devices are not managed and hardened by a Mobile Device Management platform. All my company phones are managed and users cannot install apps which are not approved.",
                "And the Atlantic needs to sue Heg-twerp for slander. His statements about the journalist were off the rails.\n\n“You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes,” Hegseth told reporters Monday. “This is a guy who peddles in garbage.”",
                "Well of course they did. And of course they did it anyway. And of course, every conservative alive is bending over backwards to convince themselves this is a nothing burger of a story.",
                "The people Trump has appointed are sycophants and not versed in statecraft.\n\nThey completely lack governance experience. \n\nRemember this when you or ones you love are impacted. Remember this when it's time to vote them out and hold them accountable."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "As top Trump aides sent texts on Signal, flight data show a member of the group chat was in Russia",
            "external_url": "https://www.cbsnews.com/news/trump-envoy-steve-witkoff-signal-text-group-chat-russia-putin/",
            "upvotes": 84793,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/c0560e3b-60af-44b4-9c9d-ba6be6f79b47/thumbnail/1200x630/ceffc4df08ef1c35796aa0715e3434e5/gettyimages-2199705037.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Every single action the trump admin takes is beneficial to Russia, they are acting no differently than how an agent for the Russian government would be acting in this position.",
                "> Witkoff arrived in Moscow shortly after noon local time on March 13, according to data from the flight tracking website FlightRadar24, and Russian state media broadcast video of his motorcade leaving Vnukovo International Airport shortly after.\n\n> During the group discussion on Signal, Goldberg reported, **Ratcliffe named an active CIA intelligence officer** in the chat at 5:24 p.m. eastern time, which was just after midnight in Russia. Witkoff’s flight did not leave Moscow until around 2 a.m. local time, and Sergei Markov, a former Putin advisor who is still close to the Russian president, said in a Telegram post that **Witkoff and Putin were meeting in the Kremlin until 1:30 a.m.**\n\n\nSeriously, what more is needed to charge these guys with whatever your equivalent of treason is?\n\nAt this point, I’m pretty sure the ‘VP’ in the chat was not the couch molester, it was Vladimir Putin (only half /s).",
                "This is like Watergate level, it's gotten people jailed and killed Hillary's entire political career for 1/10th of what happened.",
                "Why was a government official in Russia, meeting with Putin until 1:30 AM local time? Forget the entire Signal issue (for a moment, then don't forget it please) and try to answer that question without suggesting that this administration is completely in the pocket of Russia? You cannot do it. \n\nSomewhere, somehow, there has to be a truly patriotic Republican in Congress that will say something. Right?",
                "Republican voters decided en mass that they were pro Russia. Here we are.",
                "Wonderful.  I wonder how much more fucked up this story will get….",
                "Approx. a decade ago, a presidential candidacy imploded using a coordinated, performative, non-stop attack by right wing news outlets on Hillary’s emails; packaged and distributed so successfully by the Trump republicans that they still refer to it, literally, today. Left to center/apolitical outlets dropped the ball.\n\nDemocrats: You couldn’t ask for a more perfect opportunity. Hell, the playbook has already been written.\n\nYour move. America (and the rest of the world) is watching.",
                "This just keeps getting better and better. I know Hanlon's Razor almost certainly applies here, but this is all so perfectly damaging to the administration that I can't help but wonder is some low-ranking aid didn't send that text to the journalist as a form of whistle blowing.",
                "It's quite literally like they are working directly with Russia to provide state secrets.",
                "Whatever soil Tulsi Gabbard is standing on is technically Russian soil, so there were two."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Texas measles outbreak grows to 327 cases with 18 confirmed infections over last 5 days: Officials",
            "external_url": "https://abcnews.go.com/Health/texas-measles-outbreak-grows-327-cases-18-confirmed/story?id=120126483",
            "upvotes": 7556,
            "date": "03/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "If they aren’t getting Measles vaccinations, they probably aren’t getting Rubella vaccinations, as part of the typical measles, mumps, rubella one dose.  If Rubella spreads it will be another generation of children with severe learning disabilities.",
                "This update adds 18 new cases to the number of reported cases in Texas associated with the outbreak. Last Friday's update added 30 cases. Last Tuesday’s update added 20 new cases. The previous Friday's update added 36 cases.\n\nNo new hospitalizations or deaths were reported for Texas.",
                "There were 13 in 2020. Nationally.",
                "Got my measles status checked last week. No immunity despite 3 shots in 1971 and 1 more in 1974. (Germany)\n\nGot vaccinated again yesterday.\n\nPeople over 50, go and get your measles titer checked NOW!",
                "Did some rough math based on the article.\n\n~~.0061162079510703%~~ 0.6% of cases are with people who are vaccinated.\n\n>The CDC currently recommends that people receive two vaccine doses, the first at ages 12 to 15 months and the second between 4 and 6 years old. One dose is 93% effective, and two doses are 97% effective, the CDC says. Most vaccinated adults don't need a booster.\n\nThis is easy folks.",
                "I’m to the point of just accepting that people will be benefiting from the consequences of their actions. \n\nI got nothing else inside of me anymore.",
                "Due to idiot adults here come incoming cases of: \n\nChickenpox (varicella) vaccine\n\nCOVID-19 vaccine\n\nDengue vaccine\n\nDiphtheria, tetanus, and pertussis (DTaP, Tdap) vaccine\n\nHepatitis A (HepA) vaccine\n\nHaemophilus influenzae type b (Hib) vaccine\n\nHepatitis B (HepB) vaccine\n\nHuman papillomavirus (HPV) vaccine\n\nInfluenza (flu) vaccine\n\nMeasles, mumps, and rubella (MMR) vaccine\n\nMeningococcal (MenACWY, MenB) vaccines\n\nPneumococcal (PCV13, PPSV23) vaccines\n\nPolio (IPV) vaccine\n\nRotavirus (RV) vaccine",
                "they will somehow feel more vindicated and devoted to their cause AND they will blame liberals and find a way to punish them for allowing this to happen.",
                "Just listen to your red politicians tell you, and the orange one. they know more than doctors or scientists! bleach and vitamin C \n\nThey would never betray you *snicker snicker*",
                "\"Thanks for the chronic breathing problems, Dad!\""
            ],
            "aggregate_sentiment": 78.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court upholds Biden regulations on 'ghost gun' kits",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-biden-regulations-ghost-gun-kits-rcna180991",
            "upvotes": 647,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241007-ghost-gun-vl-105p-007c05.jpg",
            "top_comments": [
                "7-2 decision with Neil Gorsuch writing for the majority.",
                "Why hasn't trump abolished the NFA and the defunded ATF at this point?   The right has been against the ATF and has encumbered them at every turn.   Why not target those employees for cuts and effectively cripple the ATF?",
                "This was a no-brainer ruling with even normally far right judges ruling ghost guns need to be regulated. A kid was shot at a local high school (and survived) with a ghost gun. The 16 year old shooter ordered the kit online and made it himself at home. Why would anyone not think something should be done to prevent this?",
                "Bad news for corrupt NRA and MAGA gun lovers.",
                "How are the ghost busters gonna kill ghosts",
                "You can get individual parts for each gun you want to put together. It would be hard to regulate that for it's not a kit. They would be individual parts for a gun. Of course it would cost way more but I bet others have figured that out............"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "3 teen girls try to stab mom for turning off Wi-Fi: Sheriff",
            "external_url": "https://abcnews.go.com/US/3-teens-stab-mom-turning-off-wi-fi/story?id=120126479",
            "upvotes": 1369,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/57abeb79-c721-4134-b0bf-7962bc0fec4b/teens-wifi-stabbing-ktrk-jef-250325_1742907203519_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Because the mom turned off the Wi-Fi, the teens allegedly grabbed kitchen knives Sunday night and chased their mother through their Houston home and into the street, according to the sheriff. One of the girls threw a brick that hit their 39-year old mom in the ankle, and the girls' 70-year-old grandmother was knocked over while attempting to protect the mom, the sheriff's office said.\n\nAll three daughters tried to kill their mother over losing the internet. There's something more going on in that family dynamic if this kind of violent outburst happens.",
                "thank god I grew up in the 2000s when phones were only good for calls and texts and riding bikes all day with your friends till the sun set was still the thing to do ",
                "This is the behavior of addicts. I’ve been an addict most of my life. I’ve been clean for years and years but I recognize addictive behavior. Take away my drugs and I would have likely stabbed you at the worst points in my life. Social media is being designed to be addictive and it’s working.",
                "I was literally choked by my step son who at the time was 17 because I unplugged the router. He refused to go pick up his mother from work (he had taken her car and dropped her off) because he was in the middle of a League of Legends game. \n\nAt the time I was routinely doing dialysis and very weak, the only way I got him to release me was by biting his hand as hard as I fucking could. And then this little bastard rips the router out of the wall (cable) and throws it in the yard. \n\nThe addiction to the internet is absolutely crazy. Had the same kid punch a hole in my door and assault me again before he was literally thrown out. And then he has the audacity to invite me to his wedding like none of this happened. \n\nI feel for this mom. You love your kids and step kids, but these kids need to learn. Send their asses to jail or juvenile detention before they continue down this path in life.",
                "As a mom, I would not take them back. They belong to the state now.",
                "I would say I'm attached to my phone non stop. I am 32 though so for all of my childhood phones were useless, just good enough to call and text on and the odd game of snake. Then as I got into the work place as a young teen smart phones started but they were still \"ok\". Now I know the amount I use my phone is too much, but I'm also an adult that remembers not having one, so in situations where I can't use it, it doesn't bother me. I really do not envy a parent of a child old enough to use a phone.",
                "Bring back mental institutions but with wifi and gaming.  These kids will sign up for it.",
                "I'll just use the internet as a babysitter from birth. Nothing could possibly go wrong.",
                "The Veldt- Ray Bradbury",
                "Internet is too ever present in children’s lives"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Trump signs election order calling for proof of U.S. citizenship to vote",
            "external_url": "https://www.reuters.com/world/us/trump-signs-election-order-calling-proof-us-citizenship-vote-2025-03-26/",
            "upvotes": 8280,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Meanwhile, Elon came over on a student visa. Stayed after it had expired… and now has more power than any US citizen",
                "Considering this isn’t a law, that voting is up to the states, this is mostly a Big Mac fueled fart in the wind.",
                "States rights except when it is against Trumps agenda",
                "Oh hey ... those people who were really upset about overreach of the federal government. Are you all gonna be mad about Trump taking away a right reserved for the states?",
                "They aren't doing this because they expect States to follow the requirements. They are doing it because they expect *certain* states *won't*.\n\nThis is setting up a pretext for invalidating legal votes from registered voters, American citizens, specifically from blue States. \n\nThis needs to be heavily challenged in the courts and we should all hope it is shot down, because hell will break loose if the will of the people of entire States is disregarded.",
                "Article I, Section 4, Clause 1\n\n>The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.\n\n\nStates or Congress.  The Executive have the power to do change state or federal laws.  This is yet another impeachable offense, yet congress is full of feckless cowards.",
                "If they provide free, EASILY ATTAINABLE, federal ID for this purpose then I say go ahead. We all know they won’t though",
                "Sounds like very thinly veiled attempt at voter suppression.  \n\nDon't the states regulate who, what, where voting takes place?  I am sure this will be in court in a matter of weeks.",
                "Trump will announce that the 2028 election has too many security failures and declare a state of emergency over election interference early in the year. The election may be cancelled.\n\nWe are right in the middle of it, folks. This is not my random redditor theory, this is the discussion being held about Trump trying to subvert term limits and how he'll do it. Prepare your pitchforks now, you'll need them in a few years.",
                "gonna be funny when a lot of people realize they don't have proof of citizenship. probably mostly older people, since their documents are more likely to be lost/damaged, and/or difficult/impossible to replace"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Kidnapped 6-year-old rescued by Kansas trooper during traffic stop",
            "external_url": "https://abcnews.go.com/US/kidnapped-6-year-rescued-kansas-trooper-traffic-stop/story?id=120141588",
            "upvotes": 277,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/3be774e0-beef-4c53-9efb-9cc639386792/abducted-child-saved-ht-jt-250325_1742928216325_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Officials said the driver of the vehicle had a criminal history that included homicide and numerous weapons violations.\n\n>\"Thankfully the girl was unharmed, and the men were taken into custody,\" officials added.\n\nThe girl had been kidnapped for over a month. Both the men were over 60. I feel like there's more to the story.",
                "Would this have fallen under/triggered an Amber Alert when it happened or are there specific guidelines for that?.\n\nHonest question",
                "This is terrifying. A 6-year-old was missing for over a month, and the only reason she was found was pure luck during a routine traffic stop? How many other missing kids are out there, slipping through the cracks? Thank God this trooper did his job, but this just shows how broken the system can be"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 3007,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were.",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "What was the reasoning to even share any of this info over the chat? I'm assuming everyone was already briefed that they would attack, why did they need to discuss details? None of them were directly involved, it's not like \"hey, here's the time of the strike so be ready to press the launch button!\"\n\nBeyond the stupidity of it all it seems so unnecessary."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Kentucky governor vetoes GOP abortion bill, says it undermines doctors and endangers pregnant women",
            "external_url": "https://apnews.com/article/kentucky-legislature-abortion-beshear-governor-roe-wade-b96d48ba703e765448458bd0d05c691e",
            "upvotes": 469,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "GOP lawmakers: “umm, yeah. That was the whole point of the bill”",
                "No telling how many peoples lives Beshear just saved 🥰",
                "“It’s not meant to be an exhaustive list but it is the most common issues that physicians and mothers, who are facing a crisis pregnancy, are facing,” Republican state Rep. Kimberly Poore Moser said during a House debate on the measure.\n\nSounds like somebody has never heard of **Expresio unius est exclusio alterius**: “the express mention of one thing excludes all others.” This term is often used to show exclusivity of a list (i.e., if an item is not listed, it is not included).  And this list would absolutely be used this way."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Phoenix police officers suspended after sudden arrest of deaf man with cerebral palsy",
            "external_url": "https://www.abc15.com/news/local-news/investigations/phoenix-police-officers-suspended-after-sudden-arrest-of-deaf-man-with-cerebral-palsy",
            "upvotes": 724,
            "date": "03/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9559a2f/2147483647/strip/true/crop/1440x756+16+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F7a%2F42%2F85c1702048538496413ea6cd4b6b%2Fscreenshot-2024-10-17-at-6-08-24-pm.png",
            "top_comments": [
                "Backstory: white (homeless?) guy at a nearby convenience store was causing trouble, owner called cops.  Cops showed up, white guy told them it was the black guy across the street.  Cops roll around, jump out of the car and beat the everloving sh\\*t out of the black guy, who is deaf and has cerebral palsy so couldn't articulate anything before they assaulted him.  On top of it all, they charged him with with resisting arrest and aggravated assault on a police officer.  There are multiple videos of the whole encounter.\n\nNow the three cops involved get a 24hr suspension without pay.",
                "24 hour work hour suspension and \"de-escalation training\".  Cop was swinging fists the second he opened the car door and this is all he gets...\n\n  \nMeanwhile:\n\n“We are appalled by the determination made by Interim Chief Sullivan to suspend the three officers involved in the McAlpin case. A situation that was previously reviewed internally by subject matter experts of the Force Evaluation and Review Unit and deemed to be within policy has suddenly been reversed due to public pressure, based on biased media reporting.” The Phoenix Law Enforcement Association.",
                "Im.convinced these cops who do this just enjoy inflicting harm on others as a source of pleasure.",
                "Cops love it when you sue them. You pay for it. Either way it’s a win win for them.\n\nUntil you vote out their protections and make them do hard time and pay out of pocket, they will continue to do this with a smile on their face",
                "White person falsely accusing black person and police accepting it.  Check.  Barking incomprehensible orders.  Check.  Driving up on a person that makes confrontation almost a guarantee (like Tamir Rice).  Check.  Excessive force.  Check.  \"perpetrator assumed a fighting stance\" when nothing of the sort happened.  Check.  Doling out tasers like they were candy.  check.  Police lying on report.  Check.  Attacking someone whom any reasonable person would know had physical problems.  Check.  Lying on reports.  Check.  Letting obviously bogus charges hang over person so they can get leverage over lawsuits.  Check.\n\nThis case has it all and I'm sure I missed something.\n\nPeople can say, \"How did they know he was deaf?\"  Well, maybe they need to slow down and realize that people with hearing problems live full lives and do stuff like, you know, go to the store.  A person, deaf or not, has the benefit of the doubt and maybe takes a second or two to go, \"Woah..what's happening!?\"",
                "This is one of those situations people are alluding to when they say \"white privilege.\"  \n\nIt doesn't mean all white people have it *easy*, but it sure *does* make you less likely to get the ever living shit beaten out of you by police while minding your own business.",
                "24 hours, suspended for a single day.",
                "Deplorable, these cowards attacked a visibly handicapped person for kicks, just for fun. \n\nSo disappointing. If you're curious where this fascist takeover is going, just look at Arizona. It's been 20 years since civil rights meant anything in that state.",
                "Fuck the police so fucking hard. I hate living here",
                "just saw the video, fat sack of shit was huffing and puffing like he just ran a marathon. must be hard work punching disabled people in the back while your buddy is tazing them. quick reminder that Phoenix police ranks #1 in deadly use of force compared to other major departments"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: DOGE staffer, 'Big Balls', provided tech support to cybercrime ring, records show",
            "external_url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/?utm_source=reddit.com",
            "upvotes": 22138,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He still does, but he used to, too.",
                "The people involved with modifying code on our most sensitive electronic systems are not only just fresh out of school, but are sketchy as hell. \n\nAs a cybersecurity professional, I'm terrified. \n\nMost people can't comprehend how bad this stuff is.\n\nEdit: \n\nHere's a fun thought experiment:\n\n1) Look at the cybersecurity actions taken by this administration. \n2) Think about what actions a compromised President/Cabinet would take regarding cybersecurity. \n3) Ask yourself, what actions would a foreign agent of Russia take that ARE ANY DIFFERENT than what we all have seen up to this point. \n\nEducate yourself! The ONLY way ANY of this makes sense is with this context. Krasnov is destroying this country.\n\nhttps://www.csoonline.com/article/3829710/firing-of-130-cisa-staff-worries-cybersecurity-industry.html/amp/\n\nhttps://www.cybersecuritydive.com/news/dhs-disbands-advisory-board-csrb/737976/\n\nhttps://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343\n\nhttps://www.euronews.com/my-europe/2025/03/13/fact-checking-online-claims-that-donald-trump-was-recruited-by-the-kgb-as-krasnov",
                "Ok, as a reminder to everyone about \"Big Balls\".  \n\nHe is the grandson of a KGB spy.\n\nHe was fired from an internship at a cyber security company for leaking company info to a competitor. \n\nAnd now we know he's involved with crime rings.",
                "You mean the guys who use ICE to run the country like a mob hire people from the underworld?",
                "If you want to use criminal tactics to be successful criminals, hire criminals.",
                "I There's something so deeply unsettling about the fact that literally a group of people from 4chan are not only in charge of the US government, but have proceeded to transform said government according to 4chan's ideal of the perfect government and are also implementing 4chan lingo into the government itself. I don't think i'll ever be able to get used to this. Even 60 years from now i feel like i'll still remember this period and continue to wonder \"wtf happened there?\"",
                "We already know he's working with Elon and Trump. Nothing new.",
                "He will work for any cybercrime group. He has chosen DOGE in this case.",
                "This is not the level of professionalism we expect from Big Balls.",
                "SOB ... 28 years, 3 time polygraphed ... friends I hadn't seen in years contacted by Suits & Ray-Bans and they let this little fucker have free reign over entire CRITICAL systems???\n\nI'm fucking pissed.\n\nTHIS should get people out in the streets!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Florida woman ‘Content creator’ arrested for posting video involving herself engaging in sexual activity with a dog.",
            "external_url": "https://www.wcjb.com/2025/03/24/content-creator-arrested-posting-video-involving-dog-marion-county/",
            "upvotes": 1286,
            "date": "03/26/2025",
            "thumbnail": "https://gray-wcjb-prod.gtv-cdn.com/resizer/v2/FJ27FPZAXRGM3MSUVYEXXSBX3M.png?auth=ce25180090c44ebf6f805c3c6f67f76e296458d536cb074b8a36a299977b6ac1&width=1200&height=600&smart=false&focal=209%2C193",
            "top_comments": [
                "According to the detective investigating the case: \"...I have seen it before so it's not out of the ordinary unfortunately.\"\n\nChihuahua sex: just another Tuesday in Florida.",
                "People paid $500 to watch her video. That should be the shocking part, but it’s not.",
                "As of this article, she is still in ownership of the abused animal(s).",
                "oh great which cabinet member this time?",
                "It 530AM where I’m at. That’s enough internet for today…",
                "Kids, that's not what we call \"content\"\n\nIt's just what we call \"fucking wrong\"",
                "Okay, that’s enough reddit for today",
                "https://imgur.com/a/m3UuPTE\n\nFrom her instagram 🤢",
                "We really need to just shut down all social media.  Humanity isn't ready.  As much as I'm assuming most people in the comments in here will think what she did is disgusting... we all know there is a group of people out there searching the internet for said video right now.",
                "\"Unfortunately this isn't my first case of this nature,\" said Batts. \"It's always shocking, it'll never not be shocking especially when you have to watch the video but I have seen it before so it's not out of the ordinary unfortunately.\"\n\n\nWTF."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Jack Dorsey’s Block to lay off nearly 1,000 workers in another reorganization",
            "external_url": "https://www.theguardian.com/technology/2025/mar/25/block-layoffs-jack-dorsey-cashapp-square-tidal",
            "upvotes": 1166,
            "date": "03/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3d7ff25cbfa4d55f933a2c38c35c0584341ad6e0/0_84_4993_2996/master/4993.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=47bc674b9a3cb41c0658a264b624b16c",
            "top_comments": [
                "\"Dorsey noted in his email that part of his job is to increase the company’s stock value and that this reorganization “will help us focus and execute better to do just that”.\"\n\nAt least he's honest, I guess. Still a dirtbag.",
                "CEOs jerk themselves off at night thinking of all the lives they've ruined.",
                "How can they not make any money?\n\n“Block now operates payment platforms Square and Afterpay, the money transfer app CashApp, and the music streaming service Tidal.”",
                "Maybe he should sell Tidal back to Jay Z. That's a clean 300 million he should have never spent.",
                "I wish this architect of our current predicament many more failures",
                "Look at what happened to Twitter BEFORE Elon. It was already in a hole. This new venture doesn't have much leg to stand on, I imagine and this is just sign of it.",
                "Uncertainty from the tariffs is stalling our economy. ",
                "Man this guy sucks at CEO.",
                "Another one to be jailed soon"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 3010,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were.",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "What was the reasoning to even share any of this info over the chat? I'm assuming everyone was already briefed that they would attack, why did they need to discuss details? None of them were directly involved, it's not like \"hey, here's the time of the strike so be ready to press the launch button!\"\n\nBeyond the stupidity of it all it seems so unnecessary."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Kentucky governor vetoes GOP abortion bill, says it undermines doctors and endangers pregnant women",
            "external_url": "https://apnews.com/article/kentucky-legislature-abortion-beshear-governor-roe-wade-b96d48ba703e765448458bd0d05c691e",
            "upvotes": 467,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "GOP lawmakers: “umm, yeah. That was the whole point of the bill”",
                "No telling how many peoples lives Beshear just saved 🥰",
                "“It’s not meant to be an exhaustive list but it is the most common issues that physicians and mothers, who are facing a crisis pregnancy, are facing,” Republican state Rep. Kimberly Poore Moser said during a House debate on the measure.\n\nSounds like somebody has never heard of **Expresio unius est exclusio alterius**: “the express mention of one thing excludes all others.” This term is often used to show exclusivity of a list (i.e., if an item is not listed, it is not included).  And this list would absolutely be used this way."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court upholds Biden regulations on 'ghost gun' kits",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-biden-regulations-ghost-gun-kits-rcna180991",
            "upvotes": 646,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241007-ghost-gun-vl-105p-007c05.jpg",
            "top_comments": [
                "7-2 decision with Neil Gorsuch writing for the majority.",
                "Why hasn't trump abolished the NFA and the defunded ATF at this point?   The right has been against the ATF and has encumbered them at every turn.   Why not target those employees for cuts and effectively cripple the ATF?",
                "This was a no-brainer ruling with even normally far right judges ruling ghost guns need to be regulated. A kid was shot at a local high school (and survived) with a ghost gun. The 16 year old shooter ordered the kit online and made it himself at home. Why would anyone not think something should be done to prevent this?",
                "Bad news for corrupt NRA and MAGA gun lovers.",
                "How are the ghost busters gonna kill ghosts",
                "You can get individual parts for each gun you want to put together. It would be hard to regulate that for it's not a kit. They would be individual parts for a gun. Of course it would cost way more but I bet others have figured that out............"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Trump signs election order calling for proof of U.S. citizenship to vote",
            "external_url": "https://www.reuters.com/world/us/trump-signs-election-order-calling-proof-us-citizenship-vote-2025-03-26/",
            "upvotes": 8295,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Meanwhile, Elon came over on a student visa. Stayed after it had expired… and now has more power than any US citizen",
                "Considering this isn’t a law, that voting is up to the states, this is mostly a Big Mac fueled fart in the wind.",
                "States rights except when it is against Trumps agenda",
                "Oh hey ... those people who were really upset about overreach of the federal government. Are you all gonna be mad about Trump taking away a right reserved for the states?",
                "They aren't doing this because they expect States to follow the requirements. They are doing it because they expect *certain* states *won't*.\n\nThis is setting up a pretext for invalidating legal votes from registered voters, American citizens, specifically from blue States. \n\nThis needs to be heavily challenged in the courts and we should all hope it is shot down, because hell will break loose if the will of the people of entire States is disregarded.",
                "Article I, Section 4, Clause 1\n\n>The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.\n\n\nStates or Congress.  The Executive have the power to do change state or federal laws.  This is yet another impeachable offense, yet congress is full of feckless cowards.",
                "If they provide free, EASILY ATTAINABLE, federal ID for this purpose then I say go ahead. We all know they won’t though",
                "Sounds like very thinly veiled attempt at voter suppression.  \n\nDon't the states regulate who, what, where voting takes place?  I am sure this will be in court in a matter of weeks.",
                "Trump will announce that the 2028 election has too many security failures and declare a state of emergency over election interference early in the year. The election may be cancelled.\n\nWe are right in the middle of it, folks. This is not my random redditor theory, this is the discussion being held about Trump trying to subvert term limits and how he'll do it. Prepare your pitchforks now, you'll need them in a few years.",
                "gonna be funny when a lot of people realize they don't have proof of citizenship. probably mostly older people, since their documents are more likely to be lost/damaged, and/or difficult/impossible to replace"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: DOGE staffer, 'Big Balls', provided tech support to cybercrime ring, records show",
            "external_url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/?utm_source=reddit.com",
            "upvotes": 22158,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He still does, but he used to, too.",
                "The people involved with modifying code on our most sensitive electronic systems are not only just fresh out of school, but are sketchy as hell. \n\nAs a cybersecurity professional, I'm terrified. \n\nMost people can't comprehend how bad this stuff is.\n\nEdit: \n\nHere's a fun thought experiment:\n\n1) Look at the cybersecurity actions taken by this administration. \n2) Think about what actions a compromised President/Cabinet would take regarding cybersecurity. \n3) Ask yourself, what actions would a foreign agent of Russia take that ARE ANY DIFFERENT than what we all have seen up to this point. \n\nEducate yourself! The ONLY way ANY of this makes sense is with this context. Krasnov is destroying this country.\n\nhttps://www.csoonline.com/article/3829710/firing-of-130-cisa-staff-worries-cybersecurity-industry.html/amp/\n\nhttps://www.cybersecuritydive.com/news/dhs-disbands-advisory-board-csrb/737976/\n\nhttps://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343\n\nhttps://www.euronews.com/my-europe/2025/03/13/fact-checking-online-claims-that-donald-trump-was-recruited-by-the-kgb-as-krasnov",
                "Ok, as a reminder to everyone about \"Big Balls\".  \n\nHe is the grandson of a KGB spy.\n\nHe was fired from an internship at a cyber security company for leaking company info to a competitor. \n\nAnd now we know he's involved with crime rings.",
                "You mean the guys who use ICE to run the country like a mob hire people from the underworld?",
                "If you want to use criminal tactics to be successful criminals, hire criminals.",
                "I There's something so deeply unsettling about the fact that literally a group of people from 4chan are not only in charge of the US government, but have proceeded to transform said government according to 4chan's ideal of the perfect government and are also implementing 4chan lingo into the government itself. I don't think i'll ever be able to get used to this. Even 60 years from now i feel like i'll still remember this period and continue to wonder \"wtf happened there?\"",
                "We already know he's working with Elon and Trump. Nothing new.",
                "He will work for any cybercrime group. He has chosen DOGE in this case.",
                "This is not the level of professionalism we expect from Big Balls.",
                "SOB ... 28 years, 3 time polygraphed ... friends I hadn't seen in years contacted by Suits & Ray-Bans and they let this little fucker have free reign over entire CRITICAL systems???\n\nI'm fucking pissed.\n\nTHIS should get people out in the streets!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Kidnapped 6-year-old rescued by Kansas trooper during traffic stop",
            "external_url": "https://abcnews.go.com/US/kidnapped-6-year-rescued-kansas-trooper-traffic-stop/story?id=120141588",
            "upvotes": 280,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/3be774e0-beef-4c53-9efb-9cc639386792/abducted-child-saved-ht-jt-250325_1742928216325_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Officials said the driver of the vehicle had a criminal history that included homicide and numerous weapons violations.\n\n>\"Thankfully the girl was unharmed, and the men were taken into custody,\" officials added.\n\nThe girl had been kidnapped for over a month. Both the men were over 60. I feel like there's more to the story.",
                "Would this have fallen under/triggered an Amber Alert when it happened or are there specific guidelines for that?.\n\nHonest question",
                "This is terrifying. A 6-year-old was missing for over a month, and the only reason she was found was pure luck during a routine traffic stop? How many other missing kids are out there, slipping through the cracks? Thank God this trooper did his job, but this just shows how broken the system can be"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Phoenix police officers suspended after sudden arrest of deaf man with cerebral palsy",
            "external_url": "https://www.abc15.com/news/local-news/investigations/phoenix-police-officers-suspended-after-sudden-arrest-of-deaf-man-with-cerebral-palsy",
            "upvotes": 727,
            "date": "03/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9559a2f/2147483647/strip/true/crop/1440x756+16+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F7a%2F42%2F85c1702048538496413ea6cd4b6b%2Fscreenshot-2024-10-17-at-6-08-24-pm.png",
            "top_comments": [
                "Backstory: white (homeless?) guy at a nearby convenience store was causing trouble, owner called cops.  Cops showed up, white guy told them it was the black guy across the street.  Cops roll around, jump out of the car and beat the everloving sh\\*t out of the black guy, who is deaf and has cerebral palsy so couldn't articulate anything before they assaulted him.  On top of it all, they charged him with with resisting arrest and aggravated assault on a police officer.  There are multiple videos of the whole encounter.\n\nNow the three cops involved get a 24hr suspension without pay.",
                "24 hour work hour suspension and \"de-escalation training\".  Cop was swinging fists the second he opened the car door and this is all he gets...\n\n  \nMeanwhile:\n\n“We are appalled by the determination made by Interim Chief Sullivan to suspend the three officers involved in the McAlpin case. A situation that was previously reviewed internally by subject matter experts of the Force Evaluation and Review Unit and deemed to be within policy has suddenly been reversed due to public pressure, based on biased media reporting.” The Phoenix Law Enforcement Association.",
                "Im.convinced these cops who do this just enjoy inflicting harm on others as a source of pleasure.",
                "Cops love it when you sue them. You pay for it. Either way it’s a win win for them.\n\nUntil you vote out their protections and make them do hard time and pay out of pocket, they will continue to do this with a smile on their face",
                "White person falsely accusing black person and police accepting it.  Check.  Barking incomprehensible orders.  Check.  Driving up on a person that makes confrontation almost a guarantee (like Tamir Rice).  Check.  Excessive force.  Check.  \"perpetrator assumed a fighting stance\" when nothing of the sort happened.  Check.  Doling out tasers like they were candy.  check.  Police lying on report.  Check.  Attacking someone whom any reasonable person would know had physical problems.  Check.  Lying on reports.  Check.  Letting obviously bogus charges hang over person so they can get leverage over lawsuits.  Check.\n\nThis case has it all and I'm sure I missed something.\n\nPeople can say, \"How did they know he was deaf?\"  Well, maybe they need to slow down and realize that people with hearing problems live full lives and do stuff like, you know, go to the store.  A person, deaf or not, has the benefit of the doubt and maybe takes a second or two to go, \"Woah..what's happening!?\"",
                "This is one of those situations people are alluding to when they say \"white privilege.\"  \n\nIt doesn't mean all white people have it *easy*, but it sure *does* make you less likely to get the ever living shit beaten out of you by police while minding your own business.",
                "24 hours, suspended for a single day.",
                "Deplorable, these cowards attacked a visibly handicapped person for kicks, just for fun. \n\nSo disappointing. If you're curious where this fascist takeover is going, just look at Arizona. It's been 20 years since civil rights meant anything in that state.",
                "Fuck the police so fucking hard. I hate living here",
                "just saw the video, fat sack of shit was huffing and puffing like he just ran a marathon. must be hard work punching disabled people in the back while your buddy is tazing them. quick reminder that Phoenix police ranks #1 in deadly use of force compared to other major departments"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "3 teen girls try to stab mom for turning off Wi-Fi: Sheriff",
            "external_url": "https://abcnews.go.com/US/3-teens-stab-mom-turning-off-wi-fi/story?id=120126479",
            "upvotes": 1368,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/57abeb79-c721-4134-b0bf-7962bc0fec4b/teens-wifi-stabbing-ktrk-jef-250325_1742907203519_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Because the mom turned off the Wi-Fi, the teens allegedly grabbed kitchen knives Sunday night and chased their mother through their Houston home and into the street, according to the sheriff. One of the girls threw a brick that hit their 39-year old mom in the ankle, and the girls' 70-year-old grandmother was knocked over while attempting to protect the mom, the sheriff's office said.\n\nAll three daughters tried to kill their mother over losing the internet. There's something more going on in that family dynamic if this kind of violent outburst happens.",
                "thank god I grew up in the 2000s when phones were only good for calls and texts and riding bikes all day with your friends till the sun set was still the thing to do ",
                "This is the behavior of addicts. I’ve been an addict most of my life. I’ve been clean for years and years but I recognize addictive behavior. Take away my drugs and I would have likely stabbed you at the worst points in my life. Social media is being designed to be addictive and it’s working.",
                "I was literally choked by my step son who at the time was 17 because I unplugged the router. He refused to go pick up his mother from work (he had taken her car and dropped her off) because he was in the middle of a League of Legends game. \n\nAt the time I was routinely doing dialysis and very weak, the only way I got him to release me was by biting his hand as hard as I fucking could. And then this little bastard rips the router out of the wall (cable) and throws it in the yard. \n\nThe addiction to the internet is absolutely crazy. Had the same kid punch a hole in my door and assault me again before he was literally thrown out. And then he has the audacity to invite me to his wedding like none of this happened. \n\nI feel for this mom. You love your kids and step kids, but these kids need to learn. Send their asses to jail or juvenile detention before they continue down this path in life.",
                "As a mom, I would not take them back. They belong to the state now.",
                "I would say I'm attached to my phone non stop. I am 32 though so for all of my childhood phones were useless, just good enough to call and text on and the odd game of snake. Then as I got into the work place as a young teen smart phones started but they were still \"ok\". Now I know the amount I use my phone is too much, but I'm also an adult that remembers not having one, so in situations where I can't use it, it doesn't bother me. I really do not envy a parent of a child old enough to use a phone.",
                "Bring back mental institutions but with wifi and gaming.  These kids will sign up for it.",
                "I'll just use the internet as a babysitter from birth. Nothing could possibly go wrong.",
                "The Veldt- Ray Bradbury",
                "Internet is too ever present in children’s lives"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Florida woman ‘Content creator’ arrested for posting video involving herself engaging in sexual activity with a dog.",
            "external_url": "https://www.wcjb.com/2025/03/24/content-creator-arrested-posting-video-involving-dog-marion-county/",
            "upvotes": 1285,
            "date": "03/26/2025",
            "thumbnail": "https://gray-wcjb-prod.gtv-cdn.com/resizer/v2/FJ27FPZAXRGM3MSUVYEXXSBX3M.png?auth=ce25180090c44ebf6f805c3c6f67f76e296458d536cb074b8a36a299977b6ac1&width=1200&height=600&smart=false&focal=209%2C193",
            "top_comments": [
                "According to the detective investigating the case: \"...I have seen it before so it's not out of the ordinary unfortunately.\"\n\nChihuahua sex: just another Tuesday in Florida.",
                "People paid $500 to watch her video. That should be the shocking part, but it’s not.",
                "As of this article, she is still in ownership of the abused animal(s).",
                "oh great which cabinet member this time?",
                "It 530AM where I’m at. That’s enough internet for today…",
                "Kids, that's not what we call \"content\"\n\nIt's just what we call \"fucking wrong\"",
                "Okay, that’s enough reddit for today",
                "https://imgur.com/a/m3UuPTE\n\nFrom her instagram 🤢",
                "We really need to just shut down all social media.  Humanity isn't ready.  As much as I'm assuming most people in the comments in here will think what she did is disgusting... we all know there is a group of people out there searching the internet for said video right now.",
                "\"Unfortunately this isn't my first case of this nature,\" said Batts. \"It's always shocking, it'll never not be shocking especially when you have to watch the video but I have seen it before so it's not out of the ordinary unfortunately.\"\n\n\nWTF."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Pentagon warned staffers against using Signal before White House chat leak",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/signal-app-leaked-war-plans",
            "upvotes": 48790,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e9d13fd637f3222076970307f6bf673f887580ab/0_210_5088_3052/master/5088.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bf6968ef97f9538f9c42cdd176beff5",
            "top_comments": [
                ">But according to a Pentagon “OPSEC special bulletin” seen by NPR reporters and sent on 18 March, Russian hacking groups may exploit the vulnerability in Signal to spy on encrypted organizations, potentially targeting “persons of interest”.\n\nI guess Pete Hegseth didn’t get the memo.",
                "There is no justification for using Signal for official communications other than evading record collection laws, something Republicans used to consider literally the most important thing in the world.",
                "So why is no one chanting \"lock him up\".",
                "Staffers used it in his first administration, in violation of the records law, and no one was prosecuted.",
                "And again it’s worth noting not a single person in that chat said anything like “why are we discussing this here? Is this normal? This seems weird to me”\n\nNo, they all went with it. This tells me that this scenario isn’t unusual for them. They do this shit all the time, which is HIGHLY DISTURBING (and illegal) and should concern EVERYONE.",
                "Where. Are. The. Consequences.",
                "As an IT Systems Engineer, it seems unfathomable that their devices are not managed and hardened by a Mobile Device Management platform. All my company phones are managed and users cannot install apps which are not approved.",
                "And the Atlantic needs to sue Heg-twerp for slander. His statements about the journalist were off the rails.\n\n“You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes,” Hegseth told reporters Monday. “This is a guy who peddles in garbage.”",
                "Well of course they did. And of course they did it anyway. And of course, every conservative alive is bending over backwards to convince themselves this is a nothing burger of a story.",
                "The people Trump has appointed are sycophants and not versed in statecraft.\n\nThey completely lack governance experience. \n\nRemember this when you or ones you love are impacted. Remember this when it's time to vote them out and hold them accountable."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "03/26/2025 16:11:06 UTC"
}