{
    "posts": [
        {
            "category": "HOT",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 5530,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "In simple terms, my rates are going up, big time",
                "\"CEO Andrew Witty steps down\"\n\n'Hey guys, make sure EVERYONE knows I'm not CEO of UnitedHealth anymore. Issue press releases, take out ads, maybe put up a banner with the new guys face on it....'",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "This was moments after the board voted against metal detectors outside annual forecast meetings",
                "> surging medical costs send its shares plunging more than 11%\n\nWhich is a perfect example of why medical care should not be a for-profit enterprise.",
                "Who could have guessed assassinating one CEO could have collapsed a company so badly.  There stock price is down like 40% just in the past 6 months, and they’ve lost a second ceo now too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Microsoft is cutting 3% of all workers",
            "external_url": "https://www.cnbc.com/2025/05/13/microsoft-is-cutting-3percent-of-workers-across-the-software-company.html",
            "upvotes": 1650,
            "date": "05/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144510-17471116752024-04-30t031054z_160536770_rc2pg7auia21_rtrmadp_0_microsoft-indonesia.jpeg?v=1747111745&w=1920&h=1080",
            "top_comments": [
                "Next week: Facebook, Meta and Google are cutting 3% of all workers.",
                "“Microsoft had 228,000 employees worldwide at the end of June, meaning that the move will affect thousands of employees.”\n\nSheeeesh",
                "\"Not related to performance\" makes it that much worse.",
                "I really think developed economies will have to figure out how they will deal with AI inevitably displacing so many jobs. Of course, we are instead going to wait for the crisis to occur and then try to implement a half-assed solution.",
                "Don't dedicate yourself unless you have one of these two titles, OWNER or SHAREHOLDER. There is ZERO loyalty time to recognize.",
                "Its better than the 10% every year they used to do in the 2000-2012.",
                "I know multiple people working at nonprofits in Washington state that are getting laid off as many are trimming 80%+ of their staff or shutting down entirely. Some of these orgs have been successfully serving their community for decades but are dependent on funds from the state and/or corporations like Microsoft and both are drying up entirely. Thousands of folks are losing their jobs and the ripple effect on the community they spend money in and the people they serve is going to hit hard and won’t correct any time soon. This is the calm before the storm not the storm.",
                "Highly profitable company continues to do things to keep shareholders happy rather than focusing on the employees that make them highly profitable. News at 11.",
                "That'll be the bottom of the performance review bell curve then",
                "Increased their net profits by 12%, made a net profit of nearly 100 billion. This should be against the law for a corporation to cut hard working American jobs when they're earning billions. Shameful"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "HOT",
            "title": "Georgia college student remains in ICE custody after mistaken traffic stop",
            "external_url": "https://abcnews.go.com/US/georgia-college-student-remains-ice-custody-after-mistaken/story?id=121733067",
            "upvotes": 1889,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/145e291d-1815-44a8-887f-9b25c2025ec8/daltonstate_1747092879614_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I'd like to know how she ended up in ICE custody. She gets pulled over by mistake (charges have already been dismissed), and then what? Are the cops asking for the immigration status of everyone they pull over? Was she driving without a DL which triggers inquiry and then ICE arrives to detain her while they figure out if she's legal? Same with her father who got pulled over going 19mph over the limit. For most people, this is a ticket and then you go home. What is going on between them getting pulled over and detained so they end up with ICE? Because ICE can't pull people over.\n\nThere is no central registry of citizens. The only documents which prove your citizenship are your passport, naturalization certificate, or birth certificate, which most people don't carry with them at all times.. Which to me means that cops are looping in ICE on anyone they may suspect to be undocumented... and I don't see how that isn't effectively just racial profiling on Latinos in the United States.",
                "The article makes it sound like she actually is and always has been undocumented. I'm asking because I truly have no idea; how does an undocumented person obtain a driver's license and enroll in a university? ",
                "This is beyond scary at this point.",
                "Reading the article it says she’s been in the U.S. since she was 4yo but her parents say she couldn’t register under DACA since the program ended. I thought DACA is technically still in place? Or at least it shouldve been 10 years ago unless I’m reading this wrong",
                "[removed]",
                "19 mph over is a violent offender?",
                "We legals have nothing to worry about?  \n  Yeah, sure...",
                "If you ever wondered what you would do if you lived during the rise of the nazis, it's what you're doing right now.",
                "We now have Nazi checkpoints - “show me ze paperz be  vor we shoot!”",
                "The thing that makes me nervous is that if an undocumented immigrant knows that any encounter with law enforcement will result in their detention, they're not going to willingly agree to any encounters with law enforcement. \n\nThat means running, or dangerous high speed chases, or maybe even shootouts that endanger not only the immigrants life but bystanders and officers'  lives. It means undocumented immigrants will not report crimes they're victims of, leaving violent offenders to ravage communities. It means rampant domestic violence and human trafficking."
            ],
            "aggregate_sentiment": 53.0
        },
        {
            "category": "HOT",
            "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
            "external_url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
            "upvotes": 4187,
            "date": "05/13/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
            "top_comments": [
                "This man is such a disgusting, vile pig.",
                "Reminder: multiple French celebrities said he shouldn't face trial because he made some great films.\n\n[https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/](https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/)\n\nMacron himself said this only last December:\n\n>\"I’ll say it as France’s president but also as a citizen, he makes France proud.\"",
                "Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions.\n\n\"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu.\n\n\"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law.\n\n\"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\"\n\nDepardieu's reputation is now in tatters, and there may be more allegations to come.\n\nDiebolt told Sky News that around 20 other women have said that they were attacked by the actor.\n\nAnd we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould.\n\nMs Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris",
                "Noooo...he just looks and sounds like the person you'd most expect. \n\nPlus he did some real weird shit with his daughter on vacation once. Pretended to be her lover. What a creep.",
                "I saw an interview with him years ago where he admitted--well, bragged is actually a more appropriate word--that him and his buddy would go out looking for women to rape when they were teenagers. He laughed about it.",
                "That sentence is a disgrace",
                "Isnt he a roomate with Steven \"The Whale\" Seagal in Russia?",
                "It’s always the people you most expect.",
                "What a giant fucking turd.",
                "Never liked this dude. Always had a creepy vibe."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "UnitedHealth CEO suddenly steps down for 'personal reasons'",
            "external_url": "https://www.nbcnews.com/business/business-news/unitedhealth-group-appoints-new-ceo-suspends-annual-forecast-rcna206445",
            "upvotes": 1015,
            "date": "05/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250513-andrew-witty-mb-1352-8cf015.jpg",
            "top_comments": [
                "He finally found out about the last guy",
                "Visited by 3 ghosts, perhaps?",
                "Did he get a visit from three spirits in the middle of the night?",
                "\"Personal reasons\" being his shareholders are suing the company for pro-consumer acts after the past CEO was killed.",
                "Thoughts and copayments…",
                "Constantly looking over your shoulder can be stressful.",
                "Oh did his contract finally expire? The crossroad demon finally came to claim what’s his?",
                "Yeah, he doesn’t want to be shot….",
                "Someone park a plumbing van outside his house for a few days?",
                "Is this the guy that was mad because he thought he was taken out of context by a journalist?\n\nLike the story was that he said patients didn't need to be cleaned. He did some big interview where he clarifies that he didn't say that and what he really said was it's okay for people to be dirty for a little bit and that it's okay if people in the hospital have their asses caked in shit for a little while, as if that was any better of a response."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Former Philippine president Rodrigo Duterte wins mayoral election from jail cell at The Hague",
            "external_url": "https://www.abc.net.au/news/2025-05-13/rodrigo-duterte-wins-philippines-mayoral-election/105285210",
            "upvotes": 683,
            "date": "05/13/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/9ba55be4146681f1628414f45655e334?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
            "top_comments": [
                "Wait, I missed episodes there, I didn't even know he was at the Hague!",
                "WFH mayorship means Work From Hague",
                "Filipinos couldn't stand American stupidity being the only thing in the news",
                ">The former president's two sons were also set to win posts on Monday, one re-elected congressman and the other winning the contest for Davao vice-mayor and likely to serve in his father's absence.\n\nInteresting to see this. I wonder what's going to happen if he loses the case.",
                "So they elected a convicted felon, you say?",
                "He subsequently gave a passionate, rousing, and hair-raising victory speech to the seven cell bars, before being hushed into silence by the guards. He did, however, get three slices of apples as a congratulatory present, instead of the standard two.",
                "This seems fine, right?  WTF?",
                "how bad does your life have to be to vote for con men and criminals?",
                "The guy who said he'd go out and execute \"drug dealers\" himself on the streets",
                "The whole Marcos/Duterte thing in Philippines politics is wild.\n\nI highly recommend this episode of *If You're Listening* by Matt Bevan about it.\n\nhttps://youtu.be/pZ-9hfWk8TI"
            ],
            "aggregate_sentiment": 68.0
        },
        {
            "category": "HOT",
            "title": "US will fast-track Utah uranium mine permit",
            "external_url": "https://www.reuters.com/sustainability/us-will-fast-track-utah-uranium-mine-permit-2025-05-12/?utm_source=chatgpt.com",
            "upvotes": 758,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fast-track = skip all those pesky environmental and safety rules.",
                "They were sloppy with uranium mines in the middle of the 20th century and it ended up poisoning a lot of Navajo communities. This is a recipe for disaster.",
                "Fuel costs are a relatively small part of the budget for an operating nuclear power plant, let alone the overall costs to design/permit/build new capacity. All this is going to do is likely give that specific mine a competitive advantage, due to lax permitting requirements.\n\nEdit: That is, of course, ignoring the potential environmental issues from the lax permitting. Just from a pragmatic point of view, increasing the supply of uranium seems pretty unlikely to do anything for actual energy production.",
                "It's an existing mine that's been in care and maintenance since the early 1990s. The company in question is listed on the TSX, Frankfort second tier, and the OTC markets 💀💀💀\n\nSo we're talking a broke ass exploration firm that isn't even listed on the Australian stock exchange, which is the usual hangout for these creep and bum juniors. \n\nBest case scenario, the company gets the permits and flips them to a mining company with actual capital to invest. That's the usual junior MO. \n\nI work in major project permitting and wouldn't even review the proposal if it came across my desk and uranium was $150/lb. I can guarantee that the permit review will miss major permits required, let alone bother with technical safety and feasibility reviews. If anyone has thought to put a waiver of liability on the permitting process, it will fall on the permit holder. \n\nMining is a huge business, but it also can have significant consequences when unchecked. I guess we're making Superfund sites great again?",
                "Great, that's what we need. Radioactive Mormons with super powers.",
                "Google moab uranium for just how bad an idea this is.",
                "Down with fluoride, up with uranium!",
                "As a result, the project's environmental review will be completed in just 14 days, the department said in a statement. Such studies typically take years because of the potential environmental effects of uranium mining.\n\nWell, that's not terrifying at all given the substance involved. I mean, I'm sure the mining industry has a proven track record of safety and environmental concerns being addressed. *Shaking head*",
                "Edward Abbey turning in his grave",
                "*vault-tech likes this*"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 357,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "One can guess how much he'll personally get out of this deal.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Not the US. Trump's friends and oligarchs.\n\nyoull get nothing from this.",
                "OR, anouther way to write the same thing, US allows oligarchy to buy 600 billion of US industries, fucking americans over yet anouther way.",
                "Forgot about 9/11 real quick when there's a buck to be made. Now they're selling the saudi's their best military tech. So much winning.",
                "The US gets screwed every time Trump makes a deal."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Episcopal Church refuses to resettle white Afrikaners, citing moral opposition",
            "external_url": "https://www.npr.org/2025/05/12/g-s1-65988/episcopal-church-white-afrikaners-ends-partnership-u-s-government",
            "upvotes": 11408,
            "date": "05/12/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F34%2F1b1627bb47cabd2e3be01911d780%2Fap25079502278892.jpg",
            "top_comments": [
                "Last week I'm agreeing with a Pope and this week I'm with an Episcopal church.  Weird couple of weeks as an atheist.",
                "It is refreshing to see some Christians actually following their faith.",
                "It's outrageous our tax dollars were spent to bring these people here.  What a waste of resources.",
                "Trump isn't hiding who and what he is.",
                "Do we call these people Afrikan Americans? Afrikaner Americans?",
                "neither are the Lutherans but that's just cuz they got all their resettlement funding yanked week 1",
                "Episcopalians do what Republicans can't.",
                "> Q: There are many people who fit the criteria of fleeing persecution. Afghans for example. But they're being denied refugee status. So why such an exception for the Afrikaners?\n\n> TRUMP ADMIN OFFICIAL: One of the criteria is making sure they can be assimilated easily into our country\n\nIt’s just racism. That’s it. \n\nSource: https://bsky.app/profile/atrupar.com/post/3loym4e3uts23",
                "The Episcopal Church is not a part of the evangelical wing of Christian denominations. They are on the progress side and emphasizes helping the needy and bringing people together to do good. I have a friend who's a priest in the church and as an atheist I respect her work very much.",
                "Bringing white south afrikaners here is just trump DEI policies benefiting people who historically benefited from racism, and largely still do.\nAnd don't the white people in South Africa still own the majority of the land in South Africa? Land they stole from the ancestors the people that the trump administration is trying to paint as viEurope.\n\n MAYBE the European South afrikaners should go back to europe."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "NSW police continued to justify festival strip-searches using drug dogs despite knowing 30% hit-rate, court hears",
            "external_url": "https://www.theguardian.com/australia-news/2025/may/13/nsw-police-music-festival-strip-search-class-action-drug-dog-justification-ntwnfb",
            "upvotes": 580,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f5b03845e24e3f093425d322abc6e2b4072225d7/318_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dfef822b87d5aa50d0773c6bb48cd107",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. These are completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began last week. \n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nIt's just crazy. You can turn up to a train station in Sydney and there’ll be a dozen officers standing around watching while a dog is sniffing commuters. Same deal at pubs. You can be having a beer and all of a sudden the police will burst in and block off all the exits so a dog can be brought round to sniff everyone. They used to do this every weekend picking clubs and pubs at random. \n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "How are Australians ok with something like this? People do tons of drugs at American music festivals and we seem to be doing fine.",
                "Being strip searched is a major violation. It's insane that you can just be an ordinary person doing nothing wrong and police can make you strip based on the an alert from a dog that they know is usually wrong. And for what? They're usually not even looking for major drug operations. Just people with drugs, probably mostly for their own personal use. I'm way more concerned about sex crimes than drug use, and in this case, the police are committing them. Or they would be, if the law didn't give them a special exception.",
                "I lived in Sydney 20 years ago and it was frightening how the police behaved. Sitting in a pub in the afternoon and having a gang of armed police in militaristic uniforms go from table to table with an alsatian sniffing everybody while the cops glare at you like they're trying their best to catch you out or bait you into challenging them so they can beat you down... it's grim, man. Proper police state behaviour. You quickly learn to hate seeing police in the streets, which is very different from my experience in the UK.",
                "Fuck Australia. Cops basically sexually assaulting folks who just want to party? ",
                "Put mousetrap in butthole.",
                "What happens if beyond complying by emptying your pockets and allowing them to check them; you refuse to remove your clothing? \n\nAnd related: \nWhat are the laws for filming police in public?",
                "If the people are going to put up with being strip searched like they're actual felons than unfortunately, it's going to keep continuing. This means both in the people you elect, and the actions you do. For many boycotting/protesting the venues that do this matters far less than seeing the big show done by a band they've made a huge part of their own self-identity.\n\nOf course this politics and involves the government, but if people stop showing up to the biggest venues in the city in protest to this, the venue owners will go to local politicians and push serious money to get it changed.\n\nEverything is politics, even music festivals, and your own attendance to them.",
                "They just want to see people naked…. Pervs",
                "Stop attending these events.  If the promoters lose money something will change."
            ],
            "aggregate_sentiment": 11.0
        },
        {
            "category": "NEW",
            "title": "UnitedHealth CEO suddenly steps down for 'personal reasons'",
            "external_url": "https://www.nbcnews.com/business/business-news/unitedhealth-group-appoints-new-ceo-suspends-annual-forecast-rcna206445",
            "upvotes": 990,
            "date": "05/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250513-andrew-witty-mb-1352-8cf015.jpg",
            "top_comments": [
                "He finally found out about the last guy",
                "Visited by 3 ghosts, perhaps?",
                "Did he get a visit from three spirits in the middle of the night?",
                "\"Personal reasons\" being his shareholders are suing the company for pro-consumer acts after the past CEO was killed.",
                "Thoughts and copayments…",
                "Constantly looking over your shoulder can be stressful.",
                "Oh did his contract finally expire? The crossroad demon finally came to claim what’s his?",
                "Yeah, he doesn’t want to be shot….",
                "Someone park a plumbing van outside his house for a few days?",
                "Is this the guy that was mad because he thought he was taken out of context by a journalist?\n\nLike the story was that he said patients didn't need to be cleaned. He did some big interview where he clarifies that he didn't say that and what he really said was it's okay for people to be dirty for a little bit and that it's okay if people in the hospital have their asses caked in shit for a little while, as if that was any better of a response."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 356,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "One can guess how much he'll personally get out of this deal.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Not the US. Trump's friends and oligarchs.\n\nyoull get nothing from this.",
                "OR, anouther way to write the same thing, US allows oligarchy to buy 600 billion of US industries, fucking americans over yet anouther way.",
                "Forgot about 9/11 real quick when there's a buck to be made. Now they're selling the saudi's their best military tech. So much winning.",
                "The US gets screwed every time Trump makes a deal."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "NEW",
            "title": "Inflation eased after Trump's 'Liberation Day' tariffs, defying fears",
            "external_url": "https://abcnews.go.com/Business/inflation-data-reveal-impacts-trumps-liberation-day-tariffs/story?id=121706453",
            "upvotes": 0,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bd55a8b0-dcda-45ea-8841-ee3540f97222/grocery-rt-er-250502_1746214585130_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "From the article \"However, many analysts anticipate a rekindling of inflation over the coming months as retailers begin to replenish inventory with goods imported after the tariffs took effect.\" I.e. it's still expected that the Trump Tariffs will still cause prices to soar for actual working Americans in the coming weeks and months.",
                ">Trump paused a large swath of so-called \"reciprocal tariffs\" within days of the announcement.\n\n\"Tariffs are about making America rich again and making America great again.\" -Donald J Trump\n\nIf they're going to make America rich and great why are they being paused?\n\n____\n>Still, egg prices stand much higher than they did a year ago.\n\n “You just watch: They’ll come down, and they’ll come down fast, not only with insurance, with everything.” - Donald J Trump\n\nWe're watching big guy.",
                "Finally some good news. I’ll take it even if I suspect it’s transitory."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Kim Kardashian testifies about her terror in Paris robbery trial",
            "external_url": "https://apnews.com/article/kim-kardashian-trial-paris-fashion-week-b06a96edfa5271de2d92870dcafe2796",
            "upvotes": 0,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine if i gave a fuck",
                "It’s wild how many people joked about this when it happened, now hearing her testify makes it clear how real and terrifying it was."
            ],
            "aggregate_sentiment": 65.0
        },
        {
            "category": "NEW",
            "title": "Microsoft is cutting 3% of all workers",
            "external_url": "https://www.cnbc.com/2025/05/13/microsoft-is-cutting-3percent-of-workers-across-the-software-company.html",
            "upvotes": 1655,
            "date": "05/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144510-17471116752024-04-30t031054z_160536770_rc2pg7auia21_rtrmadp_0_microsoft-indonesia.jpeg?v=1747111745&w=1920&h=1080",
            "top_comments": [
                "Next week: Facebook, Meta and Google are cutting 3% of all workers.",
                "“Microsoft had 228,000 employees worldwide at the end of June, meaning that the move will affect thousands of employees.”\n\nSheeeesh",
                "\"Not related to performance\" makes it that much worse.",
                "I really think developed economies will have to figure out how they will deal with AI inevitably displacing so many jobs. Of course, we are instead going to wait for the crisis to occur and then try to implement a half-assed solution.",
                "Don't dedicate yourself unless you have one of these two titles, OWNER or SHAREHOLDER. There is ZERO loyalty time to recognize.",
                "Its better than the 10% every year they used to do in the 2000-2012.",
                "I know multiple people working at nonprofits in Washington state that are getting laid off as many are trimming 80%+ of their staff or shutting down entirely. Some of these orgs have been successfully serving their community for decades but are dependent on funds from the state and/or corporations like Microsoft and both are drying up entirely. Thousands of folks are losing their jobs and the ripple effect on the community they spend money in and the people they serve is going to hit hard and won’t correct any time soon. This is the calm before the storm not the storm.",
                "Highly profitable company continues to do things to keep shareholders happy rather than focusing on the employees that make them highly profitable. News at 11.",
                "That'll be the bottom of the performance review bell curve then",
                "Increased their net profits by 12%, made a net profit of nearly 100 billion. This should be against the law for a corporation to cut hard working American jobs when they're earning billions. Shameful"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Former Philippine president Rodrigo Duterte wins mayoral election from jail cell at The Hague",
            "external_url": "https://www.abc.net.au/news/2025-05-13/rodrigo-duterte-wins-philippines-mayoral-election/105285210",
            "upvotes": 685,
            "date": "05/13/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/9ba55be4146681f1628414f45655e334?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
            "top_comments": [
                "Wait, I missed episodes there, I didn't even know he was at the Hague!",
                "WFH mayorship means Work From Hague",
                "Filipinos couldn't stand American stupidity being the only thing in the news",
                ">The former president's two sons were also set to win posts on Monday, one re-elected congressman and the other winning the contest for Davao vice-mayor and likely to serve in his father's absence.\n\nInteresting to see this. I wonder what's going to happen if he loses the case.",
                "So they elected a convicted felon, you say?",
                "He subsequently gave a passionate, rousing, and hair-raising victory speech to the seven cell bars, before being hushed into silence by the guards. He did, however, get three slices of apples as a congratulatory present, instead of the standard two.",
                "This seems fine, right?  WTF?",
                "how bad does your life have to be to vote for con men and criminals?",
                "The guy who said he'd go out and execute \"drug dealers\" himself on the streets",
                "The whole Marcos/Duterte thing in Philippines politics is wild.\n\nI highly recommend this episode of *If You're Listening* by Matt Bevan about it.\n\nhttps://youtu.be/pZ-9hfWk8TI"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Georgia college student remains in ICE custody after mistaken traffic stop",
            "external_url": "https://abcnews.go.com/US/georgia-college-student-remains-ice-custody-after-mistaken/story?id=121733067",
            "upvotes": 1893,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/145e291d-1815-44a8-887f-9b25c2025ec8/daltonstate_1747092879614_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I'd like to know how she ended up in ICE custody. She gets pulled over by mistake (charges have already been dismissed), and then what? Are the cops asking for the immigration status of everyone they pull over? Was she driving without a DL which triggers inquiry and then ICE arrives to detain her while they figure out if she's legal? Same with her father who got pulled over going 19mph over the limit. For most people, this is a ticket and then you go home. What is going on between them getting pulled over and detained so they end up with ICE? Because ICE can't pull people over.\n\nThere is no central registry of citizens. The only documents which prove your citizenship are your passport, naturalization certificate, or birth certificate, which most people don't carry with them at all times.. Which to me means that cops are looping in ICE on anyone they may suspect to be undocumented... and I don't see how that isn't effectively just racial profiling on Latinos in the United States.",
                "The article makes it sound like she actually is and always has been undocumented. I'm asking because I truly have no idea; how does an undocumented person obtain a driver's license and enroll in a university? ",
                "This is beyond scary at this point.",
                "Reading the article it says she’s been in the U.S. since she was 4yo but her parents say she couldn’t register under DACA since the program ended. I thought DACA is technically still in place? Or at least it shouldve been 10 years ago unless I’m reading this wrong",
                "[removed]",
                "19 mph over is a violent offender?",
                "We legals have nothing to worry about?  \n  Yeah, sure...",
                "If you ever wondered what you would do if you lived during the rise of the nazis, it's what you're doing right now.",
                "We now have Nazi checkpoints - “show me ze paperz be  vor we shoot!”",
                "The thing that makes me nervous is that if an undocumented immigrant knows that any encounter with law enforcement will result in their detention, they're not going to willingly agree to any encounters with law enforcement. \n\nThat means running, or dangerous high speed chases, or maybe even shootouts that endanger not only the immigrants life but bystanders and officers'  lives. It means undocumented immigrants will not report crimes they're victims of, leaving violent offenders to ravage communities. It means rampant domestic violence and human trafficking."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Peter Sullivan, who has spent 38 years in jail for murder, has conviction quashed",
            "external_url": "https://www.theguardian.com/law/2025/may/13/peter-sullivan-jail-murder-conviction-quashed-diane-sindall",
            "upvotes": 202,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/bc633f7c8ab2360f67b61f39026fd5a8f4cd0d37/52_6_739_591/master/739.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e250b78e04c6205368dd88aa3726c842",
            "top_comments": [
                "2 lives were lost that day. \n\nHopefully Peter can find joy in what time he has left.",
                "Finally Ivan Dobsky is free again",
                "PRI-SON\n\nNobody is in jail for 38 years"
            ],
            "aggregate_sentiment": 83.0
        },
        {
            "category": "NEW",
            "title": "US will fast-track Utah uranium mine permit",
            "external_url": "https://www.reuters.com/sustainability/us-will-fast-track-utah-uranium-mine-permit-2025-05-12/?utm_source=chatgpt.com",
            "upvotes": 758,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fast-track = skip all those pesky environmental and safety rules.",
                "They were sloppy with uranium mines in the middle of the 20th century and it ended up poisoning a lot of Navajo communities. This is a recipe for disaster.",
                "Fuel costs are a relatively small part of the budget for an operating nuclear power plant, let alone the overall costs to design/permit/build new capacity. All this is going to do is likely give that specific mine a competitive advantage, due to lax permitting requirements.\n\nEdit: That is, of course, ignoring the potential environmental issues from the lax permitting. Just from a pragmatic point of view, increasing the supply of uranium seems pretty unlikely to do anything for actual energy production.",
                "It's an existing mine that's been in care and maintenance since the early 1990s. The company in question is listed on the TSX, Frankfort second tier, and the OTC markets 💀💀💀\n\nSo we're talking a broke ass exploration firm that isn't even listed on the Australian stock exchange, which is the usual hangout for these creep and bum juniors. \n\nBest case scenario, the company gets the permits and flips them to a mining company with actual capital to invest. That's the usual junior MO. \n\nI work in major project permitting and wouldn't even review the proposal if it came across my desk and uranium was $150/lb. I can guarantee that the permit review will miss major permits required, let alone bother with technical safety and feasibility reviews. If anyone has thought to put a waiver of liability on the permitting process, it will fall on the permit holder. \n\nMining is a huge business, but it also can have significant consequences when unchecked. I guess we're making Superfund sites great again?",
                "Great, that's what we need. Radioactive Mormons with super powers.",
                "Google moab uranium for just how bad an idea this is.",
                "Down with fluoride, up with uranium!",
                "As a result, the project's environmental review will be completed in just 14 days, the department said in a statement. Such studies typically take years because of the potential environmental effects of uranium mining.\n\nWell, that's not terrifying at all given the substance involved. I mean, I'm sure the mining industry has a proven track record of safety and environmental concerns being addressed. *Shaking head*",
                "Edward Abbey turning in his grave",
                "*vault-tech likes this*"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 5531,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "In simple terms, my rates are going up, big time",
                "\"CEO Andrew Witty steps down\"\n\n'Hey guys, make sure EVERYONE knows I'm not CEO of UnitedHealth anymore. Issue press releases, take out ads, maybe put up a banner with the new guys face on it....'",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "This was moments after the board voted against metal detectors outside annual forecast meetings",
                "> surging medical costs send its shares plunging more than 11%\n\nWhich is a perfect example of why medical care should not be a for-profit enterprise.",
                "Who could have guessed assassinating one CEO could have collapsed a company so badly.  There stock price is down like 40% just in the past 6 months, and they’ve lost a second ceo now too."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "UnitedHealth CEO suddenly steps down for 'personal reasons'",
            "external_url": "https://www.nbcnews.com/business/business-news/unitedhealth-group-appoints-new-ceo-suspends-annual-forecast-rcna206445",
            "upvotes": 991,
            "date": "05/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250513-andrew-witty-mb-1352-8cf015.jpg",
            "top_comments": [
                "He finally found out about the last guy",
                "Visited by 3 ghosts, perhaps?",
                "Did he get a visit from three spirits in the middle of the night?",
                "\"Personal reasons\" being his shareholders are suing the company for pro-consumer acts after the past CEO was killed.",
                "Thoughts and copayments…",
                "Constantly looking over your shoulder can be stressful.",
                "Oh did his contract finally expire? The crossroad demon finally came to claim what’s his?",
                "Yeah, he doesn’t want to be shot….",
                "Someone park a plumbing van outside his house for a few days?",
                "Is this the guy that was mad because he thought he was taken out of context by a journalist?\n\nLike the story was that he said patients didn't need to be cleaned. He did some big interview where he clarifies that he didn't say that and what he really said was it's okay for people to be dirty for a little bit and that it's okay if people in the hospital have their asses caked in shit for a little while, as if that was any better of a response."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Georgia college student remains in ICE custody after mistaken traffic stop",
            "external_url": "https://abcnews.go.com/US/georgia-college-student-remains-ice-custody-after-mistaken/story?id=121733067",
            "upvotes": 1888,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/145e291d-1815-44a8-887f-9b25c2025ec8/daltonstate_1747092879614_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I'd like to know how she ended up in ICE custody. She gets pulled over by mistake (charges have already been dismissed), and then what? Are the cops asking for the immigration status of everyone they pull over? Was she driving without a DL which triggers inquiry and then ICE arrives to detain her while they figure out if she's legal? Same with her father who got pulled over going 19mph over the limit. For most people, this is a ticket and then you go home. What is going on between them getting pulled over and detained so they end up with ICE? Because ICE can't pull people over.\n\nThere is no central registry of citizens. The only documents which prove your citizenship are your passport, naturalization certificate, or birth certificate, which most people don't carry with them at all times.. Which to me means that cops are looping in ICE on anyone they may suspect to be undocumented... and I don't see how that isn't effectively just racial profiling on Latinos in the United States.",
                "The article makes it sound like she actually is and always has been undocumented. I'm asking because I truly have no idea; how does an undocumented person obtain a driver's license and enroll in a university? ",
                "This is beyond scary at this point.",
                "Reading the article it says she’s been in the U.S. since she was 4yo but her parents say she couldn’t register under DACA since the program ended. I thought DACA is technically still in place? Or at least it shouldve been 10 years ago unless I’m reading this wrong",
                "[removed]",
                "19 mph over is a violent offender?",
                "We legals have nothing to worry about?  \n  Yeah, sure...",
                "If you ever wondered what you would do if you lived during the rise of the nazis, it's what you're doing right now.",
                "We now have Nazi checkpoints - “show me ze paperz be  vor we shoot!”",
                "The thing that makes me nervous is that if an undocumented immigrant knows that any encounter with law enforcement will result in their detention, they're not going to willingly agree to any encounters with law enforcement. \n\nThat means running, or dangerous high speed chases, or maybe even shootouts that endanger not only the immigrants life but bystanders and officers'  lives. It means undocumented immigrants will not report crimes they're victims of, leaving violent offenders to ravage communities. It means rampant domestic violence and human trafficking."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "Former Philippine president Rodrigo Duterte wins mayoral election from jail cell at The Hague",
            "external_url": "https://www.abc.net.au/news/2025-05-13/rodrigo-duterte-wins-philippines-mayoral-election/105285210",
            "upvotes": 686,
            "date": "05/13/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/9ba55be4146681f1628414f45655e334?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
            "top_comments": [
                "Wait, I missed episodes there, I didn't even know he was at the Hague!",
                "WFH mayorship means Work From Hague",
                "Filipinos couldn't stand American stupidity being the only thing in the news",
                ">The former president's two sons were also set to win posts on Monday, one re-elected congressman and the other winning the contest for Davao vice-mayor and likely to serve in his father's absence.\n\nInteresting to see this. I wonder what's going to happen if he loses the case.",
                "So they elected a convicted felon, you say?",
                "He subsequently gave a passionate, rousing, and hair-raising victory speech to the seven cell bars, before being hushed into silence by the guards. He did, however, get three slices of apples as a congratulatory present, instead of the standard two.",
                "This seems fine, right?  WTF?",
                "how bad does your life have to be to vote for con men and criminals?",
                "The guy who said he'd go out and execute \"drug dealers\" himself on the streets",
                "The whole Marcos/Duterte thing in Philippines politics is wild.\n\nI highly recommend this episode of *If You're Listening* by Matt Bevan about it.\n\nhttps://youtu.be/pZ-9hfWk8TI"
            ],
            "aggregate_sentiment": 63.0
        },
        {
            "category": "RISING",
            "title": "Microsoft is cutting 3% of all workers",
            "external_url": "https://www.cnbc.com/2025/05/13/microsoft-is-cutting-3percent-of-workers-across-the-software-company.html",
            "upvotes": 1650,
            "date": "05/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144510-17471116752024-04-30t031054z_160536770_rc2pg7auia21_rtrmadp_0_microsoft-indonesia.jpeg?v=1747111745&w=1920&h=1080",
            "top_comments": [
                "Next week: Facebook, Meta and Google are cutting 3% of all workers.",
                "“Microsoft had 228,000 employees worldwide at the end of June, meaning that the move will affect thousands of employees.”\n\nSheeeesh",
                "\"Not related to performance\" makes it that much worse.",
                "I really think developed economies will have to figure out how they will deal with AI inevitably displacing so many jobs. Of course, we are instead going to wait for the crisis to occur and then try to implement a half-assed solution.",
                "Don't dedicate yourself unless you have one of these two titles, OWNER or SHAREHOLDER. There is ZERO loyalty time to recognize.",
                "Its better than the 10% every year they used to do in the 2000-2012.",
                "I know multiple people working at nonprofits in Washington state that are getting laid off as many are trimming 80%+ of their staff or shutting down entirely. Some of these orgs have been successfully serving their community for decades but are dependent on funds from the state and/or corporations like Microsoft and both are drying up entirely. Thousands of folks are losing their jobs and the ripple effect on the community they spend money in and the people they serve is going to hit hard and won’t correct any time soon. This is the calm before the storm not the storm.",
                "Highly profitable company continues to do things to keep shareholders happy rather than focusing on the employees that make them highly profitable. News at 11.",
                "That'll be the bottom of the performance review bell curve then",
                "Increased their net profits by 12%, made a net profit of nearly 100 billion. This should be against the law for a corporation to cut hard working American jobs when they're earning billions. Shameful"
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "RISING",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 354,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "One can guess how much he'll personally get out of this deal.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Not the US. Trump's friends and oligarchs.\n\nyoull get nothing from this.",
                "OR, anouther way to write the same thing, US allows oligarchy to buy 600 billion of US industries, fucking americans over yet anouther way.",
                "Forgot about 9/11 real quick when there's a buck to be made. Now they're selling the saudi's their best military tech. So much winning.",
                "The US gets screwed every time Trump makes a deal."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 5526,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "In simple terms, my rates are going up, big time",
                "\"CEO Andrew Witty steps down\"\n\n'Hey guys, make sure EVERYONE knows I'm not CEO of UnitedHealth anymore. Issue press releases, take out ads, maybe put up a banner with the new guys face on it....'",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "This was moments after the board voted against metal detectors outside annual forecast meetings",
                "> surging medical costs send its shares plunging more than 11%\n\nWhich is a perfect example of why medical care should not be a for-profit enterprise.",
                "Who could have guessed assassinating one CEO could have collapsed a company so badly.  There stock price is down like 40% just in the past 6 months, and they’ve lost a second ceo now too."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Peter Sullivan, who has spent 38 years in jail for murder, has conviction quashed",
            "external_url": "https://www.theguardian.com/law/2025/may/13/peter-sullivan-jail-murder-conviction-quashed-diane-sindall",
            "upvotes": 204,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/bc633f7c8ab2360f67b61f39026fd5a8f4cd0d37/52_6_739_591/master/739.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e250b78e04c6205368dd88aa3726c842",
            "top_comments": [
                "2 lives were lost that day. \n\nHopefully Peter can find joy in what time he has left.",
                "Finally Ivan Dobsky is free again",
                "PRI-SON\n\nNobody is in jail for 38 years"
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "RISING",
            "title": "US will fast-track Utah uranium mine permit",
            "external_url": "https://www.reuters.com/sustainability/us-will-fast-track-utah-uranium-mine-permit-2025-05-12/?utm_source=chatgpt.com",
            "upvotes": 758,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fast-track = skip all those pesky environmental and safety rules.",
                "They were sloppy with uranium mines in the middle of the 20th century and it ended up poisoning a lot of Navajo communities. This is a recipe for disaster.",
                "Fuel costs are a relatively small part of the budget for an operating nuclear power plant, let alone the overall costs to design/permit/build new capacity. All this is going to do is likely give that specific mine a competitive advantage, due to lax permitting requirements.\n\nEdit: That is, of course, ignoring the potential environmental issues from the lax permitting. Just from a pragmatic point of view, increasing the supply of uranium seems pretty unlikely to do anything for actual energy production.",
                "It's an existing mine that's been in care and maintenance since the early 1990s. The company in question is listed on the TSX, Frankfort second tier, and the OTC markets 💀💀💀\n\nSo we're talking a broke ass exploration firm that isn't even listed on the Australian stock exchange, which is the usual hangout for these creep and bum juniors. \n\nBest case scenario, the company gets the permits and flips them to a mining company with actual capital to invest. That's the usual junior MO. \n\nI work in major project permitting and wouldn't even review the proposal if it came across my desk and uranium was $150/lb. I can guarantee that the permit review will miss major permits required, let alone bother with technical safety and feasibility reviews. If anyone has thought to put a waiver of liability on the permitting process, it will fall on the permit holder. \n\nMining is a huge business, but it also can have significant consequences when unchecked. I guess we're making Superfund sites great again?",
                "Great, that's what we need. Radioactive Mormons with super powers.",
                "Google moab uranium for just how bad an idea this is.",
                "Down with fluoride, up with uranium!",
                "As a result, the project's environmental review will be completed in just 14 days, the department said in a statement. Such studies typically take years because of the potential environmental effects of uranium mining.\n\nWell, that's not terrifying at all given the substance involved. I mean, I'm sure the mining industry has a proven track record of safety and environmental concerns being addressed. *Shaking head*",
                "Edward Abbey turning in his grave",
                "*vault-tech likes this*"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
            "external_url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
            "upvotes": 4189,
            "date": "05/13/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
            "top_comments": [
                "This man is such a disgusting, vile pig.",
                "Reminder: multiple French celebrities said he shouldn't face trial because he made some great films.\n\n[https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/](https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/)\n\nMacron himself said this only last December:\n\n>\"I’ll say it as France’s president but also as a citizen, he makes France proud.\"",
                "Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions.\n\n\"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu.\n\n\"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law.\n\n\"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\"\n\nDepardieu's reputation is now in tatters, and there may be more allegations to come.\n\nDiebolt told Sky News that around 20 other women have said that they were attacked by the actor.\n\nAnd we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould.\n\nMs Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris",
                "Noooo...he just looks and sounds like the person you'd most expect. \n\nPlus he did some real weird shit with his daughter on vacation once. Pretended to be her lover. What a creep.",
                "I saw an interview with him years ago where he admitted--well, bragged is actually a more appropriate word--that him and his buddy would go out looking for women to rape when they were teenagers. He laughed about it.",
                "That sentence is a disgrace",
                "Isnt he a roomate with Steven \"The Whale\" Seagal in Russia?",
                "It’s always the people you most expect.",
                "What a giant fucking turd.",
                "Never liked this dude. Always had a creepy vibe."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "RISING",
            "title": "NSW police continued to justify festival strip-searches using drug dogs despite knowing 30% hit-rate, court hears",
            "external_url": "https://www.theguardian.com/australia-news/2025/may/13/nsw-police-music-festival-strip-search-class-action-drug-dog-justification-ntwnfb",
            "upvotes": 585,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f5b03845e24e3f093425d322abc6e2b4072225d7/318_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dfef822b87d5aa50d0773c6bb48cd107",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. These are completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began last week. \n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nIt's just crazy. You can turn up to a train station in Sydney and there’ll be a dozen officers standing around watching while a dog is sniffing commuters. Same deal at pubs. You can be having a beer and all of a sudden the police will burst in and block off all the exits so a dog can be brought round to sniff everyone. They used to do this every weekend picking clubs and pubs at random. \n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "How are Australians ok with something like this? People do tons of drugs at American music festivals and we seem to be doing fine.",
                "Being strip searched is a major violation. It's insane that you can just be an ordinary person doing nothing wrong and police can make you strip based on the an alert from a dog that they know is usually wrong. And for what? They're usually not even looking for major drug operations. Just people with drugs, probably mostly for their own personal use. I'm way more concerned about sex crimes than drug use, and in this case, the police are committing them. Or they would be, if the law didn't give them a special exception.",
                "I lived in Sydney 20 years ago and it was frightening how the police behaved. Sitting in a pub in the afternoon and having a gang of armed police in militaristic uniforms go from table to table with an alsatian sniffing everybody while the cops glare at you like they're trying their best to catch you out or bait you into challenging them so they can beat you down... it's grim, man. Proper police state behaviour. You quickly learn to hate seeing police in the streets, which is very different from my experience in the UK.",
                "Fuck Australia. Cops basically sexually assaulting folks who just want to party? ",
                "Put mousetrap in butthole.",
                "What happens if beyond complying by emptying your pockets and allowing them to check them; you refuse to remove your clothing? \n\nAnd related: \nWhat are the laws for filming police in public?",
                "If the people are going to put up with being strip searched like they're actual felons than unfortunately, it's going to keep continuing. This means both in the people you elect, and the actions you do. For many boycotting/protesting the venues that do this matters far less than seeing the big show done by a band they've made a huge part of their own self-identity.\n\nOf course this politics and involves the government, but if people stop showing up to the biggest venues in the city in protest to this, the venue owners will go to local politicians and push serious money to get it changed.\n\nEverything is politics, even music festivals, and your own attendance to them.",
                "They just want to see people naked…. Pervs",
                "Stop attending these events.  If the promoters lose money something will change."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "05/13/2025 16:11:17 UTC"
}