{
    "posts": [
        {
            "category": "HOT",
            "title": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43",
            "external_url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/",
            "upvotes": 14685,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/03/GettyImages-1827676825.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "She had been investigating [Russian billionaires' money laundering](https://databreaches.net/2024/09/26/two-russian-nationals-charged-in-connection-with-operating-billion-dollar-money-laundering-services/) and [Russian war crimes against a US national living in Ukraine](https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/?_osource=SocialFlowTwt_DCBrand)",
                "Ugh this is horrible ..may she rest in peace",
                "I hope this isn't our version of \"falling out a window\"",
                "Initially suspicious.\n\nHopefully subsequent news dispels it.",
                "Rest in peace. That is a very young age to go.",
                "That's just entirely too young for this day and age.",
                "Hopefully we don’t look back at this as the “first” of anything…",
                "Im not making any definitive statements on this but im already seeing the radicalized maga psychopaths saying she had it coming & its Joe Biden's fault on \"twitter\" so.. \n\nI think redemption or a legitimate awakening to reality is off the table - They're so far gone they are actively supporting death of their perceived enemies. ",
                "She's notable for work investigating Russian War Crimes. And also putting away *a lot of people* who abused children, more specifically a lot of child abusers with ties to law enforcement. She resigned her position a few months ago, after Trump's election and subsequent interference in her work. \n\n\nNot to suggest this has to have been foul play, before we have any information to support that. But its definitely something to keep an eye on. ",
                "Poor family of hers man…."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "FBI Employees Reviewing Jeffrey Epstein Files Told to Limit Redactions",
            "external_url": "https://www.wsj.com/us-news/law/doj-jeffrey-epstein-documents-7da298dc",
            "upvotes": 16819,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only redact the victims, do not redact the perpetrators.",
                "The only thing redacted should be the names of the victims. Fuck all the pedos, enablers, and other scum that were associated with Epstein and Maxwell. And yes that means the Clinton’s as well as Trump and all his buddies.",
                "\"Just make sure they get the ones involving person of interest number 1.\"",
                "why is revealing the list be “national security concerning” it’s not like it’s nuclear bomb manuals?",
                "Limit them to what, those inside the current admin?",
                "I think there's gonna be a huge meltdown on the internet when the ultimate conclusion in the files is \"we have no reason, beyond nebulous allegations of motive, to think any third party was involved in his death.\" No one online is gonna buy that, regardless of if it was written by an earnest investigator or not.\n\nBasically, I think everyone is about to feel a serious case of angry blue balls.",
                "Yup.  Just need to limit all redactions to removing all references to the word \"Trump.\"  Easy peasy!",
                "They want to get the Clintons, but not the Republican donors.",
                "I’m sure they’re going to limit the redactions to Republicans only. Any Democrats or Left leaning individuals will be implicated, without a single Right wing donor or politician on the list. Really sell that narrative that the Left is a bastion of scum and villainy. \n\nWe’ve got enough consciousness to actually prosecute our own when they do horrible things. Which unfortunately plays into that narrative even further.",
                "This isn’t redacted.\n\nFrom copilot:\n\nKatie Johnson filed a lawsuit against Donald Trump, alleging that he raped her when she was 13 years old. The case was dismissed almost a decade ago. The lawsuit claimed that the assaults happened at parties hosted by Jeffrey Epstein. You can find more details here.\n\nKatie Johnson’s deposition was part of her lawsuit against Donald Trump, which was filed in federal court in Riverside, California, in April 2016. The lawsuit named Trump and Jeffrey Epstein as defendants and claimed that they held Johnson as a “sex slave” and assaulted her when she was 13 years old. However, the case was dismissed shortly after it was filed. You can find more details here.\n\nKatie Johnson’s lawsuit against Donald Trump was dismissed because the judge ruled that the complaint didn’t raise valid claims under federal law. Additionally, there were legal hurdles, such as the statute of limitations on many of the claims, including sexual misconduct, assault, and battery. The case was dismissed in May 2016, and subsequent versions of the lawsuit were also withdrawn or dismissed.\n\nKatie Johnson’s lawsuit against Donald Trump was withdrawn because she reportedly received threats and was too afraid to continue with the case. Her attorney, Lisa Bloom, mentioned that Johnson was too frightened to appear at a scheduled news conference. The case was ultimately dropped without further explanation.\n\nThe following is a portion of her deposition. It is graphic and troubling.\n\nhttps://www.courtlistener.com/docket/4154484/katie-johnson-v-donald-j-trump/\n\n9. On the first occasion involving the Defendant, Donald J. Trump, the Plaintiff, Katie Johnson, was forced to manually stimulate Defendant Trump with the use of her hand upon Defendant Trump’s erect penis until he reached sexual orgasm.\n\n10. On the second occasion involving the Defendant, Donald J. Trump, the Plaintiff, Katie Johnson, was forced to orally copulate Defendant Trump by placing her mouth upon Defendant Trump’s erect penis until he reached sexual orgasm.\n\n11. On the third occasion involving the Defendant, Donald J. Trump, the Plaintiff, Katie Johnson was forced to engage in an unnatural lesbian sex act with her fellow minor and sex slave, Maria Doe age 12, for the sexual enjoyment of Defendant Trump. After this sex act, both minors were forced to orally copulate Defendant Trump by placing their mouths simultaneously on his erect penis until he achieved sexual orgasm. After zipping up his pants, Defendant Trump physically pushed both minors away while angrily berating them for the “poor” quality of their sexual performance.\n\n12. On the fourth and final sexual encounter with the Defendant, Donald J. Trump, the Plaintiff, Katie Johnson, was tied to a bed by Defendant Trump who then proceeded to forcibly rape Plaintiff Johnson. During the course of this savage sexual attack, Plaintiff Johnson loudly pleaded with Defendant Trump to “please wear a condom”. Defendant Trump responded by violently striking Plaintiff Johnson in the face with his open hand and screaming that “he would do whatever he wanted” as he refused to wear protection. After achieving sexual orgasm, the Defendant, Donald J. Trump put his suit back on and when the Plaintiff, Katie Johnson, in tears asked Defendant Trump what would happen if he had impregnated her, Defendant Trump grabbed his wallet and threw some money at her and screamed that she should use the money “to get a fucking abortion”.\n\n13. On the first occasion involving the Defendant, Jeffrey E. Epstein, the Plaintiff, Katie Johnson, was forced to disrobe into her bra and panties and to give a full body massage to Defendant Epstein while he was completely naked. During the massage, Defendant Epstein physically forced Plaintiff Johnson to touch his erect penis with her bare hands and to clean up his ejaculated semen after he achieved sexual orgasm.\n\n14. On the second occasion involving the Defendant, Jeffrey Epstein, the Plaintiff, Katie Johnson was again forced to disrobe into her bra and panties while giving Defendant Epstein a full body massage while he was completely naked. The Defendant, Donald J. Trump, was also present as he was getting his own massage from another minor, Jane Doe, age 13, Defendant Epstein forced Plaintiff Johnson to touch his erect penis by physically placing her bare hands upon his sex organ and again forced Plaintiff Johnson to clean up his ejaculated semen after he achieved sexual orgasm.\n\n15. Shortly after this sexual assault by the Defendant, Jeffrey E. Epstein, on the Plaintiff, Katie Johnson, Plaintiff Johnson was still present while the two Defendants were arguing over who would be the one to take Plaintiff Johnson’s virginity. The Defendant, Donald J. Trump, was clearly heard referring to Defendant, Jeffrey E. Epstein, as a “Jew Bastard” as he yelled at Defendant Epstein, that clearly, he, Defendant Trump, should be the lucky one to “pop the cherry” of Plaintiff Johnson.\n\n16. The third and final sexual assault by the Defendant, Jeffrey E. Epstein, on the Plaintiff, Katie Johnson, took place after Plaintiff Johnson had been brutally and savagely raped by Defendant Trump. While receiving another full body massage from Plaintiff Johnson, while in the nude, Defendant Epstein became so enraged after finding out that Defendant Trump had been the one to take Plaintiff Johnson’s virginity, that Defendant Epstein also violently raped Plaintiff Johnson. After forcing Plaintiff Johnson to disrobe into her bra and panties, while receiving a massage from the Plaintiff, Defendant Epstein attempted to enter Plaintiff Johnson’s anal cavity with his erect penis while trying to restrain her. Plaintiff Johnson attempted to push Defendant Epstein away, at which time Defendant Epstein attempted to enter Plaintiff Johnson’s vagina with his erect penis. This attempt to brutally sodomize and rape Plaintiff Johnson by Defendant Epstein was finally repelled by Plaintiff Johnson but not before Defendant Epstein was able to achieve sexual orgasm. After perversely sodomizing and raping the Plaintiff, Katie Johnson, the Defendant, Jeffrey E. Epstein, attempted to strike her about the head with his closed fists while he angrily screamed at Plaintiff Johnson that he, Defendant Epstein, should have been the one who “took her cherry, not Mr. Trump”, before she finally managed to break away from Defendant Epstein.\n\n17. The Plaintiff, Katie Johnson, was fully warned on more than one occasion by both Defendants, Donald J. Trump and Jeffrey E. Epstein, that were she ever to reveal any of the details of the sexual and physical abuse that she had suffered as a sex slave for Defendant Trump and Defendant Epstein, that Plaintiff Johnson and her family would be in mortal danger. Plaintiff Johnson was warned that this would mean certain death for herself and Plaintiff Johnson’s family unless she remained silent forever on the exact details of the depraved and perverted sexual and physical abuse she had been forced to endure from the Defendants.\n\nTiffany Doe Declaration | Télécharger gratuitement PDF | Rape | Violence (scribd.com)"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "United pilot attacked passenger for taking too long in the bathroom, lawsuit alleges | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/22/united-pilot-attacks-passenger",
            "upvotes": 1985,
            "date": "03/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/587e60049d651d0fa4221718e074d34b7f9b7281/0_0_5149_3090/master/5149.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2698b5b29e80cb05b580a1aaf52f760e",
            "top_comments": [
                ">\tLiebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are homeland. You have no rights here.”\n\nWhat is this 1984 shit?",
                "Every time I take a united flight, I joke about brushing up on street fighting skills, because we all know “fLight club” is real at united.",
                "The pilots would’ve used the lav nearer the flight deck, not the one in the back",
                "I’m shocked SHOCKED that an airline famous for [breaking guitars](https://youtu.be/5YGc4zOqozo) and [dragging a doctor off a plane](https://youtu.be/VrDWY6C1178) would do something so callous. ",
                "That sucks but there’s a small part of me that wants to do this whenever someone is in there taking way too long because they’re just scrolling…\n\nLike please bro, I accidentally had some milk and now my ass is gonna explode.",
                "The pilot did not break the lock. The bathroom door on an airplane can be unlocked very easily from the outside.",
                "Ok but 30 minutes? Cmon.",
                "Had enough of their shit fr",
                "This headline and story seem doubtful",
                "Yeahhh, I think people need to wait and see where this leads. The article is strictly from the plaintiffs perspective because the airline won't comment.\n\nI have a hard time believing a pilot would break a door down to pull a man out who was just using the restroom. There had to be something else going on. \n\nLike was the guy being belligerent? Was he actually suffering from an issue or was he doing something else in the bathroom? Obviously he's not going to say \"yeah I wasn't really going to the bathroom, I was hanging out for 30+ minutes and being a dickhead to the staff.\" Also the plaintiff doesn't specify when it happened, perhaps the plane was close to landing? As everyone knows you can't be in the bathroom during that. Maybe the pilot/flight attendants were concerned he was lying because he was in there for 30+ minutes.\n\nA pilot isn't going to risk their license/job by attacking a passenger and doing damage to the plane. Something had to be going on."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "The Pentagon's DEI purge: Officials describe a scramble to remove and then restore online content",
            "external_url": "https://apnews.com/article/pentagon-dei-diversity-social-media-purge-fb15996733408a8122a97acd3baa6820",
            "upvotes": 3955,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*While the pages of some well-known veterans... are now back up on Pentagon websites, officials warn that many posts tagged for removal in error may be gone forever.*\n\nSounds familiar:  they're great at razing but not at raising.",
                "A great use of our tax dollars for sure! /s",
                "What are the odds they will quietly remove them again in a few months, hoping people will be distracted by another thing?",
                "These revisionists deemed the Enola Gay, the Tuskegee airmen, and Major General Charles Rogers's Medal of Honor DEI. They are trying to scrub the history of the military and they call themselves patriots and America First. People really should have paid attention to Project 2025 since now, we have to wait until 2026 to change the Congress.",
                "They also took down the web pages concerning the most decorated military unit in US history, the 442nd Regimental Combat Team. An outcry from veterans restored it.",
                "Racist, homophobic assholes.",
                "Why would people that want to overthrow our democracy spend this much time and effort pissing off the military FOR NO TANGIBLE BENEFIT?\n\nWell I suppose if these people were smart they wouldn’t be racist..",
                "Can’t have anyone thinking women, gays, or the blacks materially participated in our military. /s",
                "It's almost like big balls wrote an algorithm that checks everything against a keyword list of things that this admin wants to erase from history.",
                "Glad to see my tax dollars spent well....."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Trump rescinds security clearances of political rivals Harris, Clinton and others | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/21/politics/security-clearances-trump-harris-clinton/index.html",
            "upvotes": 10175,
            "date": "03/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/20250321-harrisclintonsplit.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> He directed Attorney General Pam Bondi to review the conduct of lawyers and law firms the administration considers to have filed frivolous lawsuits against the Trump administration or attempted to block immigration initiatives, broadening the president’s crackdown on the US legal community in the United States. \n\nThis is a whole article in its own right, tacked on the end there. \n\n[Trump ordered the attorney general to report 'frivolous' lawsuits against his administration so he can consider executive actions against firms. Read the memo.](https://www.businessinsider.com/donald-trump-attorney-general-memo-identify-target-law-firms-2025-3)",
                "If Trump had to go through the actual security clearance process, he would not even be able to get a Secret.",
                "The irony^* of a (then) former president storing classified information in a private bathroom, then becoming president and revoking clearances of other former officials is spectacularly bizarre. \n\n\n^* hypocrisy",
                "Found the weaponizing of the Justice Department that Trump has long complained about...",
                "He thinks the DOJ is his personal law firm and Bondi seems to agree with him",
                "This is so dumb because when high level officials leave, they usually retain their security clearances *so current officials can ask them questions on new info.*\n\n\nIt's not like Clinton is getting a daily intelligence brief.",
                "Like, imagine if Obama did this to Bush Jr? Ohh wait, you can't because it's only something a petty immature asshole would do, right, and a US president would have enough self dignity to not act like a child, so you would think. \n\nI'm sure they can attempt to sue to get it back since the clearances weren't revoked for anything meaningful, it seems, but I'm not sure how that would work or if there is any legal recourse available.",
                "Some of them did not even have security clearance anymore. This was mostly performative.\n\nKinzinger made a post to his substack about it.",
                "Our president, ladies & germs - the sniveling cowardly punk ass bitch",
                "Now the president has the power to determine the legitimacy of lawsuits.\n\nNo authoritarian conduct here.  No Imperial Presidency to see folks. Move along or you'll be in prison in El salvador."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "SeaWorld faces OSHA fine after trainer injured by killer whale at Orlando park",
            "external_url": "https://www.denver7.com/us-news/seaworld-fined-by-osha-after-trainer-injured-by-killer-whale-at-orlando-park",
            "upvotes": 804,
            "date": "03/23/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/ce7e022/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F67%2F6e%2Ff7f7b91b419b86959524b76f539b%2Fshutterstock-1624670470.jpg",
            "top_comments": [
                "OSHA will be dismantled next week",
                "Whales should be in the open ocean where they belong ….when will humans realize this …",
                ">The department proposed a fine of $16,550.\n\nThese proposed fines can be negotiated down. Then they can be ignored for a while, only to have the company pay a fraction of the negotiated fine. All while admitting no wrong doing.",
                "Why did I think there were no more Orcas at Sea World?",
                "I propose that we once again learn nothing from this.",
                "The article doesn’t mean how this happened but I thought after all the previous deaths and injuries people weren’t even allowed to be in the water with them anymore",
                "well duh, they ain't called friendly whales",
                "Why hasn’t this place been shut down yet?",
                "It is an apex predator, what could go wrong?",
                "Apparently Blackfish taught them nothing"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "2 more cases of measles confirmed in Maryland",
            "external_url": "https://wtop.com/health-fitness/2025/03/2-more-cases-of-measles-confirmed-in-maryland/",
            "upvotes": 1413,
            "date": "03/22/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2024/04/Technology_Passport_Control_91675-scaled.jpg",
            "top_comments": [
                "Between this, H5N1, and a looming economic downturn, we're in for a hell of a time.",
                "If only we had a proven medical way to prevent measles from spreading.",
                "Needles with vaccine?  Bad.  \nNeedles with heroin? Good!\n\n-RFK Jr. ",
                "\"we've done nothing and we're out of ideas\" - the current administration in power",
                "Jeez the possible exposure areas/times feels like an itinerary list.",
                "Just take a multivitamin and you’ll be fine! /s",
                "This administration of effete billionaires, who've never crossed paths with a hard day's work, don't think we really need vaccines. Or CDC research. Or affordable health care, or educations, or affordable groceries, or our foreign allies, or the social security benefits that we payed into for years. What we need - above all - is for *them* to pay less taxes. \n\nThen they hop on a jet to go play golf on one of their many private, guarded properties - again at our expense, of course. I mean, you'd have to just despise your fellow Americans to cheer these inept, pampered, bad-actors on.",
                "Sacrificing their children on the altar to their orange god-king.",
                "Oh dear. Wow.\n\nI hope they can figure out a way to prevent all of this.",
                "Our enemies are laughing there asses off \n\nHow do you defeat a more advanced enemy? \n\nFROM WITHIN"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Nova Scotia legislators vote unanimously to scrap electric car rebates for Tesla",
            "external_url": "https://www.thecanadianpressnews.ca/politics/nova-scotia-legislators-vote-unanimously-to-scrap-electric-car-rebates-for-tesla/article_644f9fd5-46b5-5b39-9032-772de4b37f7c.html",
            "upvotes": 1828,
            "date": "03/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/d/bd/dbdbe4b2-efe8-50e1-9af3-4f193ff5b396/67ded0c011d58.image.jpg?crop=1400%2C735%2C0%2C99&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Good.  \n\nDrive TSLA stock into the ground.  Have it go from the highest market cap company to bankrupt in less than 4 years.",
                "🇨🇦 Elbows up my Canadian friends! 🇨🇦",
                "Sigh.   I get the protest completely..  but we shouldn't be discouraging electic vehicles.  Sure promote other ones.  But don't harm those making the investment to the betterment of our futures.",
                "> \"There are other options for us here in Canada for electric vehicles,\" she said.\n\nAh yes, all the other good options such as... that Porsche EV that costs $200k? A bolt (who wants to drive a GM vehicle)? Um. That garbage BMW that gets like 60mi of range? \n\n---\n\n> trade war\n\nThis is funny because apparently the different providences in Canada put tariffs on each other. Wonder if they'll ban each other for engaging in a trade war."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "HOT",
            "title": "3 killed, 14 injured in mass shooting at New Mexico park",
            "external_url": "https://www.nbcnews.com/news/us-news/3-killed-14-injured-new-mexico-mass-shooting-rcna197615",
            "upvotes": 2837,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250322-las-cruces-ch-1139-b42971.jpg",
            "top_comments": [
                "200 miles from Albuquerque? Thats like attributing Cooperstown to NYC",
                "From the article:\n\n“The Las Cruces Police Department said the shooting happened at around 10 p.m. at Young Park, over 200 miles south of Albuquerque. Three victims, a 16-year-old boy and two 19-year-old men, were found dead.”\n\nMost parks close at 10 pm.",
                "Idiots at a car meet/takeover at 10pm. Those seem to only attract the shittiest type of people.",
                "They say you can tell when winter is over in France because they start setting cars on fire again.\n\nI guess winter is over in America.",
                "I'm at a park with my kid as I see this\n\n\nFuck guns and those that prioritize gun execs being wealthy over human lives\n\nedit: \"Blame the tool, not the murderer\" hey chief do you think we should allow people to bring bombs on planes too? After all, it's not the bomb's fault! We have to protect the inanimate weapons!\n\nEvery other developed nation in the world has this figured out, but then again, they haven't had large factions doing their best to dismantle education for half a century\n\nedit: Like i said, proven effective in every other country in the developed world. Yes, it would reduce shootings immensely to have fewer guns around. Can't believe how dumb people are about this, people like u/optimaloutcome making the \"no laws work so we shouldn't have any laws\" argument. Laws are effective, this doesn't need to be demonstrated or proven any more than all of human history already has.\n\nGun laws work. Restricted access and fewer guns in the population means fewer guns in the hands of people willing to commit shootings. Please use your brains, and not just regurgitate logic-free gun lobby talking points.\n\n*There is a reason this shit doesn't happen all the time anywhere else in the world.* Australia's example is *right there.*",
                "Fuck. I was just thinking yesterday about how it’s been nice having not hearing about a mass or school shooting in a minute. Also I went to college in las cruces so breaks my heart even more to hear about this. I hope they’re able to find this piece of shit who did this quickly",
                "But it's not Domestic Terrorism because no Teslas were spray painted...",
                "I feel like there have been far fewer shootings in the USA lately. Or maybe so much else is happening so fast that they’re just background noise. And I can’t tell what’s sadder.",
                "Not worthy reporting on Fox, unless a Tesla was damaged.",
                "Trump: “This isn’t terrorism. Vandalism is terrorism!”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Protesters in Turkey rally 'for justice' after mayor's arrest - BBC News",
            "external_url": "https://www.bbc.com/news/articles/c0egjvj8vdro.amp",
            "upvotes": 580,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a8c/live/4a1595a0-07bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "#Tear Gas and Turmoil as Turkey Rises for Justice\n\nThe streets of Istanbul have been lit up not by celebration but by the fierce glow of protest as thousands rally for justice following the arrest of the city’s mayor, Ekrem Imamoglu. For four nights running, crowds have surged across Turkey’s major cities, marking the country’s largest wave of demonstrations in over a decade. What began with a few scattered gatherings has now grown into a roar of resistance.\n\nImamoglu, long seen as a serious rival to President Recep Tayyip Erdogan, was taken into custody on Wednesday, just days before his party was expected to confirm him as their presidential candidate for 2028. Accused of corruption and aiding terrorist groups, charges he flatly denies, his arrest has shaken the political landscape and drawn thousands into the streets demanding his release.\n\nOn Saturday, he appeared in court, his supporters chanting \"rights, law, justice\" outside as tear gas swirled in the cold night air. Riot police stood shoulder to shoulder, firing round after round to break up the crowds, but still they came. Mothers holding their children, students in masks, pensioners waving flags, all united by a shared belief that something fundamental is slipping away.\n\n\"I'm here for liberty,\" one young woman told the BBC, her face hidden behind a mask. \"Turkish people cannot accept this. This is against our behaviour and culture.\" Her words echoed the mood across Istanbul, where the government has banned public gatherings in a bid to quell the unrest. But the ban only seems to have poured fuel on the fire.\n\nIn Izmir and Ankara, the story was much the same. Water cannons, arrests, more tear gas. On Friday alone, 343 people were reportedly detained. Still, the crowds held their ground, shouting not in anger but in defiance, determined to be heard. There is an unmistakable feeling that this is no longer just about one man, but about the future of democracy itself in Turkey.\n\nImamoglu’s bid for the presidency now hangs in the balance. Just a day before his arrest, Istanbul University stripped him of his degree, citing irregularities. If upheld, this would disqualify him from running, as Turkish law requires a university qualification for presidential candidates. The timing has raised eyebrows across the political spectrum.\n\nPresident Erdogan, who has ruled the country for over two decades, cannot stand again in 2028 unless the constitution is changed. Critics argue that the arrests of Imamoglu and more than a hundred others, including journalists and business figures, are an attempt to clear the political field before the next election. The government, for its part, insists the judiciary is acting independently and has hit out at those suggesting otherwise.\n\nWhether or not that claim holds weight, what is clear is that a growing number of Turkish citizens feel they are being silenced. The sheer courage of those risking arrest to march night after night speaks volumes. These protests are no longer just about one politician behind bars. They are about the soul of a nation, and the kind of future its people are willing to fight for.",
                "I was in the protests in İzmir yesterday and today, and the police have been illegally throwing pepper spray bombs in the air, using concentrated pepper gas, pepper gas releasing plastic bullets, pressurized water and agent orange with riot control vehicles, and shooting people with plastic bullets, and doing all that without announcing they were going to use excessive force to the public, which is also illegal."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Istanbul mayor testifies in court as protesters across Turkey defy ban on gatherings | CNN",
            "external_url": "https://edition.cnn.com/2025/03/21/middleeast/turkey-protests-erdogan-mayor-intl-latam/index.html",
            "upvotes": 126,
            "date": "03/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2205793785.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Turkey's officially a healthier democracy than the US; at least they're fighting back.",
                " The ban on gatherings is completely unlawful, the constitution clearly says \"people can gather and protest without needing permission\". They're trying to look big and strong to scare us and it's failing miserably."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Car Thieves Steal 8 Corvettes From GM Plant",
            "external_url": "https://www.wbko.com/2025/03/23/8-corvettes-stolen-gm-assembly-plant-bowling-green/",
            "upvotes": 204,
            "date": "03/23/2025",
            "thumbnail": "https://gray-wbko-prod.gtv-cdn.com/resizer/v2/4BP2Q4I2M5A67HWXGDEHOBJY7A.jpg?auth=dc595f785604ab91ae299db6cee41ab3ee63f16240265815c46c42ca62270545&width=1200&height=600&smart=false&focal=362%2C406",
            "top_comments": [
                "Police spotted one clearly from the factory and called to ask if they were missing a $160,000 Corvette. It hadn't been reported stolen yet",
                "So that brand new Corvette I just bought for $40,000 cash was hot?",
                "GM wouldn't miss just one little piece.",
                "Is this domestic terrorism also?",
                "Was somebody doing an irl Gone in 60 Seconds?",
                "Wait until they find out that there’s no Apple CarPlay in them. They’ll be Furious.",
                "What’s the market for these if they are stolen? Honest question, aren’t there quite a bit of technology that would make this futile? Or are piecing them out an option?",
                "Pretty simple when they leave the keys in the ignition.",
                "OEM Corvette parts like new half off!",
                "So is this domestic terrorism as well now or only if Teslas are affected? Can’t keep up"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Canada can win trade war: Foreign affairs minister Mélanie Joly",
            "external_url": "https://www.bbc.com/news/articles/cg70mknye9lo",
            "upvotes": 200,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f586/live/553c6d50-0735-11f0-89cc-0d80fc5d07b9.jpg",
            "top_comments": [
                "Winning is diversifying, can’t win outright but can look to other markets and can come out stronger",
                "Nobody wins in a trade war. Canada winning in this case would be finding a way to limit damage in the short term, while diversifying for the medium/long term. \n\nHopefully there continues to be a strong trading relationship with the US after all this but I’m afraid our tight partnership is over.",
                "There are no winners in trade wars, regardless of anything politicians or their pet economists may say.",
                "We can, and we will\n\nIt will involve careful counter tariffs, an expansion into new markets, cleaning up our internal trade barriers and massive investment in infrastructure that both facilitates getting our goods to foreign markets and the cross country movement of the same\n\nBut, none of that will matter without huge investment into our military and our military industrial manufacturing complex (which could use a lot of the metals and other resources the USA apparently doesn’t want) so Trump knows we will be just as ugly to conquer as Ukraine has been",
                "Canada is united, a lot of Americans like myself fucking hate Trump",
                "Ever notice how much T-Rump says how much he doesn’t need Canada? He does. So we’re in a good spot as NASTY NEGOTIATORS LOL. That’s the best compliment from T-Drumph a Canadian can get.",
                "Everyone loses in a trade war, there’s no winners, but at the end of the day, it is better to start diversifying.",
                "[deleted]",
                "I just know their egg prices are cheaper and people are actually trying to smuggle them across the border.",
                "If the USA economy collapses and Canada manages to survive, I would take that as a victory. We can hopefully kick the Americans while they are down in future trade deals and exploit them to make up for their transgressions."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "SeaWorld faces OSHA fine after trainer injured by killer whale at Orlando park",
            "external_url": "https://www.denver7.com/us-news/seaworld-fined-by-osha-after-trainer-injured-by-killer-whale-at-orlando-park",
            "upvotes": 809,
            "date": "03/23/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/ce7e022/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F67%2F6e%2Ff7f7b91b419b86959524b76f539b%2Fshutterstock-1624670470.jpg",
            "top_comments": [
                "OSHA will be dismantled next week",
                "Whales should be in the open ocean where they belong ….when will humans realize this …",
                ">The department proposed a fine of $16,550.\n\nThese proposed fines can be negotiated down. Then they can be ignored for a while, only to have the company pay a fraction of the negotiated fine. All while admitting no wrong doing.",
                "Why did I think there were no more Orcas at Sea World?",
                "I propose that we once again learn nothing from this.",
                "The article doesn’t mean how this happened but I thought after all the previous deaths and injuries people weren’t even allowed to be in the water with them anymore",
                "well duh, they ain't called friendly whales",
                "Why hasn’t this place been shut down yet?",
                "It is an apex predator, what could go wrong?",
                "Apparently Blackfish taught them nothing"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43",
            "external_url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/",
            "upvotes": 14686,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/03/GettyImages-1827676825.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "She had been investigating [Russian billionaires' money laundering](https://databreaches.net/2024/09/26/two-russian-nationals-charged-in-connection-with-operating-billion-dollar-money-laundering-services/) and [Russian war crimes against a US national living in Ukraine](https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/?_osource=SocialFlowTwt_DCBrand)",
                "Ugh this is horrible ..may she rest in peace",
                "I hope this isn't our version of \"falling out a window\"",
                "Initially suspicious.\n\nHopefully subsequent news dispels it.",
                "Rest in peace. That is a very young age to go.",
                "That's just entirely too young for this day and age.",
                "Hopefully we don’t look back at this as the “first” of anything…",
                "Im not making any definitive statements on this but im already seeing the radicalized maga psychopaths saying she had it coming & its Joe Biden's fault on \"twitter\" so.. \n\nI think redemption or a legitimate awakening to reality is off the table - They're so far gone they are actively supporting death of their perceived enemies. ",
                "She's notable for work investigating Russian War Crimes. And also putting away *a lot of people* who abused children, more specifically a lot of child abusers with ties to law enforcement. She resigned her position a few months ago, after Trump's election and subsequent interference in her work. \n\n\nNot to suggest this has to have been foul play, before we have any information to support that. But its definitely something to keep an eye on. ",
                "Poor family of hers man…."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "United pilot attacked passenger for taking too long in the bathroom, lawsuit alleges | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/22/united-pilot-attacks-passenger",
            "upvotes": 1990,
            "date": "03/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/587e60049d651d0fa4221718e074d34b7f9b7281/0_0_5149_3090/master/5149.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2698b5b29e80cb05b580a1aaf52f760e",
            "top_comments": [
                ">\tLiebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are homeland. You have no rights here.”\n\nWhat is this 1984 shit?",
                "Every time I take a united flight, I joke about brushing up on street fighting skills, because we all know “fLight club” is real at united.",
                "The pilots would’ve used the lav nearer the flight deck, not the one in the back",
                "I’m shocked SHOCKED that an airline famous for [breaking guitars](https://youtu.be/5YGc4zOqozo) and [dragging a doctor off a plane](https://youtu.be/VrDWY6C1178) would do something so callous. ",
                "That sucks but there’s a small part of me that wants to do this whenever someone is in there taking way too long because they’re just scrolling…\n\nLike please bro, I accidentally had some milk and now my ass is gonna explode.",
                "The pilot did not break the lock. The bathroom door on an airplane can be unlocked very easily from the outside.",
                "Ok but 30 minutes? Cmon.",
                "Had enough of their shit fr",
                "This headline and story seem doubtful",
                "Yeahhh, I think people need to wait and see where this leads. The article is strictly from the plaintiffs perspective because the airline won't comment.\n\nI have a hard time believing a pilot would break a door down to pull a man out who was just using the restroom. There had to be something else going on. \n\nLike was the guy being belligerent? Was he actually suffering from an issue or was he doing something else in the bathroom? Obviously he's not going to say \"yeah I wasn't really going to the bathroom, I was hanging out for 30+ minutes and being a dickhead to the staff.\" Also the plaintiff doesn't specify when it happened, perhaps the plane was close to landing? As everyone knows you can't be in the bathroom during that. Maybe the pilot/flight attendants were concerned he was lying because he was in there for 30+ minutes.\n\nA pilot isn't going to risk their license/job by attacking a passenger and doing damage to the plane. Something had to be going on."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Protesters in Turkey rally 'for justice' after mayor's arrest - BBC News",
            "external_url": "https://www.bbc.com/news/articles/c0egjvj8vdro.amp",
            "upvotes": 578,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a8c/live/4a1595a0-07bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "#Tear Gas and Turmoil as Turkey Rises for Justice\n\nThe streets of Istanbul have been lit up not by celebration but by the fierce glow of protest as thousands rally for justice following the arrest of the city’s mayor, Ekrem Imamoglu. For four nights running, crowds have surged across Turkey’s major cities, marking the country’s largest wave of demonstrations in over a decade. What began with a few scattered gatherings has now grown into a roar of resistance.\n\nImamoglu, long seen as a serious rival to President Recep Tayyip Erdogan, was taken into custody on Wednesday, just days before his party was expected to confirm him as their presidential candidate for 2028. Accused of corruption and aiding terrorist groups, charges he flatly denies, his arrest has shaken the political landscape and drawn thousands into the streets demanding his release.\n\nOn Saturday, he appeared in court, his supporters chanting \"rights, law, justice\" outside as tear gas swirled in the cold night air. Riot police stood shoulder to shoulder, firing round after round to break up the crowds, but still they came. Mothers holding their children, students in masks, pensioners waving flags, all united by a shared belief that something fundamental is slipping away.\n\n\"I'm here for liberty,\" one young woman told the BBC, her face hidden behind a mask. \"Turkish people cannot accept this. This is against our behaviour and culture.\" Her words echoed the mood across Istanbul, where the government has banned public gatherings in a bid to quell the unrest. But the ban only seems to have poured fuel on the fire.\n\nIn Izmir and Ankara, the story was much the same. Water cannons, arrests, more tear gas. On Friday alone, 343 people were reportedly detained. Still, the crowds held their ground, shouting not in anger but in defiance, determined to be heard. There is an unmistakable feeling that this is no longer just about one man, but about the future of democracy itself in Turkey.\n\nImamoglu’s bid for the presidency now hangs in the balance. Just a day before his arrest, Istanbul University stripped him of his degree, citing irregularities. If upheld, this would disqualify him from running, as Turkish law requires a university qualification for presidential candidates. The timing has raised eyebrows across the political spectrum.\n\nPresident Erdogan, who has ruled the country for over two decades, cannot stand again in 2028 unless the constitution is changed. Critics argue that the arrests of Imamoglu and more than a hundred others, including journalists and business figures, are an attempt to clear the political field before the next election. The government, for its part, insists the judiciary is acting independently and has hit out at those suggesting otherwise.\n\nWhether or not that claim holds weight, what is clear is that a growing number of Turkish citizens feel they are being silenced. The sheer courage of those risking arrest to march night after night speaks volumes. These protests are no longer just about one politician behind bars. They are about the soul of a nation, and the kind of future its people are willing to fight for.",
                "I was in the protests in İzmir yesterday and today, and the police have been illegally throwing pepper spray bombs in the air, using concentrated pepper gas, pepper gas releasing plastic bullets, pressurized water and agent orange with riot control vehicles, and shooting people with plastic bullets, and doing all that without announcing they were going to use excessive force to the public, which is also illegal."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "A passenger says a United pilot forcibly removed him from an airplane bathroom. Now he is suing",
            "external_url": "https://apnews.com/article/united-airlines-bathroom-lavatory-lawsuit-orthodox-jews-348d297cec3ff009c29859047b9d2fe4",
            "upvotes": 581,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "30 min in the bathroom in a 2hr flight.. wtf was he doing in there?",
                "If I’m constipated and can’t make a movement I give up after 15 minutes and live to fight another day",
                "If I had to take a wild guess, I bet he went to the bathroom while they were trying to land and they had to abort the landing. Not saying what the pilot did was right, but it might explain the anger, especially if he kept saying he was almost done and then taking another 10 minutes.",
                "I was on a long haul flight where this guy kept going to the toilet for 20 min or more multiple times. Finally the flight attendants called him out for hogging the toilets after several complaints.  He was just hanging out in there because he had a middle seat and wanted privacy and room to stretch. They had to warn him that he would be timed or banned at some point. So selfish. ",
                "Ok but 30 minutes? This isn't your private bathroom, cmon.",
                ">Liebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are Homeland. You have no rights here.”\n\nI have no words...",
                "The bathroom was probably more comfortable than his seat.",
                "What kind of fucking moron thinks it's OK to sit in an airplane bathroom for as long as he wants?? 30+ minutes?? How long would he have stayed in there if it wasn't for the pilot yanking him out and returning him to his seat? Constipation is not a medical emergency. Fuck that guy. And fuck him for playing the religion card, which is highly suspect.",
                "Does he have Crohn’s disease or ulcerative colitis?",
                "Jacking it “to help with his anxiety”"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "2 more cases of measles confirmed in Maryland",
            "external_url": "https://wtop.com/health-fitness/2025/03/2-more-cases-of-measles-confirmed-in-maryland/",
            "upvotes": 1417,
            "date": "03/22/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2024/04/Technology_Passport_Control_91675-scaled.jpg",
            "top_comments": [
                "Between this, H5N1, and a looming economic downturn, we're in for a hell of a time.",
                "If only we had a proven medical way to prevent measles from spreading.",
                "Needles with vaccine?  Bad.  \nNeedles with heroin? Good!\n\n-RFK Jr. ",
                "\"we've done nothing and we're out of ideas\" - the current administration in power",
                "Jeez the possible exposure areas/times feels like an itinerary list.",
                "Just take a multivitamin and you’ll be fine! /s",
                "This administration of effete billionaires, who've never crossed paths with a hard day's work, don't think we really need vaccines. Or CDC research. Or affordable health care, or educations, or affordable groceries, or our foreign allies, or the social security benefits that we payed into for years. What we need - above all - is for *them* to pay less taxes. \n\nThen they hop on a jet to go play golf on one of their many private, guarded properties - again at our expense, of course. I mean, you'd have to just despise your fellow Americans to cheer these inept, pampered, bad-actors on.",
                "Sacrificing their children on the altar to their orange god-king.",
                "Oh dear. Wow.\n\nI hope they can figure out a way to prevent all of this.",
                "Our enemies are laughing there asses off \n\nHow do you defeat a more advanced enemy? \n\nFROM WITHIN"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Nova Scotia legislators vote unanimously to scrap electric car rebates for Tesla",
            "external_url": "https://www.thecanadianpressnews.ca/politics/nova-scotia-legislators-vote-unanimously-to-scrap-electric-car-rebates-for-tesla/article_644f9fd5-46b5-5b39-9032-772de4b37f7c.html",
            "upvotes": 1828,
            "date": "03/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/d/bd/dbdbe4b2-efe8-50e1-9af3-4f193ff5b396/67ded0c011d58.image.jpg?crop=1400%2C735%2C0%2C99&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Good.  \n\nDrive TSLA stock into the ground.  Have it go from the highest market cap company to bankrupt in less than 4 years.",
                "🇨🇦 Elbows up my Canadian friends! 🇨🇦",
                "Sigh.   I get the protest completely..  but we shouldn't be discouraging electic vehicles.  Sure promote other ones.  But don't harm those making the investment to the betterment of our futures.",
                "> \"There are other options for us here in Canada for electric vehicles,\" she said.\n\nAh yes, all the other good options such as... that Porsche EV that costs $200k? A bolt (who wants to drive a GM vehicle)? Um. That garbage BMW that gets like 60mi of range? \n\n---\n\n> trade war\n\nThis is funny because apparently the different providences in Canada put tariffs on each other. Wonder if they'll ban each other for engaging in a trade war."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Nova Scotia legislators vote unanimously to scrap electric car rebates for Tesla",
            "external_url": "https://www.thecanadianpressnews.ca/politics/nova-scotia-legislators-vote-unanimously-to-scrap-electric-car-rebates-for-tesla/article_644f9fd5-46b5-5b39-9032-772de4b37f7c.html",
            "upvotes": 1826,
            "date": "03/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/d/bd/dbdbe4b2-efe8-50e1-9af3-4f193ff5b396/67ded0c011d58.image.jpg?crop=1400%2C735%2C0%2C99&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Good.  \n\nDrive TSLA stock into the ground.  Have it go from the highest market cap company to bankrupt in less than 4 years.",
                "🇨🇦 Elbows up my Canadian friends! 🇨🇦",
                "Sigh.   I get the protest completely..  but we shouldn't be discouraging electic vehicles.  Sure promote other ones.  But don't harm those making the investment to the betterment of our futures.",
                "> \"There are other options for us here in Canada for electric vehicles,\" she said.\n\nAh yes, all the other good options such as... that Porsche EV that costs $200k? A bolt (who wants to drive a GM vehicle)? Um. That garbage BMW that gets like 60mi of range? \n\n---\n\n> trade war\n\nThis is funny because apparently the different providences in Canada put tariffs on each other. Wonder if they'll ban each other for engaging in a trade war."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43",
            "external_url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/",
            "upvotes": 14679,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/03/GettyImages-1827676825.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "She had been investigating [Russian billionaires' money laundering](https://databreaches.net/2024/09/26/two-russian-nationals-charged-in-connection-with-operating-billion-dollar-money-laundering-services/) and [Russian war crimes against a US national living in Ukraine](https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/?_osource=SocialFlowTwt_DCBrand)",
                "Ugh this is horrible ..may she rest in peace",
                "I hope this isn't our version of \"falling out a window\"",
                "Initially suspicious.\n\nHopefully subsequent news dispels it.",
                "Rest in peace. That is a very young age to go.",
                "That's just entirely too young for this day and age.",
                "Hopefully we don’t look back at this as the “first” of anything…",
                "Im not making any definitive statements on this but im already seeing the radicalized maga psychopaths saying she had it coming & its Joe Biden's fault on \"twitter\" so.. \n\nI think redemption or a legitimate awakening to reality is off the table - They're so far gone they are actively supporting death of their perceived enemies. ",
                "She's notable for work investigating Russian War Crimes. And also putting away *a lot of people* who abused children, more specifically a lot of child abusers with ties to law enforcement. She resigned her position a few months ago, after Trump's election and subsequent interference in her work. \n\n\nNot to suggest this has to have been foul play, before we have any information to support that. But its definitely something to keep an eye on. ",
                "Poor family of hers man…."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Canada can win trade war: Foreign affairs minister Mélanie Joly",
            "external_url": "https://www.bbc.com/news/articles/cg70mknye9lo",
            "upvotes": 202,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f586/live/553c6d50-0735-11f0-89cc-0d80fc5d07b9.jpg",
            "top_comments": [
                "Winning is diversifying, can’t win outright but can look to other markets and can come out stronger",
                "Nobody wins in a trade war. Canada winning in this case would be finding a way to limit damage in the short term, while diversifying for the medium/long term. \n\nHopefully there continues to be a strong trading relationship with the US after all this but I’m afraid our tight partnership is over.",
                "There are no winners in trade wars, regardless of anything politicians or their pet economists may say.",
                "We can, and we will\n\nIt will involve careful counter tariffs, an expansion into new markets, cleaning up our internal trade barriers and massive investment in infrastructure that both facilitates getting our goods to foreign markets and the cross country movement of the same\n\nBut, none of that will matter without huge investment into our military and our military industrial manufacturing complex (which could use a lot of the metals and other resources the USA apparently doesn’t want) so Trump knows we will be just as ugly to conquer as Ukraine has been",
                "Canada is united, a lot of Americans like myself fucking hate Trump",
                "Ever notice how much T-Rump says how much he doesn’t need Canada? He does. So we’re in a good spot as NASTY NEGOTIATORS LOL. That’s the best compliment from T-Drumph a Canadian can get.",
                "Everyone loses in a trade war, there’s no winners, but at the end of the day, it is better to start diversifying.",
                "[deleted]",
                "I just know their egg prices are cheaper and people are actually trying to smuggle them across the border.",
                "If the USA economy collapses and Canada manages to survive, I would take that as a victory. We can hopefully kick the Americans while they are down in future trade deals and exploit them to make up for their transgressions."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "SeaWorld faces OSHA fine after trainer injured by killer whale at Orlando park",
            "external_url": "https://www.denver7.com/us-news/seaworld-fined-by-osha-after-trainer-injured-by-killer-whale-at-orlando-park",
            "upvotes": 809,
            "date": "03/23/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/ce7e022/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F67%2F6e%2Ff7f7b91b419b86959524b76f539b%2Fshutterstock-1624670470.jpg",
            "top_comments": [
                "OSHA will be dismantled next week",
                "Whales should be in the open ocean where they belong ….when will humans realize this …",
                ">The department proposed a fine of $16,550.\n\nThese proposed fines can be negotiated down. Then they can be ignored for a while, only to have the company pay a fraction of the negotiated fine. All while admitting no wrong doing.",
                "Why did I think there were no more Orcas at Sea World?",
                "I propose that we once again learn nothing from this.",
                "The article doesn’t mean how this happened but I thought after all the previous deaths and injuries people weren’t even allowed to be in the water with them anymore",
                "well duh, they ain't called friendly whales",
                "Why hasn’t this place been shut down yet?",
                "It is an apex predator, what could go wrong?",
                "Apparently Blackfish taught them nothing"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Protesters in Turkey rally 'for justice' after mayor's arrest - BBC News",
            "external_url": "https://www.bbc.com/news/articles/c0egjvj8vdro.amp",
            "upvotes": 581,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a8c/live/4a1595a0-07bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "#Tear Gas and Turmoil as Turkey Rises for Justice\n\nThe streets of Istanbul have been lit up not by celebration but by the fierce glow of protest as thousands rally for justice following the arrest of the city’s mayor, Ekrem Imamoglu. For four nights running, crowds have surged across Turkey’s major cities, marking the country’s largest wave of demonstrations in over a decade. What began with a few scattered gatherings has now grown into a roar of resistance.\n\nImamoglu, long seen as a serious rival to President Recep Tayyip Erdogan, was taken into custody on Wednesday, just days before his party was expected to confirm him as their presidential candidate for 2028. Accused of corruption and aiding terrorist groups, charges he flatly denies, his arrest has shaken the political landscape and drawn thousands into the streets demanding his release.\n\nOn Saturday, he appeared in court, his supporters chanting \"rights, law, justice\" outside as tear gas swirled in the cold night air. Riot police stood shoulder to shoulder, firing round after round to break up the crowds, but still they came. Mothers holding their children, students in masks, pensioners waving flags, all united by a shared belief that something fundamental is slipping away.\n\n\"I'm here for liberty,\" one young woman told the BBC, her face hidden behind a mask. \"Turkish people cannot accept this. This is against our behaviour and culture.\" Her words echoed the mood across Istanbul, where the government has banned public gatherings in a bid to quell the unrest. But the ban only seems to have poured fuel on the fire.\n\nIn Izmir and Ankara, the story was much the same. Water cannons, arrests, more tear gas. On Friday alone, 343 people were reportedly detained. Still, the crowds held their ground, shouting not in anger but in defiance, determined to be heard. There is an unmistakable feeling that this is no longer just about one man, but about the future of democracy itself in Turkey.\n\nImamoglu’s bid for the presidency now hangs in the balance. Just a day before his arrest, Istanbul University stripped him of his degree, citing irregularities. If upheld, this would disqualify him from running, as Turkish law requires a university qualification for presidential candidates. The timing has raised eyebrows across the political spectrum.\n\nPresident Erdogan, who has ruled the country for over two decades, cannot stand again in 2028 unless the constitution is changed. Critics argue that the arrests of Imamoglu and more than a hundred others, including journalists and business figures, are an attempt to clear the political field before the next election. The government, for its part, insists the judiciary is acting independently and has hit out at those suggesting otherwise.\n\nWhether or not that claim holds weight, what is clear is that a growing number of Turkish citizens feel they are being silenced. The sheer courage of those risking arrest to march night after night speaks volumes. These protests are no longer just about one politician behind bars. They are about the soul of a nation, and the kind of future its people are willing to fight for.",
                "I was in the protests in İzmir yesterday and today, and the police have been illegally throwing pepper spray bombs in the air, using concentrated pepper gas, pepper gas releasing plastic bullets, pressurized water and agent orange with riot control vehicles, and shooting people with plastic bullets, and doing all that without announcing they were going to use excessive force to the public, which is also illegal."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "2 more cases of measles confirmed in Maryland",
            "external_url": "https://wtop.com/health-fitness/2025/03/2-more-cases-of-measles-confirmed-in-maryland/",
            "upvotes": 1417,
            "date": "03/22/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2024/04/Technology_Passport_Control_91675-scaled.jpg",
            "top_comments": [
                "Between this, H5N1, and a looming economic downturn, we're in for a hell of a time.",
                "If only we had a proven medical way to prevent measles from spreading.",
                "Needles with vaccine?  Bad.  \nNeedles with heroin? Good!\n\n-RFK Jr. ",
                "\"we've done nothing and we're out of ideas\" - the current administration in power",
                "Jeez the possible exposure areas/times feels like an itinerary list.",
                "Just take a multivitamin and you’ll be fine! /s",
                "This administration of effete billionaires, who've never crossed paths with a hard day's work, don't think we really need vaccines. Or CDC research. Or affordable health care, or educations, or affordable groceries, or our foreign allies, or the social security benefits that we payed into for years. What we need - above all - is for *them* to pay less taxes. \n\nThen they hop on a jet to go play golf on one of their many private, guarded properties - again at our expense, of course. I mean, you'd have to just despise your fellow Americans to cheer these inept, pampered, bad-actors on.",
                "Sacrificing their children on the altar to their orange god-king.",
                "Oh dear. Wow.\n\nI hope they can figure out a way to prevent all of this.",
                "Our enemies are laughing there asses off \n\nHow do you defeat a more advanced enemy? \n\nFROM WITHIN"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Car Thieves Steal 8 Corvettes From GM Plant",
            "external_url": "https://www.wbko.com/2025/03/23/8-corvettes-stolen-gm-assembly-plant-bowling-green/",
            "upvotes": 202,
            "date": "03/23/2025",
            "thumbnail": "https://gray-wbko-prod.gtv-cdn.com/resizer/v2/4BP2Q4I2M5A67HWXGDEHOBJY7A.jpg?auth=dc595f785604ab91ae299db6cee41ab3ee63f16240265815c46c42ca62270545&width=1200&height=600&smart=false&focal=362%2C406",
            "top_comments": [
                "Police spotted one clearly from the factory and called to ask if they were missing a $160,000 Corvette. It hadn't been reported stolen yet",
                "So that brand new Corvette I just bought for $40,000 cash was hot?",
                "GM wouldn't miss just one little piece.",
                "Is this domestic terrorism also?",
                "Was somebody doing an irl Gone in 60 Seconds?",
                "Wait until they find out that there’s no Apple CarPlay in them. They’ll be Furious.",
                "What’s the market for these if they are stolen? Honest question, aren’t there quite a bit of technology that would make this futile? Or are piecing them out an option?",
                "Pretty simple when they leave the keys in the ignition.",
                "OEM Corvette parts like new half off!",
                "So is this domestic terrorism as well now or only if Teslas are affected? Can’t keep up"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "The Pentagon's DEI purge: Officials describe a scramble to remove and then restore online content",
            "external_url": "https://apnews.com/article/pentagon-dei-diversity-social-media-purge-fb15996733408a8122a97acd3baa6820",
            "upvotes": 3949,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*While the pages of some well-known veterans... are now back up on Pentagon websites, officials warn that many posts tagged for removal in error may be gone forever.*\n\nSounds familiar:  they're great at razing but not at raising.",
                "A great use of our tax dollars for sure! /s",
                "What are the odds they will quietly remove them again in a few months, hoping people will be distracted by another thing?",
                "These revisionists deemed the Enola Gay, the Tuskegee airmen, and Major General Charles Rogers's Medal of Honor DEI. They are trying to scrub the history of the military and they call themselves patriots and America First. People really should have paid attention to Project 2025 since now, we have to wait until 2026 to change the Congress.",
                "They also took down the web pages concerning the most decorated military unit in US history, the 442nd Regimental Combat Team. An outcry from veterans restored it.",
                "Racist, homophobic assholes.",
                "Why would people that want to overthrow our democracy spend this much time and effort pissing off the military FOR NO TANGIBLE BENEFIT?\n\nWell I suppose if these people were smart they wouldn’t be racist..",
                "Can’t have anyone thinking women, gays, or the blacks materially participated in our military. /s",
                "It's almost like big balls wrote an algorithm that checks everything against a keyword list of things that this admin wants to erase from history.",
                "Glad to see my tax dollars spent well....."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "United pilot attacked passenger for taking too long in the bathroom, lawsuit alleges | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/22/united-pilot-attacks-passenger",
            "upvotes": 1980,
            "date": "03/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/587e60049d651d0fa4221718e074d34b7f9b7281/0_0_5149_3090/master/5149.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2698b5b29e80cb05b580a1aaf52f760e",
            "top_comments": [
                ">\tLiebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are homeland. You have no rights here.”\n\nWhat is this 1984 shit?",
                "Every time I take a united flight, I joke about brushing up on street fighting skills, because we all know “fLight club” is real at united.",
                "The pilots would’ve used the lav nearer the flight deck, not the one in the back",
                "I’m shocked SHOCKED that an airline famous for [breaking guitars](https://youtu.be/5YGc4zOqozo) and [dragging a doctor off a plane](https://youtu.be/VrDWY6C1178) would do something so callous. ",
                "That sucks but there’s a small part of me that wants to do this whenever someone is in there taking way too long because they’re just scrolling…\n\nLike please bro, I accidentally had some milk and now my ass is gonna explode.",
                "The pilot did not break the lock. The bathroom door on an airplane can be unlocked very easily from the outside.",
                "Ok but 30 minutes? Cmon.",
                "Had enough of their shit fr",
                "This headline and story seem doubtful",
                "Yeahhh, I think people need to wait and see where this leads. The article is strictly from the plaintiffs perspective because the airline won't comment.\n\nI have a hard time believing a pilot would break a door down to pull a man out who was just using the restroom. There had to be something else going on. \n\nLike was the guy being belligerent? Was he actually suffering from an issue or was he doing something else in the bathroom? Obviously he's not going to say \"yeah I wasn't really going to the bathroom, I was hanging out for 30+ minutes and being a dickhead to the staff.\" Also the plaintiff doesn't specify when it happened, perhaps the plane was close to landing? As everyone knows you can't be in the bathroom during that. Maybe the pilot/flight attendants were concerned he was lying because he was in there for 30+ minutes.\n\nA pilot isn't going to risk their license/job by attacking a passenger and doing damage to the plane. Something had to be going on."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "A passenger says a United pilot forcibly removed him from an airplane bathroom. Now he is suing",
            "external_url": "https://apnews.com/article/united-airlines-bathroom-lavatory-lawsuit-orthodox-jews-348d297cec3ff009c29859047b9d2fe4",
            "upvotes": 576,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "30 min in the bathroom in a 2hr flight.. wtf was he doing in there?",
                "If I’m constipated and can’t make a movement I give up after 15 minutes and live to fight another day",
                "If I had to take a wild guess, I bet he went to the bathroom while they were trying to land and they had to abort the landing. Not saying what the pilot did was right, but it might explain the anger, especially if he kept saying he was almost done and then taking another 10 minutes.",
                "I was on a long haul flight where this guy kept going to the toilet for 20 min or more multiple times. Finally the flight attendants called him out for hogging the toilets after several complaints.  He was just hanging out in there because he had a middle seat and wanted privacy and room to stretch. They had to warn him that he would be timed or banned at some point. So selfish. ",
                "Ok but 30 minutes? This isn't your private bathroom, cmon.",
                ">Liebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are Homeland. You have no rights here.”\n\nI have no words...",
                "The bathroom was probably more comfortable than his seat.",
                "What kind of fucking moron thinks it's OK to sit in an airplane bathroom for as long as he wants?? 30+ minutes?? How long would he have stayed in there if it wasn't for the pilot yanking him out and returning him to his seat? Constipation is not a medical emergency. Fuck that guy. And fuck him for playing the religion card, which is highly suspect.",
                "Does he have Crohn’s disease or ulcerative colitis?",
                "Jacking it “to help with his anxiety”"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/23/2025 08:10:17 UTC"
}