{
    "posts": [
        {
            "category": "HOT",
            "title": "Louisiana lawmakers push ‘chemtrail’ ban legislation through the House",
            "external_url": "https://www.kalb.com/2025/05/30/louisiana-lawmakers-push-chemtrail-ban-legislation-through-house/",
            "upvotes": 2842,
            "date": "06/01/2025",
            "thumbnail": "https://gray-kalb-prod.gtv-cdn.com/resizer/v2/4O4E5MLAUBFODOCKOXJPFREKMY.jpg?auth=b95937797a893a2718e09edcd7d8be2b2a1441ebbdad8c6f590feb6a59c3812c&width=1200&height=600&smart=true",
            "top_comments": [
                "Ok, chemtrails are banned.\n\nAny other pretend things we can ban instantly because they're not real?",
                "How, exactly, do they propose to enforce this?",
                "Next up: anti gang-stalking legislation.",
                "How have people gotten so goddamned stupid?",
                "So they gonna sue delta flight DL32 for 'chemtrails'? or arrest the pilots? why don't they just search the airports for the tanks that supposedly hold the chemicals they are supposed to be using to make chemtrails?",
                "Can we get a law to ban leprechauns too?",
                "Why do Americans like to fuck themselves in the ass?",
                "\"How billionaires distract the fools into never organizing as a class\"\n\nIt's up there with aliens and our government being a some super force that's all knowing. \"They'll kill you if you try\" makes people never try.",
                "Louisiana has some of the dumbest lawmakers in the country besides Texas.",
                "We are living in the dumbest fucking timeline.\n\n>During questioning on the House floor, State Rep. Candace Newell (D-New Orleans) asked about the chemicals Coates believes are involved.\n\n>“Other than the nanoparticles of aluminum, what else have you found?” Newell said.\n\n>“Barium. There is a few, some with long words that I can’t pronounce,” Coates said.  \n...\n\n>“Who is doing this?” asked State Rep. Matthew Willard (D-New Orleans).\n\n>“There are multiple people. Multiple groups, contractors,” Coates said.\n\n>“Who are the contracts with?” Willard asked.\n\n>“I’ve seen the documents with at least nine federal agencies,” Coates said.  \n...  \n“(Do you see them) once a week?” asked State Rep. C. Denise Marcelle (D-Baton Rouge).\n\n>“At least, yes—from my house all the way to the Capitol. So when you look up in the air, you look, watch for the big white lines across the sky,” Coates said.\n\nThis woman is legit unhinged."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Business Insider goes 'all-in on AI,' laying off 21% of staff",
            "external_url": "https://www.sfgate.com/bayarea/article/business-insider-ai-laying-off-staff-20353086.php",
            "upvotes": 10969,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Business Insider was already nothing but superficial and low-effort articles.  It won't be hard for AI to replicate the quality of work they've been putting out.",
                "It's 2043. There are 5 CEOs and no one else has a job. AI news sites report news about AI and how AI is AI, is AI.",
                "Every time I read one of these stories, I'm reminded of the early DOGE reports of firing people only to have to re-hire them within weeks once they figure out what the people they fired were actually doing.",
                "If I was to guess who would go “all-in on AI” I would guess them or Forbes. Both publications have half-baked douchey writing.",
                "The Enshittification continues",
                "This is so wildly short-sighted.",
                "I thought it was already all AI, given the quality.",
                "Now I know not to bother to read anything from Business Insider, it'll just be AI mash.",
                "I like it when companies telegraph to their readers that from this point onwards, their reporting will be unreliable and include hallucinating bots.",
                "Going forward, I'll be downvoting all links to Business Insider."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "White House to pull NASA nominee Isaacman",
            "external_url": "https://www.semafor.com/article/05/31/2025/white-house-expected-to-pull-nasa-nominee-isaacman",
            "upvotes": 2754,
            "date": "05/31/2025",
            "thumbnail": "https://img.semafor.com/f038821d54f49c923c01343a817fd75f382381b1-4788x3192.jpg?rect=0,339,4788,2514&w=1200&h=630&q=75&auto=format",
            "top_comments": [
                "Love this part, using Loomer as a source: \"Conservative personality Laura Loomer [suggested](https://x.com/LauraLoomer/status/1928849664905728223) on Saturday Isaacman’s nomination is in danger because of the nominee’s friendship with Elon Musk. Musk departed the administration this week.\"",
                "Wasn’t this the ONE nomination that was met with near-universal approval from both sides and NASA themselves? So of course they’re pulling his name now bc why not",
                "He’s was one of the few not insanely crazy nominees among a sea of crazy unqualified people filling up other positions.",
                "I think the Whitehouse decided he wasn't qualified enough. I mean he only has some prior fraud charges against him, but no convictions and no sexual assault allegations, what were they thinking?",
                "So is this going to be like last Trump administration where NASA didn't have an administrator for over a year?",
                "Marco Rubio will be named interim director",
                "he was allegedly pulled because he was found to have donated to democrats",
                "Next nominee will be Kid Rock or Kevin Sorbo because why the fuck not",
                "He heard about this before anyone else",
                "Let me guess; they're going to shut NASA down entirely and hand it's assets over to SpaceX?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FBI leaders say jail video shows Jeffery Epstein died by sucide",
            "external_url": "https://www.nbcnews.com/politics/justice-department/dan-bongino-kash-patel-jeffrey-epstein-rcna209871",
            "upvotes": 13255,
            "date": "05/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-jeffrey-epstein-list-wm-311p-b8d586.jpg",
            "top_comments": [
                "Soooo, the cameras WERE on after all?",
                "Did they blur out the suicider?",
                "\"Deputy FBI Director Dan Bongino, a former pro-Trump podcaster\"\n\nWTF kinda country do I live in?",
                "It took this long to release the footage because they had to wait for AI to develop to this point.",
                "You mean the video from the cameras that were supposedly malfunctioning and not working as guards slept and not doing their rounds or checking on inmates on suicide watch?\n\nThose cameras?",
                "Does it say it on his knuckles?",
                "The fact it's Trump's FBI saying it, years after it happened, is arguably the strongest evidence yet that it was murder.",
                "I do not believe a word from the FBI under the current administration.",
                "The original report was that the cameras were down, at least I remember that was the case. How do they have video footage if the cameras weren’t working?",
                "They waited until Ai generated video looks indistinguishable from real footage… but ok"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Warning after 250 million bees escape overturned truck in US",
            "external_url": "https://www.bbc.co.uk/news/articles/c23mrprk952o",
            "upvotes": 10414,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/afdf/live/ca544700-3dd3-11f0-8853-41527df633df.jpg",
            "top_comments": [
                "This is a real tragedy. These trucks take bees from thousands of keepers down to California for events like almond plant pollination. If they can’t clean it up in a way that gives the bees time to find their own queens among the wreckage, almost all of them are doomed. And it’ll be a total loss for the farmers, pending insurance. California farmers need to find more bees or not get pollinated, Washington farmers need to replace the bees they’ve raised. Local region gets a bunch of stressed out honeybees with nowhere to go. It’ll take some really careful mitigation to recover it all, on top of handling the accident and the surrounding humanity. \n\nAlso, ridiculous that our farming infrastructure requires bee imports for pollination. How about boost the habitat around the farms and cut down on the monoculture crops? All the highways and stormwater ditches should be no-mow in the dry summer. Retain moisture in the vegetation and give a wildlife coordinator to connect habitat fragments and boost pollination. And save on public works maintenance costs. The problem for these bees is that there are no flowers most of the summer, and then a mega monoculture blooms and expects there to be billions of bees and butterflies to support it. But also here’s neurological pesticides like neonics to kill the “bad bugs.” You reap what you sow. ",
                "there are roughly 30,000 bees in a hive at this time of year.\n\n33 hives to reach a million.\n\n250x33 is 8250 hive boxes.\n\na Langstroth hive is roughly 20x16x12 inches.  So you'd get 6 on a standard pallet layer, maybe 3 layers preparatory for doublestacking.. that's 458 pallets.\n\nI think the deputy making the announcement was off by a factor of 4 to 5.  Still a terrifying event, though.",
                "I’m surprised that 250 million bees is only one truckload",
                "True story.   \nI had 2 hives in my back yard for a few years and we had to move. So we waited until it was dark (so all the bees are in the hives, we closed it up and put them in the back of my enclosed SUV. We were driving them about an hour and a half away to their new home. So in the middle of the drive, around midnight we noticed a bee flying around in the front of the car. Then another... so we stopped at a gas station, popped the back open and the bees were bearding on the outside of one of the hives. LOTS of them. So, luckily we had our trusty suits with us and we put them on at the gas station, just as a fire truck pulls up. \n\n\"You alright?\" The fireman asks us. \n\n\"Yea, the bees just got out.\" I respond back. \n\n\"Oh.\" he pauses for a good 3 seconds..\"Good luck with that.\" he says, then he puts the fire truck in gear and drives out.\n\nI guess we looked silly (or sus) putting on beekeeping suits at a gas station, at midnight, in an urban area. Anyway, we then got back in the car, cranked the AC to max to keep the bees cool so that they don't get angy. In the end we succeeded in rehoming the hives without too much of an issue. (we were able to move the hive with the bees all over the outside.)",
                "As a beekeeper myself I highly doubt the number of 250 million is accurate. Someone probably added a zero too many\n\nIn the peek of the season a hive contains 50.000 to 60.000 bees.\n\nWith the US Langstroth hives of 54 x 46? cm this would mean roughly 5000 hives are necessary, which would not fit on a trailer.\n\nI would rather expect that on a truck with a maximum trailer length of 16-18m there would be ca. 500+ hives, averaging on ca. 25 million bees.\n\nIt's a horrible incident, but the reporter needs to get his facts straight, someone definitely messed this up big time.",
                "Flat country, looks like a straight, quiet two-lane road, no intersection, no other cars, how did his load end up sideways in the ditch?\n\nEdit: NYT photo suggests it was turning right and couldn't roll the front out far enough to miss the ditch with the rear wheels. That's why the tractor was in the left lane.",
                "Watch out! Incoming pollination!",
                "[removed]",
                "Thats like a quarter of a Beelion",
                "Someone call the Texas bee lady! \n\n\"And it was another great day of saving the beeeeeeez\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Georgia mayor and 2 others are jailed on felony charges for trying to halt a local election",
            "external_url": "https://apnews.com/article/mayor-indicted-georgia-election-camilla-14c6eb6938f53575325eb8b0445143b2",
            "upvotes": 2177,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                " > Mayor Kelvin M. Owens is a retired United States Marine with nearly 22 years of active duty service. He is a veteran of the Iraq War and served as a Department of Defense Contractor in Afghanistan. \n\nYou'd think a veteran would be more interested in maintaining the integrity of US elections.",
                "The frustrating things is that, they never try to challenge the central premise of the dude's disqualification.\n\nThe judges said that he wasn't a resident and non-residents can't be elected to that position. Never do the mayor or his associates try to say that no, he actually is a resident or that he isn't but local laws allow him to run anyway.\n\nThey're claims that it's racial bias don't hold weight if the dude is legitimately ineligible to hold office and they never try to argue he isn't.\n\nAnd, even if it was racial bias, they had to know that just halting an election was never going to fly. Like, what the fuck?!",
                "Honestly…while all the national politics shit is pretty crazy, it’s pretty difficult to find anything more crazy than local politics. People are insane — treating their 5,000 little communities as their personal fiefdoms and shit.",
                "Well, that sounds like a clusterfuck. Worse, it sounds really legally complicated, too; is it illegal to quit your job? What if you did it to try and force an illegal outcome? I don't envy whoever has to hear this case...",
                "This is in no way legally complicated.  They broke the law.  You can't do that shit.  Trying to defend them makes you look stupid at best",
                "Just wondering exactly what the mayor was supposed to do? The election officials resigned and they only postponed until a court appointed new supervisors. Were they supposed to let an unsupervised election continue?",
                "Hopefully these are state charges so if they’re convicted they can’t be pardoned by TACO man.",
                "In before the trump pardon",
                "I was just reading about the battle of Athens in the 1940s this morning, I thought- wow that's crazy! Cant believe that happened in the US. Seems like old habits die hard.",
                "Georgia and elections.... only if thr R's can have it their way."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Actor Valerie Mahaffey, 'Northern Exposure' Emmy winner, dies after cancer battle, publicist says",
            "external_url": "https://apnews.com/article/valerie-mahaffey-cancer-northern-exposure-1c0ed36a9baabbabdac1f403005563f6",
            "upvotes": 520,
            "date": "06/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She was a brilliant actress. I absolutely adored her on Northern Exposure. Rest in peace.",
                "She was so good in the show, unfortunately titled for the circumstances, Dead to Me. Pitch perfect rendition of the narcissistic mother. RIP",
                "Cancer sucks! Your own cells go haywire and destroy you. What a thing that should not be! Rest in peace.",
                "Costanza's accountant girlfriend, who called Seinfeld \"Jerome\"",
                "Ugh RIP",
                "She has all my tax papers! She’s not pretentious…  🥢",
                "I read her wiki since I didn’t know much about her. I was quietly hoping she was married to Adam Arkin.",
                "OMG, Eve. That's so sad."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump cuts threaten safety training for America’s most dangerous jobs",
            "external_url": "https://www.reuters.com/world/us/trump-cuts-threaten-safety-training-workers-americas-most-dangerous-jobs-2025-05-31/",
            "upvotes": 2098,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We all have to die ….   One of his flock has announced",
                "The rich don't want to do it and now they're getting rid of safety in these dangerous jobs and safety training The Rich are trying to kill us",
                "Every penny needs to be cut to pay for the unpayable 4 trillion tax cut for the rich.  So this is right on par for this administration.",
                "Hard to be a shittier American than a Trump supporter these days",
                "If Trump was a foreign enemy asset, what would he do differently?",
                "That is the point of the cuts",
                "ICE agents raiding construction sites seems like a safety violation, so this makes sense for protecting ICE agents raiding multi-level job sites.",
                "Is there anything that Trump does that doesn't threaten something?",
                "Fired 50% of NIOSH is the short of it",
                "I am beginning to believe that Trump’s golden age is the 1920s."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Detective assigned to NYC Mayor Eric Adams’ security detail allegedly dropped off victim in crypto kidnapping case, sources say",
            "external_url": "https://www.cnn.com/2025/05/29/us/eric-adams-nyc-crypto-kidnapping",
            "upvotes": 1687,
            "date": "05/31/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25147542531710.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“**Every city employee is expected to follow the law**, including our officers, both on and off duty. We are disturbed by these allegations, and as soon as it came to our attention, the officers were placed on modified duty,” Adams’ Press Secretary Kayla Mamelak Altus said in a statement.\n\nTell that to Adams",
                "Eric Adams in general should never see the outside of a prison cell ever again. The man is just a mess from head to toe",
                "I’m so sick and tired of all these corrupt assholes and their thugs collecting paychecks and greasing their grift instead of counting down the years inside a prison cell.",
                ">It is not clear if the detective had any knowledge or any role in the multiple assaults, officials said, adding that is a key question that investigators are trying to answer.\n\nI mean, he's a detective. Shouldn't he be the least bit inquisitive?",
                "We have a word for the guy who delivers the victim to the torture chamber: kidnapper. \n\n\nAn NYPD detective in the Mayor’s detail kidnapped a foreign national. The rot is unfathomable. The commissioner is a nepobaby with no law enforcement experience and she’s letting her employees moonlight for the mob.\n\nThe NYPD is pathetic.",
                "He should know if he's working for a crypto bro he's working for a criminal.",
                "Wow, this is shocking 🙄",
                "This is a batshit crazy story. Curious to know if Adams is connected somehow.",
                "Was Keyser Soze involved as well?",
                "Ask Frank Serpico what he thinks"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Homeland Security cops handcuff one of Rep. Nadler's aides in chaotic day at NY fed building",
            "external_url": "https://gothamist.com/news/homeland-security-cops-handcuff-one-of-rep-nadlers-aides-in-chaotic-day-at-ny-fed-building",
            "upvotes": 4971,
            "date": "05/31/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/351582/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "These people are out of control.",
                "Welcome to our new police state",
                "To clarify none of the aides was arrested in the end but this is still very worrying.\n\n\nEdit: Also apparently this happened on Wednesday but it is only being reported now.",
                "If Jerry does not have that officer arrested and charged with state crimes we're fucked.\n\nThe only way we get through this is if states challenge Trump",
                "How is this not getting more press ",
                "They’ll start arresting members of congress and federal judges soon.  This is just the warm up act.",
                "Welcome to the end of game of conservative politics. Straight up fucking fascism. Every single time.",
                "The 21st Century 4th Reich is in full swing. We now have black shirts instead of the brown shirts.",
                "Add the popo to the list of people who will be on trial for \"following orders.\"",
                "Jeezus this is the most ridiculous timeline \n\nBuckle up!  We got four more years of this insanity 😭"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Actor Valerie Mahaffey, 'Northern Exposure' Emmy winner, dies after cancer battle, publicist says",
            "external_url": "https://apnews.com/article/valerie-mahaffey-cancer-northern-exposure-1c0ed36a9baabbabdac1f403005563f6",
            "upvotes": 520,
            "date": "06/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She was a brilliant actress. I absolutely adored her on Northern Exposure. Rest in peace.",
                "She was so good in the show, unfortunately titled for the circumstances, Dead to Me. Pitch perfect rendition of the narcissistic mother. RIP",
                "Cancer sucks! Your own cells go haywire and destroy you. What a thing that should not be! Rest in peace.",
                "Costanza's accountant girlfriend, who called Seinfeld \"Jerome\"",
                "Ugh RIP",
                "She has all my tax papers! She’s not pretentious…  🥢",
                "I read her wiki since I didn’t know much about her. I was quietly hoping she was married to Adam Arkin.",
                "OMG, Eve. That's so sad."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Louisiana lawmakers push ‘chemtrail’ ban legislation through the House",
            "external_url": "https://www.kalb.com/2025/05/30/louisiana-lawmakers-push-chemtrail-ban-legislation-through-house/",
            "upvotes": 2845,
            "date": "06/01/2025",
            "thumbnail": "https://gray-kalb-prod.gtv-cdn.com/resizer/v2/4O4E5MLAUBFODOCKOXJPFREKMY.jpg?auth=b95937797a893a2718e09edcd7d8be2b2a1441ebbdad8c6f590feb6a59c3812c&width=1200&height=600&smart=true",
            "top_comments": [
                "Ok, chemtrails are banned.\n\nAny other pretend things we can ban instantly because they're not real?",
                "How, exactly, do they propose to enforce this?",
                "Next up: anti gang-stalking legislation.",
                "How have people gotten so goddamned stupid?",
                "So they gonna sue delta flight DL32 for 'chemtrails'? or arrest the pilots? why don't they just search the airports for the tanks that supposedly hold the chemicals they are supposed to be using to make chemtrails?",
                "Can we get a law to ban leprechauns too?",
                "Why do Americans like to fuck themselves in the ass?",
                "\"How billionaires distract the fools into never organizing as a class\"\n\nIt's up there with aliens and our government being a some super force that's all knowing. \"They'll kill you if you try\" makes people never try.",
                "Louisiana has some of the dumbest lawmakers in the country besides Texas.",
                "We are living in the dumbest fucking timeline.\n\n>During questioning on the House floor, State Rep. Candace Newell (D-New Orleans) asked about the chemicals Coates believes are involved.\n\n>“Other than the nanoparticles of aluminum, what else have you found?” Newell said.\n\n>“Barium. There is a few, some with long words that I can’t pronounce,” Coates said.  \n...\n\n>“Who is doing this?” asked State Rep. Matthew Willard (D-New Orleans).\n\n>“There are multiple people. Multiple groups, contractors,” Coates said.\n\n>“Who are the contracts with?” Willard asked.\n\n>“I’ve seen the documents with at least nine federal agencies,” Coates said.  \n...  \n“(Do you see them) once a week?” asked State Rep. C. Denise Marcelle (D-Baton Rouge).\n\n>“At least, yes—from my house all the way to the Capitol. So when you look up in the air, you look, watch for the big white lines across the sky,” Coates said.\n\nThis woman is legit unhinged."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White House to pull NASA nominee Isaacman",
            "external_url": "https://www.semafor.com/article/05/31/2025/white-house-expected-to-pull-nasa-nominee-isaacman",
            "upvotes": 2752,
            "date": "05/31/2025",
            "thumbnail": "https://img.semafor.com/f038821d54f49c923c01343a817fd75f382381b1-4788x3192.jpg?rect=0,339,4788,2514&w=1200&h=630&q=75&auto=format",
            "top_comments": [
                "Love this part, using Loomer as a source: \"Conservative personality Laura Loomer [suggested](https://x.com/LauraLoomer/status/1928849664905728223) on Saturday Isaacman’s nomination is in danger because of the nominee’s friendship with Elon Musk. Musk departed the administration this week.\"",
                "Wasn’t this the ONE nomination that was met with near-universal approval from both sides and NASA themselves? So of course they’re pulling his name now bc why not",
                "He’s was one of the few not insanely crazy nominees among a sea of crazy unqualified people filling up other positions.",
                "I think the Whitehouse decided he wasn't qualified enough. I mean he only has some prior fraud charges against him, but no convictions and no sexual assault allegations, what were they thinking?",
                "So is this going to be like last Trump administration where NASA didn't have an administrator for over a year?",
                "Marco Rubio will be named interim director",
                "he was allegedly pulled because he was found to have donated to democrats",
                "Next nominee will be Kid Rock or Kevin Sorbo because why the fuck not",
                "He heard about this before anyone else",
                "Let me guess; they're going to shut NASA down entirely and hand it's assets over to SpaceX?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Georgia mayor and 2 others are jailed on felony charges for trying to halt a local election",
            "external_url": "https://apnews.com/article/mayor-indicted-georgia-election-camilla-14c6eb6938f53575325eb8b0445143b2",
            "upvotes": 2185,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                " > Mayor Kelvin M. Owens is a retired United States Marine with nearly 22 years of active duty service. He is a veteran of the Iraq War and served as a Department of Defense Contractor in Afghanistan. \n\nYou'd think a veteran would be more interested in maintaining the integrity of US elections.",
                "The frustrating things is that, they never try to challenge the central premise of the dude's disqualification.\n\nThe judges said that he wasn't a resident and non-residents can't be elected to that position. Never do the mayor or his associates try to say that no, he actually is a resident or that he isn't but local laws allow him to run anyway.\n\nThey're claims that it's racial bias don't hold weight if the dude is legitimately ineligible to hold office and they never try to argue he isn't.\n\nAnd, even if it was racial bias, they had to know that just halting an election was never going to fly. Like, what the fuck?!",
                "Honestly…while all the national politics shit is pretty crazy, it’s pretty difficult to find anything more crazy than local politics. People are insane — treating their 5,000 little communities as their personal fiefdoms and shit.",
                "Well, that sounds like a clusterfuck. Worse, it sounds really legally complicated, too; is it illegal to quit your job? What if you did it to try and force an illegal outcome? I don't envy whoever has to hear this case...",
                "This is in no way legally complicated.  They broke the law.  You can't do that shit.  Trying to defend them makes you look stupid at best",
                "Just wondering exactly what the mayor was supposed to do? The election officials resigned and they only postponed until a court appointed new supervisors. Were they supposed to let an unsupervised election continue?",
                "Hopefully these are state charges so if they’re convicted they can’t be pardoned by TACO man.",
                "In before the trump pardon",
                "I was just reading about the battle of Athens in the 1940s this morning, I thought- wow that's crazy! Cant believe that happened in the US. Seems like old habits die hard.",
                "Georgia and elections.... only if thr R's can have it their way."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FBI leaders say jail video shows Jeffery Epstein died by sucide",
            "external_url": "https://www.nbcnews.com/politics/justice-department/dan-bongino-kash-patel-jeffrey-epstein-rcna209871",
            "upvotes": 13257,
            "date": "05/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-jeffrey-epstein-list-wm-311p-b8d586.jpg",
            "top_comments": [
                "Soooo, the cameras WERE on after all?",
                "Did they blur out the suicider?",
                "\"Deputy FBI Director Dan Bongino, a former pro-Trump podcaster\"\n\nWTF kinda country do I live in?",
                "It took this long to release the footage because they had to wait for AI to develop to this point.",
                "You mean the video from the cameras that were supposedly malfunctioning and not working as guards slept and not doing their rounds or checking on inmates on suicide watch?\n\nThose cameras?",
                "Does it say it on his knuckles?",
                "The fact it's Trump's FBI saying it, years after it happened, is arguably the strongest evidence yet that it was murder.",
                "I do not believe a word from the FBI under the current administration.",
                "The original report was that the cameras were down, at least I remember that was the case. How do they have video footage if the cameras weren’t working?",
                "They waited until Ai generated video looks indistinguishable from real footage… but ok"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sudan: Several killed in RSF strike on hospital",
            "external_url": "https://www.dw.com/en/sudan-several-killed-in-rsf-strike-on-hospital/a-72738964",
            "upvotes": 275,
            "date": "05/31/2025",
            "thumbnail": "https://static.dw.com/image/72736027_6.jpg",
            "top_comments": [
                "War has ravaged Sudan, stop it because we deserve peace.",
                "This demonic entity must be stopped. How can we, as a collective, allow this evil to happen?",
                "[removed]",
                "It seems as if every single time a war crime happens in Sudan, it's the RSF. Is this a propaganda bubble, or are they really *that evil?*"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump cuts threaten safety training for America’s most dangerous jobs",
            "external_url": "https://www.reuters.com/world/us/trump-cuts-threaten-safety-training-workers-americas-most-dangerous-jobs-2025-05-31/",
            "upvotes": 2090,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We all have to die ….   One of his flock has announced",
                "The rich don't want to do it and now they're getting rid of safety in these dangerous jobs and safety training The Rich are trying to kill us",
                "Every penny needs to be cut to pay for the unpayable 4 trillion tax cut for the rich.  So this is right on par for this administration.",
                "Hard to be a shittier American than a Trump supporter these days",
                "If Trump was a foreign enemy asset, what would he do differently?",
                "That is the point of the cuts",
                "ICE agents raiding construction sites seems like a safety violation, so this makes sense for protecting ICE agents raiding multi-level job sites.",
                "Is there anything that Trump does that doesn't threaten something?",
                "Fired 50% of NIOSH is the short of it",
                "I am beginning to believe that Trump’s golden age is the 1920s."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Detective assigned to NYC Mayor Eric Adams’ security detail allegedly dropped off victim in crypto kidnapping case, sources say",
            "external_url": "https://www.cnn.com/2025/05/29/us/eric-adams-nyc-crypto-kidnapping",
            "upvotes": 1691,
            "date": "05/31/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25147542531710.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“**Every city employee is expected to follow the law**, including our officers, both on and off duty. We are disturbed by these allegations, and as soon as it came to our attention, the officers were placed on modified duty,” Adams’ Press Secretary Kayla Mamelak Altus said in a statement.\n\nTell that to Adams",
                "Eric Adams in general should never see the outside of a prison cell ever again. The man is just a mess from head to toe",
                "I’m so sick and tired of all these corrupt assholes and their thugs collecting paychecks and greasing their grift instead of counting down the years inside a prison cell.",
                ">It is not clear if the detective had any knowledge or any role in the multiple assaults, officials said, adding that is a key question that investigators are trying to answer.\n\nI mean, he's a detective. Shouldn't he be the least bit inquisitive?",
                "We have a word for the guy who delivers the victim to the torture chamber: kidnapper. \n\n\nAn NYPD detective in the Mayor’s detail kidnapped a foreign national. The rot is unfathomable. The commissioner is a nepobaby with no law enforcement experience and she’s letting her employees moonlight for the mob.\n\nThe NYPD is pathetic.",
                "He should know if he's working for a crypto bro he's working for a criminal.",
                "Wow, this is shocking 🙄",
                "This is a batshit crazy story. Curious to know if Adams is connected somehow.",
                "Was Keyser Soze involved as well?",
                "Ask Frank Serpico what he thinks"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Business Insider goes 'all-in on AI,' laying off 21% of staff",
            "external_url": "https://www.sfgate.com/bayarea/article/business-insider-ai-laying-off-staff-20353086.php",
            "upvotes": 10967,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Business Insider was already nothing but superficial and low-effort articles.  It won't be hard for AI to replicate the quality of work they've been putting out.",
                "It's 2043. There are 5 CEOs and no one else has a job. AI news sites report news about AI and how AI is AI, is AI.",
                "Every time I read one of these stories, I'm reminded of the early DOGE reports of firing people only to have to re-hire them within weeks once they figure out what the people they fired were actually doing.",
                "If I was to guess who would go “all-in on AI” I would guess them or Forbes. Both publications have half-baked douchey writing.",
                "The Enshittification continues",
                "This is so wildly short-sighted.",
                "I thought it was already all AI, given the quality.",
                "Now I know not to bother to read anything from Business Insider, it'll just be AI mash.",
                "I like it when companies telegraph to their readers that from this point onwards, their reporting will be unreliable and include hallucinating bots.",
                "Going forward, I'll be downvoting all links to Business Insider."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Warning after 250 million bees escape overturned truck in US",
            "external_url": "https://www.bbc.co.uk/news/articles/c23mrprk952o",
            "upvotes": 10409,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/afdf/live/ca544700-3dd3-11f0-8853-41527df633df.jpg",
            "top_comments": [
                "This is a real tragedy. These trucks take bees from thousands of keepers down to California for events like almond plant pollination. If they can’t clean it up in a way that gives the bees time to find their own queens among the wreckage, almost all of them are doomed. And it’ll be a total loss for the farmers, pending insurance. California farmers need to find more bees or not get pollinated, Washington farmers need to replace the bees they’ve raised. Local region gets a bunch of stressed out honeybees with nowhere to go. It’ll take some really careful mitigation to recover it all, on top of handling the accident and the surrounding humanity. \n\nAlso, ridiculous that our farming infrastructure requires bee imports for pollination. How about boost the habitat around the farms and cut down on the monoculture crops? All the highways and stormwater ditches should be no-mow in the dry summer. Retain moisture in the vegetation and give a wildlife coordinator to connect habitat fragments and boost pollination. And save on public works maintenance costs. The problem for these bees is that there are no flowers most of the summer, and then a mega monoculture blooms and expects there to be billions of bees and butterflies to support it. But also here’s neurological pesticides like neonics to kill the “bad bugs.” You reap what you sow. ",
                "there are roughly 30,000 bees in a hive at this time of year.\n\n33 hives to reach a million.\n\n250x33 is 8250 hive boxes.\n\na Langstroth hive is roughly 20x16x12 inches.  So you'd get 6 on a standard pallet layer, maybe 3 layers preparatory for doublestacking.. that's 458 pallets.\n\nI think the deputy making the announcement was off by a factor of 4 to 5.  Still a terrifying event, though.",
                "I’m surprised that 250 million bees is only one truckload",
                "True story.   \nI had 2 hives in my back yard for a few years and we had to move. So we waited until it was dark (so all the bees are in the hives, we closed it up and put them in the back of my enclosed SUV. We were driving them about an hour and a half away to their new home. So in the middle of the drive, around midnight we noticed a bee flying around in the front of the car. Then another... so we stopped at a gas station, popped the back open and the bees were bearding on the outside of one of the hives. LOTS of them. So, luckily we had our trusty suits with us and we put them on at the gas station, just as a fire truck pulls up. \n\n\"You alright?\" The fireman asks us. \n\n\"Yea, the bees just got out.\" I respond back. \n\n\"Oh.\" he pauses for a good 3 seconds..\"Good luck with that.\" he says, then he puts the fire truck in gear and drives out.\n\nI guess we looked silly (or sus) putting on beekeeping suits at a gas station, at midnight, in an urban area. Anyway, we then got back in the car, cranked the AC to max to keep the bees cool so that they don't get angy. In the end we succeeded in rehoming the hives without too much of an issue. (we were able to move the hive with the bees all over the outside.)",
                "As a beekeeper myself I highly doubt the number of 250 million is accurate. Someone probably added a zero too many\n\nIn the peek of the season a hive contains 50.000 to 60.000 bees.\n\nWith the US Langstroth hives of 54 x 46? cm this would mean roughly 5000 hives are necessary, which would not fit on a trailer.\n\nI would rather expect that on a truck with a maximum trailer length of 16-18m there would be ca. 500+ hives, averaging on ca. 25 million bees.\n\nIt's a horrible incident, but the reporter needs to get his facts straight, someone definitely messed this up big time.",
                "Flat country, looks like a straight, quiet two-lane road, no intersection, no other cars, how did his load end up sideways in the ditch?\n\nEdit: NYT photo suggests it was turning right and couldn't roll the front out far enough to miss the ditch with the rear wheels. That's why the tractor was in the left lane.",
                "Watch out! Incoming pollination!",
                "[removed]",
                "Thats like a quarter of a Beelion",
                "Someone call the Texas bee lady! \n\n\"And it was another great day of saving the beeeeeeez\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Actor Valerie Mahaffey, 'Northern Exposure' Emmy winner, dies after cancer battle, publicist says",
            "external_url": "https://apnews.com/article/valerie-mahaffey-cancer-northern-exposure-1c0ed36a9baabbabdac1f403005563f6",
            "upvotes": 520,
            "date": "06/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She was a brilliant actress. I absolutely adored her on Northern Exposure. Rest in peace.",
                "She was so good in the show, unfortunately titled for the circumstances, Dead to Me. Pitch perfect rendition of the narcissistic mother. RIP",
                "Cancer sucks! Your own cells go haywire and destroy you. What a thing that should not be! Rest in peace.",
                "Costanza's accountant girlfriend, who called Seinfeld \"Jerome\"",
                "Ugh RIP",
                "She has all my tax papers! She’s not pretentious…  🥢",
                "I read her wiki since I didn’t know much about her. I was quietly hoping she was married to Adam Arkin.",
                "OMG, Eve. That's so sad."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Louisiana lawmakers push ‘chemtrail’ ban legislation through the House",
            "external_url": "https://www.kalb.com/2025/05/30/louisiana-lawmakers-push-chemtrail-ban-legislation-through-house/",
            "upvotes": 2849,
            "date": "06/01/2025",
            "thumbnail": "https://gray-kalb-prod.gtv-cdn.com/resizer/v2/4O4E5MLAUBFODOCKOXJPFREKMY.jpg?auth=b95937797a893a2718e09edcd7d8be2b2a1441ebbdad8c6f590feb6a59c3812c&width=1200&height=600&smart=true",
            "top_comments": [
                "Ok, chemtrails are banned.\n\nAny other pretend things we can ban instantly because they're not real?",
                "How, exactly, do they propose to enforce this?",
                "Next up: anti gang-stalking legislation.",
                "How have people gotten so goddamned stupid?",
                "So they gonna sue delta flight DL32 for 'chemtrails'? or arrest the pilots? why don't they just search the airports for the tanks that supposedly hold the chemicals they are supposed to be using to make chemtrails?",
                "Can we get a law to ban leprechauns too?",
                "Why do Americans like to fuck themselves in the ass?",
                "\"How billionaires distract the fools into never organizing as a class\"\n\nIt's up there with aliens and our government being a some super force that's all knowing. \"They'll kill you if you try\" makes people never try.",
                "Louisiana has some of the dumbest lawmakers in the country besides Texas.",
                "We are living in the dumbest fucking timeline.\n\n>During questioning on the House floor, State Rep. Candace Newell (D-New Orleans) asked about the chemicals Coates believes are involved.\n\n>“Other than the nanoparticles of aluminum, what else have you found?” Newell said.\n\n>“Barium. There is a few, some with long words that I can’t pronounce,” Coates said.  \n...\n\n>“Who is doing this?” asked State Rep. Matthew Willard (D-New Orleans).\n\n>“There are multiple people. Multiple groups, contractors,” Coates said.\n\n>“Who are the contracts with?” Willard asked.\n\n>“I’ve seen the documents with at least nine federal agencies,” Coates said.  \n...  \n“(Do you see them) once a week?” asked State Rep. C. Denise Marcelle (D-Baton Rouge).\n\n>“At least, yes—from my house all the way to the Capitol. So when you look up in the air, you look, watch for the big white lines across the sky,” Coates said.\n\nThis woman is legit unhinged."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Georgia mayor and 2 others are jailed on felony charges for trying to halt a local election",
            "external_url": "https://apnews.com/article/mayor-indicted-georgia-election-camilla-14c6eb6938f53575325eb8b0445143b2",
            "upvotes": 2182,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                " > Mayor Kelvin M. Owens is a retired United States Marine with nearly 22 years of active duty service. He is a veteran of the Iraq War and served as a Department of Defense Contractor in Afghanistan. \n\nYou'd think a veteran would be more interested in maintaining the integrity of US elections.",
                "The frustrating things is that, they never try to challenge the central premise of the dude's disqualification.\n\nThe judges said that he wasn't a resident and non-residents can't be elected to that position. Never do the mayor or his associates try to say that no, he actually is a resident or that he isn't but local laws allow him to run anyway.\n\nThey're claims that it's racial bias don't hold weight if the dude is legitimately ineligible to hold office and they never try to argue he isn't.\n\nAnd, even if it was racial bias, they had to know that just halting an election was never going to fly. Like, what the fuck?!",
                "Honestly…while all the national politics shit is pretty crazy, it’s pretty difficult to find anything more crazy than local politics. People are insane — treating their 5,000 little communities as their personal fiefdoms and shit.",
                "Well, that sounds like a clusterfuck. Worse, it sounds really legally complicated, too; is it illegal to quit your job? What if you did it to try and force an illegal outcome? I don't envy whoever has to hear this case...",
                "This is in no way legally complicated.  They broke the law.  You can't do that shit.  Trying to defend them makes you look stupid at best",
                "Just wondering exactly what the mayor was supposed to do? The election officials resigned and they only postponed until a court appointed new supervisors. Were they supposed to let an unsupervised election continue?",
                "Hopefully these are state charges so if they’re convicted they can’t be pardoned by TACO man.",
                "In before the trump pardon",
                "I was just reading about the battle of Athens in the 1940s this morning, I thought- wow that's crazy! Cant believe that happened in the US. Seems like old habits die hard.",
                "Georgia and elections.... only if thr R's can have it their way."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump cuts threaten safety training for America’s most dangerous jobs",
            "external_url": "https://www.reuters.com/world/us/trump-cuts-threaten-safety-training-workers-americas-most-dangerous-jobs-2025-05-31/",
            "upvotes": 2096,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We all have to die ….   One of his flock has announced",
                "The rich don't want to do it and now they're getting rid of safety in these dangerous jobs and safety training The Rich are trying to kill us",
                "Every penny needs to be cut to pay for the unpayable 4 trillion tax cut for the rich.  So this is right on par for this administration.",
                "Hard to be a shittier American than a Trump supporter these days",
                "If Trump was a foreign enemy asset, what would he do differently?",
                "That is the point of the cuts",
                "ICE agents raiding construction sites seems like a safety violation, so this makes sense for protecting ICE agents raiding multi-level job sites.",
                "Is there anything that Trump does that doesn't threaten something?",
                "Fired 50% of NIOSH is the short of it",
                "I am beginning to believe that Trump’s golden age is the 1920s."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "White House to pull NASA nominee Isaacman",
            "external_url": "https://www.semafor.com/article/05/31/2025/white-house-expected-to-pull-nasa-nominee-isaacman",
            "upvotes": 2753,
            "date": "05/31/2025",
            "thumbnail": "https://img.semafor.com/f038821d54f49c923c01343a817fd75f382381b1-4788x3192.jpg?rect=0,339,4788,2514&w=1200&h=630&q=75&auto=format",
            "top_comments": [
                "Love this part, using Loomer as a source: \"Conservative personality Laura Loomer [suggested](https://x.com/LauraLoomer/status/1928849664905728223) on Saturday Isaacman’s nomination is in danger because of the nominee’s friendship with Elon Musk. Musk departed the administration this week.\"",
                "Wasn’t this the ONE nomination that was met with near-universal approval from both sides and NASA themselves? So of course they’re pulling his name now bc why not",
                "He’s was one of the few not insanely crazy nominees among a sea of crazy unqualified people filling up other positions.",
                "I think the Whitehouse decided he wasn't qualified enough. I mean he only has some prior fraud charges against him, but no convictions and no sexual assault allegations, what were they thinking?",
                "So is this going to be like last Trump administration where NASA didn't have an administrator for over a year?",
                "Marco Rubio will be named interim director",
                "he was allegedly pulled because he was found to have donated to democrats",
                "Next nominee will be Kid Rock or Kevin Sorbo because why the fuck not",
                "He heard about this before anyone else",
                "Let me guess; they're going to shut NASA down entirely and hand it's assets over to SpaceX?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Detective assigned to NYC Mayor Eric Adams’ security detail allegedly dropped off victim in crypto kidnapping case, sources say",
            "external_url": "https://www.cnn.com/2025/05/29/us/eric-adams-nyc-crypto-kidnapping",
            "upvotes": 1685,
            "date": "05/31/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25147542531710.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“**Every city employee is expected to follow the law**, including our officers, both on and off duty. We are disturbed by these allegations, and as soon as it came to our attention, the officers were placed on modified duty,” Adams’ Press Secretary Kayla Mamelak Altus said in a statement.\n\nTell that to Adams",
                "Eric Adams in general should never see the outside of a prison cell ever again. The man is just a mess from head to toe",
                "I’m so sick and tired of all these corrupt assholes and their thugs collecting paychecks and greasing their grift instead of counting down the years inside a prison cell.",
                ">It is not clear if the detective had any knowledge or any role in the multiple assaults, officials said, adding that is a key question that investigators are trying to answer.\n\nI mean, he's a detective. Shouldn't he be the least bit inquisitive?",
                "We have a word for the guy who delivers the victim to the torture chamber: kidnapper. \n\n\nAn NYPD detective in the Mayor’s detail kidnapped a foreign national. The rot is unfathomable. The commissioner is a nepobaby with no law enforcement experience and she’s letting her employees moonlight for the mob.\n\nThe NYPD is pathetic.",
                "He should know if he's working for a crypto bro he's working for a criminal.",
                "Wow, this is shocking 🙄",
                "This is a batshit crazy story. Curious to know if Adams is connected somehow.",
                "Was Keyser Soze involved as well?",
                "Ask Frank Serpico what he thinks"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Business Insider goes 'all-in on AI,' laying off 21% of staff",
            "external_url": "https://www.sfgate.com/bayarea/article/business-insider-ai-laying-off-staff-20353086.php",
            "upvotes": 10977,
            "date": "05/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Business Insider was already nothing but superficial and low-effort articles.  It won't be hard for AI to replicate the quality of work they've been putting out.",
                "It's 2043. There are 5 CEOs and no one else has a job. AI news sites report news about AI and how AI is AI, is AI.",
                "Every time I read one of these stories, I'm reminded of the early DOGE reports of firing people only to have to re-hire them within weeks once they figure out what the people they fired were actually doing.",
                "If I was to guess who would go “all-in on AI” I would guess them or Forbes. Both publications have half-baked douchey writing.",
                "The Enshittification continues",
                "This is so wildly short-sighted.",
                "I thought it was already all AI, given the quality.",
                "Now I know not to bother to read anything from Business Insider, it'll just be AI mash.",
                "I like it when companies telegraph to their readers that from this point onwards, their reporting will be unreliable and include hallucinating bots.",
                "Going forward, I'll be downvoting all links to Business Insider."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Sudan: Several killed in RSF strike on hospital",
            "external_url": "https://www.dw.com/en/sudan-several-killed-in-rsf-strike-on-hospital/a-72738964",
            "upvotes": 279,
            "date": "05/31/2025",
            "thumbnail": "https://static.dw.com/image/72736027_6.jpg",
            "top_comments": [
                "War has ravaged Sudan, stop it because we deserve peace.",
                "This demonic entity must be stopped. How can we, as a collective, allow this evil to happen?",
                "[removed]",
                "It seems as if every single time a war crime happens in Sudan, it's the RSF. Is this a propaganda bubble, or are they really *that evil?*"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FBI leaders say jail video shows Jeffery Epstein died by sucide",
            "external_url": "https://www.nbcnews.com/politics/justice-department/dan-bongino-kash-patel-jeffrey-epstein-rcna209871",
            "upvotes": 13264,
            "date": "05/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-jeffrey-epstein-list-wm-311p-b8d586.jpg",
            "top_comments": [
                "Soooo, the cameras WERE on after all?",
                "Did they blur out the suicider?",
                "\"Deputy FBI Director Dan Bongino, a former pro-Trump podcaster\"\n\nWTF kinda country do I live in?",
                "It took this long to release the footage because they had to wait for AI to develop to this point.",
                "You mean the video from the cameras that were supposedly malfunctioning and not working as guards slept and not doing their rounds or checking on inmates on suicide watch?\n\nThose cameras?",
                "Does it say it on his knuckles?",
                "The fact it's Trump's FBI saying it, years after it happened, is arguably the strongest evidence yet that it was murder.",
                "I do not believe a word from the FBI under the current administration.",
                "The original report was that the cameras were down, at least I remember that was the case. How do they have video footage if the cameras weren’t working?",
                "They waited until Ai generated video looks indistinguishable from real footage… but ok"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Warning after 250 million bees escape overturned truck in US",
            "external_url": "https://www.bbc.co.uk/news/articles/c23mrprk952o",
            "upvotes": 10415,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/afdf/live/ca544700-3dd3-11f0-8853-41527df633df.jpg",
            "top_comments": [
                "This is a real tragedy. These trucks take bees from thousands of keepers down to California for events like almond plant pollination. If they can’t clean it up in a way that gives the bees time to find their own queens among the wreckage, almost all of them are doomed. And it’ll be a total loss for the farmers, pending insurance. California farmers need to find more bees or not get pollinated, Washington farmers need to replace the bees they’ve raised. Local region gets a bunch of stressed out honeybees with nowhere to go. It’ll take some really careful mitigation to recover it all, on top of handling the accident and the surrounding humanity. \n\nAlso, ridiculous that our farming infrastructure requires bee imports for pollination. How about boost the habitat around the farms and cut down on the monoculture crops? All the highways and stormwater ditches should be no-mow in the dry summer. Retain moisture in the vegetation and give a wildlife coordinator to connect habitat fragments and boost pollination. And save on public works maintenance costs. The problem for these bees is that there are no flowers most of the summer, and then a mega monoculture blooms and expects there to be billions of bees and butterflies to support it. But also here’s neurological pesticides like neonics to kill the “bad bugs.” You reap what you sow. ",
                "there are roughly 30,000 bees in a hive at this time of year.\n\n33 hives to reach a million.\n\n250x33 is 8250 hive boxes.\n\na Langstroth hive is roughly 20x16x12 inches.  So you'd get 6 on a standard pallet layer, maybe 3 layers preparatory for doublestacking.. that's 458 pallets.\n\nI think the deputy making the announcement was off by a factor of 4 to 5.  Still a terrifying event, though.",
                "I’m surprised that 250 million bees is only one truckload",
                "True story.   \nI had 2 hives in my back yard for a few years and we had to move. So we waited until it was dark (so all the bees are in the hives, we closed it up and put them in the back of my enclosed SUV. We were driving them about an hour and a half away to their new home. So in the middle of the drive, around midnight we noticed a bee flying around in the front of the car. Then another... so we stopped at a gas station, popped the back open and the bees were bearding on the outside of one of the hives. LOTS of them. So, luckily we had our trusty suits with us and we put them on at the gas station, just as a fire truck pulls up. \n\n\"You alright?\" The fireman asks us. \n\n\"Yea, the bees just got out.\" I respond back. \n\n\"Oh.\" he pauses for a good 3 seconds..\"Good luck with that.\" he says, then he puts the fire truck in gear and drives out.\n\nI guess we looked silly (or sus) putting on beekeeping suits at a gas station, at midnight, in an urban area. Anyway, we then got back in the car, cranked the AC to max to keep the bees cool so that they don't get angy. In the end we succeeded in rehoming the hives without too much of an issue. (we were able to move the hive with the bees all over the outside.)",
                "As a beekeeper myself I highly doubt the number of 250 million is accurate. Someone probably added a zero too many\n\nIn the peek of the season a hive contains 50.000 to 60.000 bees.\n\nWith the US Langstroth hives of 54 x 46? cm this would mean roughly 5000 hives are necessary, which would not fit on a trailer.\n\nI would rather expect that on a truck with a maximum trailer length of 16-18m there would be ca. 500+ hives, averaging on ca. 25 million bees.\n\nIt's a horrible incident, but the reporter needs to get his facts straight, someone definitely messed this up big time.",
                "Flat country, looks like a straight, quiet two-lane road, no intersection, no other cars, how did his load end up sideways in the ditch?\n\nEdit: NYT photo suggests it was turning right and couldn't roll the front out far enough to miss the ditch with the rear wheels. That's why the tractor was in the left lane.",
                "Watch out! Incoming pollination!",
                "[removed]",
                "Thats like a quarter of a Beelion",
                "Someone call the Texas bee lady! \n\n\"And it was another great day of saving the beeeeeeez\""
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "06/01/2025 04:25:53 UTC"
}