{
    "posts": [
        {
            "category": "HOT",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 9161,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                "[removed]",
                "Jamie Whites murder was a hoax by the deep state. He and the other people involved are just crisis actors. Let's make a buncha podcasts making millions off arguing this and just insist Alex Jones is crazy.\n\nGive him a taste of his own.",
                "[removed]",
                "Nah probably a crisis actor this never happened",
                "I guess he lost the info war",
                "I am fortunate enough to never have heard of this person.",
                "It's his fault he got shot. If he didn't want to get shot, he shouldn't have been dressed like that. His body had a way of shutting down that bullet. Totally the victims fault.",
                "I see were using the term \"journalist\" real, real loosely here. \n\n\nAnyway, tots and pears I guess. Best I can do.  "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 53728,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "And we're only 2 months in.",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "I knew it was the right choice to not give up Mexican citizenship. Plus being Mexican is awesome.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "You MAGA heads proud of what trumpz has done to America so far? Feeling good about being a laughing stock on the world stage? Feeling good losing your rights to free speach and the right to protest? Feeling good about the economy? Guy is pathetic and worse he is a traitor to what makes America and previous American Presidents great."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Southwest Airlines shifts to paid baggage policy to lift earnings",
            "external_url": "https://www.reuters.com/business/aerospace-defense/southwest-airlines-shifts-paid-baggage-policy-lift-earnings-2025-03-11/",
            "upvotes": 795,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "To lift earnings we are eliminating the competitive advantage that brings people to our airline.",
                "> The policy shift suggests a growing influence of activist investor Elliott Investment Management at the airline. The hedge fund, whose nominees hold five of 15 board seats, had criticized Southwest's leadership for not charging a fee for checking bags like other airlines to boost its revenue.\n\nMotherfucking hedge funds, leeching off of society while generating nothing of real value for us.",
                "In the email they sent announcing this, they rolled out multiple anti-passenger changes at the same time:\n\n* Paid checked bags\n* Flight credit expiration\n* Lower earn ratio on rapid reward points\n* No more free changes on Basic (though oddly you can still cancel and get a flight credit, so the key difference here is inconvenience)\n\nI'm going to bet the checked bags portion of this was the preplanned \"we heard you\" piece that can be easily carved out while they keep all the rest of the changes. Then they'll reintroduce the checked bag change later and there won't be nearly as much furor as the outrage was already spent once on this issue.\n\nMy company flies exclusively Southwest. I've taken hundreds of legs with them. I suspect that will change now.",
                "SW will file bankruptcy and/or be acquired within the next 10 years.",
                "Time to cancel that Southwest Rapid Rewards VISA",
                "As someone who has flown Southwest many times, I’ll repeat a comment I made in an earlier thread: Herb Kelleher is twirling in his grave with how this investment group is destroying his airline. Fuck these people.",
                "Southwest Fares for me were usually around the same price or slightly more expensive than Delta/United/American etc.. but when you added in a free checked bag for a round trip flight they often ended up cheaper. \n\nIf they go to a $35+ baggage fee I will have zero reason to fly on Southwest ever again unless their flight prices come down (which I doubt).",
                "South West shifts to never getting my business again",
                "\"Our business is failing because of poor management and terrible decisions. What can we do to attract more customers?\"\n\n\\[slience\\]\n\n\"What if instead of attracting more customers, we just bled the ones we have for more money, making everything worse for everyone?\"\n\nGREAT IDEA SIR!",
                "As an employee this makes me incredibly sad"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Seven men arrested in Japan for raping daughters, sharing footage in chat group.",
            "external_url": "https://www.straitstimes.com/asia/east-asia/seven-men-arrested-in-japan-for-raping-daughters-sharing-footage-in-chat-group",
            "upvotes": 583,
            "date": "03/11/2025",
            "thumbnail": "https://cassette.sphdigital.com.sg/image/straitstimes/cbb298abcce5ca7335e17c5dc6540bd83acce49d9a88a567e58400a2045ea275",
            "top_comments": [
                "These guys raped their own daughters regularly, youngest girl was six years old.  \nFilmed it and then circulate/share within their own chat group with other men/fathers.   \nHow muthaf\\*\\*king sick can one be to come up with such stuff!",
                "adblocker blocks the whole entire website. like, nothing at all shows up and the block counter just goes and goes",
                "Just looked at the charges for stuff like this in Japan and got pissed off at how light of a sentence they could get",
                "\"Seven men arrested in Japan for raping daughters, sharing footage in chat group\nThe seven were in the same chat group for incest and paedophilia.\nThe seven were in the same chat group for incest and paedophilia.PHOTO: LIANHE ZAOBAO\nUPDATED Mar 11, 2025, 08:21 PM\n\n\nPolice from Aichi Prefecture in Japan have arrested seven men as of March 11 on suspicion of raping their daughters or stepdaughters and sharing footage of the abuse on social media, reported the Mainichi Shimbun.\n\n\nThe men are in their 30s to 50s.\n\n\nThey are accused of penetrative sexual assault, and violations of anti-child prostitution and anti-child pornography laws, reported the Japanese newspaper.\n\n\n\n\nFour of the men allegedly violated their biological or foster daughters and sent videos of the abuse in a social media group.\n\n\nThe victims were between six and 14 years old at the time.\n\n\nThe other three men allegedly owned obscene images of minors.\n\n\n\n\nThe seven were in the same chat group for incest and paedophilia, and the Aichi police believe they sexually abused their daughters and other children regularly.\n\n\nThey were discovered after one of the men was arrested in November 2024 for suspected penetrative sexual assault of a minor, and a probe of his mobile phone revealed the group were sharing explicit videos.\n\n\nThe group is thought to have started exchanging information around December 2023, reported Mainichi Shimbun.\"",
                "Investigative sources revealed that the seven men, aged in their 30s to 50s and living in Aichi Prefecture and elsewhere, stand accused of penetrative sexual assault as well as violations of anti-child prostitution and anti-child pornography laws. Four of the men allegedly filmed the scenes of them sexually assaulting their biological or foster daughters, aged between 6 and 14 at the time, and shared the footage within a social media group, while the other three owned obscene images of underage individuals.\n\nIn the messaging app used by the group, there were comments reading, \"I've trained her since she was 3,\" \"Just telling her, 'If you tell your mom, you wouldn't be able to be with your dad. Can you keep a secret?' worked for me,\" and, \"Because my wife is away on a trip.\" The prefectural police believe that the men continued to sexually abuse their own daughters and others on a regular basis.\n\nIn November last year, one of the men was arrested on suspicion of penetrative sexual assault of an underage person, and a probe of his mobile phone revealed that the group was sharing obscene videos.\n\nIt is thought that the group, comprised of men fond of incest with minors, started exchanging information in around December 2023. The seven suspects came to know each other through another online website, and one of them managed the chat group in question. The police suspect that several other men had joined the group, and are continuing to investigate the case.",
                "They need their thing to be chopped off!",
                "Horrific!\n\n Japan had a real problem for a long time with schoolgirls being abused by older guys - framed almost as if they were “dating” them. Like some kind of normal consenting “sugar daddy” relationship- but obviously with minors\n\nIt was a VERY common (if not necessarily ok) thing to be happening. Not an unusual / rare thing.  \n \nThis was a decade ago I read about it. I’ve no idea if it’s still as common. I think the government were trying to do something about it. \n\nI hope they succeeded .",
                "May they all die very slow, very painful deaths.",
                "I cannot even imagine the lifetime of trauma these girls will battle. They deserve the best care and support for the rest of their lives.  I'm not sure what kind of sentencing the Japanese legal system has, but I hope these men rot in prison. I hope every day until the end of their days is full of misery.",
                "Glad they caught them, if it were the U.S. they'd be running for public office as Republicans."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Moscow airports suspend flights after ‘massive’ Ukrainian drone attack",
            "external_url": "https://www.theguardian.com/world/2025/mar/11/moscow-airports-suspend-flights-after-massive-ukrainian-drone-attack",
            "upvotes": 2083,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1ecdcfb1374f87704afac6b6e5567b26715df9de/0_175_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=693fad69bc0bf93d7d0feb0082b77a57",
            "top_comments": [
                "If i remember one of hold outs preventing Ukraine from doing this before was the US as part of arms deal. Might be wrong",
                "Wonderful news! Keep up the fight and defeat putin and his asset, the traitorous felon krasnov.",
                "Well, it's what anyone would do!",
                "As far as I'm concerned, Russia was attacking the apartments and hospitals first. Why would that be a surprise?",
                "Good, some of their own medicine.",
                "I love a positive news story like this. \n\nKeep it up.",
                "This is not a good week for Elon and friends.",
                "Russia still has planes?",
                "[removed]",
                "Russia attacked itself again. Wake up"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "New York fires 2,000 prison guards, declares strike over",
            "external_url": "https://www.cbsnews.com/newyork/news/new-yorks-prison-strike-poised-to-end-monday/",
            "upvotes": 1216,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/03/60609003-572c-4d8b-9f73-987802bcfc0c/thumbnail/1200x630/d42a6c315c0444cfb5330c6c71fc87bf/ap25058732974698.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Nothing like having disgruntled employees watching over felons. Surely this is a recipe for good things only.",
                "Work condition just got worse now with 2000 less guards = More mandatory overtimes.",
                "Does anyone have any info on why these 2000 guards held out? The article says a deal was struck, but these were the hold outs and fired because of it.",
                "To be clear, these prison guards went on strike because of a law put in place over solitary confinement.",
                "This has Trump disillusionment vibes",
                "Ss: DOCCS said no penalties were waived as part of the agreement.",
                "Naw screw those prison guards, striking over being mad they can't just send people to solitary confinement willy nilly.",
                "For those unfamiliar as to why they're striking, the cause was their deep anger that their coworkers didn't get away with beating an inmate to death. Like they were used to. They are upset about having to wear body camera, which would make them more accountable for the rapes, beatings and murders they have gotten away with for generations. \n\nIt's a dangerous job for sure and we need a lot more guards than we have, but we need to smash their culture and mindset with a hammer.\n\n[6 Corrections Officers Charged With Murder in New York Inmate’s Death](https://www.nytimes.com/2025/02/20/nyregion/robert-brooks-corrections-officers-charged-murder.html?smid=nytcore-android-share)",
                "corp dems like Hochul are just as bad as any republican when it comes to workers' rights",
                "Maybe they should stop being corrupt and murdering inmates? "
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Stocks fall as Trump warns of US economy trade war 'transition'",
            "external_url": "https://www.bbc.co.uk/news/articles/cz61nn99eg1o",
            "upvotes": 46813,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d16/live/091cf470-fdc2-11ef-8869-3b46261c581e.jpg",
            "top_comments": [
                "Tesla down 15% today alone is crazy. Wipes out every gain they made from November.",
                "President of “No Wars” begins his second term by starting a Trade War. More news at 11",
                "the great businessman who had 6 bankruptcies ladies and gentlemen.  🎩 ",
                "Trump, contrary to polls, is very bad for our economy.",
                "In case anyone is wondering where we've been and where we're going, here's a handy guide.\n\n1. The tariffs are great for the economy\n2. The tariffs are great for the economy, but it will take time to see\n3. The tariffs will be good overall for America, but the economy will \"transition\" **<-- (you are here)**\n4. This is a market correction, not a recession\n5. Not *all* experts agree that we're in stagflation\n6. This depression is all because of the Biden/Obama tariffs which I, Donald Trump, will now end!",
                "Transition TO WHAT?   Financial ruin, destroyed partnerships, vaporized supply chains, never retiring, and blown investments?\n\nThis guy is the dumbest sack of Matlock reruns I have ever seen.",
                "We've almost given up 6 months of stock growth. The stock market isn't the economy, but when stocks slump, the real economy slumps.",
                "Already tired of all this … winning?",
                "“I bullied and alienated multiple countries - they will back down soon for U.S. final victory”, Trump state of union for the gullible",
                "just to be clear, when Biden left office we had +2.3% GDP growth. Trump has been in office less than two months and we are now projected to have -2.8%. in TWO FUCKING MONTHS he destroyed 5% GDP. fuck you if you voted for this fascist dictator."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Judge temporarily blocks effort to deport Palestinian activist who helped lead Columbia student protests | CNN",
            "external_url": "https://www.cnn.com/2025/03/10/us/mahmoud-khalil-columbia-university-israel-hnk/index.html",
            "upvotes": 5783,
            "date": "03/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150126.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The DHS agents said the US Department of State revoked Khalil’s student visa, although he does not have a student visa, but rather a green card, and is a lawful permanent resident, WAWOG said. When Khalil’s wife, who is eight months pregnant, showed the agents his green card, “one agent was visibly confused and said on the phone, ‘He has a green card’,” according to the news release. \n\nWhat an absolute shitshow.",
                "This is an illegal detainment. This is pure authoritarianism.",
                "This is the kind of thing that should alarm any American. Our government planning to punish and silence people who are using constitutionally protected rights. It's a really slippery slope that leads to nobody being allowed to criticize the government. It's something we consider abhorrent when other countries do it.",
                "The attempt at the federal government silencing someone and removing them is explicitly against the 1st Amendment.  If you don't see that our government is explicitly unconstitutional by now, you aren't looking.",
                "Good. The notion that someone who is legally in the country can be detained and punished for legally protesting the government is bullshit. \n\nFrom the “party of free speech and against cancel culture!”\n\nAnd the excuse is bullshit too. “Might support hamas” my puckered ass.",
                "There's going to be a lot of exhausted judges for the next 4 years. Hopefully it's only 4 years.",
                "RIP to the first amendment. If this works for trump, Americans are next.",
                "The state department can’t revoke a green card.  They also can’t revoke somebody’s authorized stay once they’ve entered the country.",
                "I remember saying to multiple people that this exact thing would happen, and was told that I was exaggerating and catastrophizing.\n\nAnd people wonder why I don't take Republicans seriously anymore.",
                "One of the basic, and most important rights, that we have in America is that Constitutional rights apply to all people within America. There is a reason why Bush sent terrorist to Gitmo and not an American prison on the mainland. The idea that we disagree with someone’s political view, despite their immigration stance, and want to deport them is both illegal and contrary to our laws. Hell, one of John Adam’s first famous acts was being the defense lawyer for the british soldiers in the Boston massacre. He did it not because he agreed with their actions but that our laws are universal or they are worthless. You don’t pick and choose when you want laws to apply. And before down votes happen. Imagine a democratic president doing the same thing to a conservative person. I’m sure that would go down just as smootgly."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "ICE accessed car trackers in sanctuary cities that could help in raids, files show",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/ice-car-trackers-sanctuary-cities",
            "upvotes": 449,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d9dedc528334a4887911e448f31e312aa88ddced/0_221_4571_2743/master/4571.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=78eff3fbf2a5d68c5d2586cbdcaeff4b",
            "top_comments": [
                "Reminder that the government can and will track your car and use that information against you.",
                "Regardless of how you feel about the immigration situation in this country, it's only a matter of time before they start using these same tactics to track down political dissidents.",
                "> When announcing the contract to install 172 Flock cameras across Norfolk, the police chief Mark Talbot said his office wanted to create “a nice curtain of technology” that would make it “difficult to drive anywhere of any distance without running into a camera somewhere”. Lee Schmidt, one of the plaintiffs, said four of the cameras had fenced in his neighborhood.\n\n\"nice\" is the last word I would use to describe this.",
                "These ICE guys sound like a bunch of goombas.",
                "Anti flock maps are out there. Stay safe everyone.",
                "All this effort just to hurt people.",
                "They’re installing trackers in my city of less than 5,000 people. Seems ridiculous.",
                "I think statistics show members of the church are more detrimental to American children than raids on migrant workers. I understand ICE needs a paycheck but this is becoming egregiously wasteful of my taxes and decreasing my crop prices",
                "Another click bait headline. Makes it sound like they can access car data from cars. Spoiler: they're just using license plate trade data from traffic cams.  \nStill sketchy, of course. But not that big brothery."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "Ukraine's biggest drone attack on Moscow kills one, disrupts air and train transport",
            "external_url": "https://www.reuters.com/world/europe/ukraine-launches-drone-attacks-targeting-moscow-russia-says-2025-03-11/",
            "upvotes": 1231,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Russia could just give up territory, dismantle their military, vowing never to join a defensive alliance, sell their minerals cheap to Germany and this won’t happen again.\n\n;P",
                "Well since Trump pulled aid Ukraine is now free to attack Ruzzia as much as they like.\n\nUS is really destroying itself lmfao.",
                "Oh well, they started it.",
                "***adding War Pigs to my play list***",
                "The russian people need to stand up to Putin and demand a ceasefire. Like America needs too",
                "Great news! \n\nDon’t stop until these murderous russian invaders surrender and pay for what they have done.",
                "No one was killed. A human meat interceptor blocked an incoming drone. /s"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Trump has instructed to raise Canadian tariffs on aluminum and steel to 50%",
            "external_url": "https://www.theguardian.com/us-news/live/2025/mar/11/donald-trump-latest-us-politics-news-live?CMP=share_btn_url&page=with%3Ablock-67d042cb8f087aea3a248e0d#block-67d042cb8f087aea3a248e0d",
            "upvotes": 90,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0e5cfb3943da44eb9c83513768b077fa8f23acf9/0_635_9504_5701/master/9504.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=5e929e182f325ba9b1bed6721b04f1be",
            "top_comments": [
                "Maybe instead of tariffs, we could properly tax billionaires 🤷🏻‍♂️",
                "Last time he did this, during Trump 1.0, aluminum plants in Kentucky closed, leading to higher unemployment. That county was devastated. Congratulations, Trump, and Trump voters!!!",
                "Trump recession is self inflicted. Trump must be rejected.",
                "“He would see the entire world burn just to be the king of ashes”",
                "These billionaires double down on their stupid decisions because the outcome does not affect them. It's just a game and they don't give a shit.",
                "Apparently Trump wanted more chaos and uncertainty today. He and his administration have been trying to do at least one ill intentioned thing per day so far.",
                "“Based on Ontario, Canada, placing a 25% Tariff on “Electricity” coming into the United States, I have instructed my Secretary of Commerce to add an ADDITIONAL 25% Tariff, to 50%, on all STEEL and ALUMINUM COMING INTO THE UNITED STATES FROM CANADA, ONE OF THE HIGHEST TARIFFING NATIONS ANYWHERE IN THE WORLD. This will go into effect TOMORROW MORNING, March 12th. Also, Canada must immediately drop their Anti-American Farmer Tariff of 250% to 390% on various U.S. dairy products, which has long been considered outrageous. I will shortly be declaring a National Emergency on Electricity within the threatened area. This will allow the U.S to quickly do what has to be done to alleviate this abusive threat from Canada. If other egregious, long time Tariffs are not likewise dropped by Canada, I will substantially increase, on April 2nd, the Tariffs on Cars coming into the U.S. which will, essentially, permanently shut down the automobile manufacturing business in Canada. Those cars can easily be made in the USA! Also, Canada pays very little for National Security, relying on the United States for military protection. We are subsidizing Canada to the tune of more than 200 Billion Dollars a year. WHY??? This cannot continue. The only thing that makes sense is for Canada to become our cherished Fifty First State. This would make all Tariffs, and everything else, totally disappear. Canadians taxes will be very substantially reduced, they will be more secure, militarily and otherwise, than ever before, there would no longer be a Northern Border problem, and the greatest and most powerful nation in the World will be bigger, better and stronger than ever — And Canada will be a big part of that. The artificial line of separation drawn many years ago will finally disappear, and we will have the safest and most beautiful Nation anywhere in the World — And your brilliant anthem, “O Canada,” will continue to play, but now representing a GREAT and POWERFUL STATE within the greatest Nation that the World has ever seen!”",
                "Looks like Ontario might be shutting off electricity completely. Fuck Trump",
                "\"Trump said he would “permanently shut down the automobile manufacturing business in Canada” if the country did not end unspecified tariffs it had placed on US goods:\"\n\nEverything in thr market could be appeased if this moron backs down. \n\nAnd yet, he continues to double down on tariffs. \n\nThis is madness",
                "Glad I stocked up on canned goods before all of this nonsense.\n\nMAGA business leaders, take note of how Trump is winging all of this. At any moment, he could announce a random tariff that devastates your industry.\n\nIsn't that fun?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "4 arrested after 5-year-old Michigan boy's death in hyperbaric chamber explosion",
            "external_url": "https://www.cbsnews.com/detroit/news/four-arrested-fatal-hyperbaric-chamber-explosion/",
            "upvotes": 100,
            "date": "03/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/03/3dac41ab-664d-41a6-b6bc-0857bc644b4a/thumbnail/1200x630/62e28229aa7c23af4aaf5b2afda24935/police-lights.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Why was the kid in a hyperbaric chamber??",
                "Four people have been arrested after a 5-year-old boy was killed in a hyperbaric chamber explosion in Troy, Michigan.\n\nThe Troy Police Department confirmed that the arrests occurred Monday morning. They are scheduled to be arraigned on Tuesday.\n\nPolice did not release the names of the people arrested; however, court records show that one of them was Tami Peterson, the center's owner. \n\nCBS News Detroit reached out to the Oxford Center for comment and received the following statement: \n\n    \"After cooperating with multiple investigations starting immediately after the tragic accident in January, we are disappointed to see charges filed.\n\n    \"The timing of these charges is surprising, as the typical protocol after a fire-related accident has not yet been completed. There are still outstanding questions about how this occurred. Yet, the Attorney General's office proceeded to pursue charges without those answers.\n\n    \"Our highest priority every day is the safety and wellbeing of the children and families we serve, which continues during this process.\"\n\nInvestigators say Thomas Cooper was in the chamber when it exploded on Jan. 31, 2025. The boy's mother was in the room at the time and was injured in the explosion. In a news conference shortly after the incident, Troy police and fire departments did not indicate what may have led to the explosion but said that hyperbaric chambers are filled with 100% oxygen and are, therefore, combustible devices.\n\nWithin days of the tragedy, the family retained Fieger Law, which alleges that the center had a history of being involved in questionable business practices.\n\nAttorney James Harrington told CBS News Detroit last month that his office was getting ready to file a lawsuit demanding answers into what led to his death. Harrington said the lawsuit will be filed pending their investigation.\n\n\"Under no circumstances ... should anything ever like this happen and the only way this happens is negligence,\" Harrington said. \"This industry in Michigan is unregulated. There's not a lot of science to back these claims that are being made as to what ailments and problems can actually be fixed or better by this hyperbaric treatment.\"",
                "Charges are second-degree murder and involuntary manslaughter according to this article:\n\nhttps://www.nbcnews.com/news/crime-courts/4-charged-death-michigan-boy-killed-hyperbaric-chamber-fire-rcna195753",
                "Maybe more confused after reading the article than I was by the headline.\n\nDefendants are disappointed charges were filed this quickly because normal fire accident protocol hadn't run its course?\n\nNo insight as to why the kid was in a hyperbaric chamber in what was described as an unregulated industry?\n\nSeems like a very bizarre situation that resulted in the unnecessary death of a child.",
                "They were trying to \"cure\" his ND disorders (ADHD and I think something else). \n\n\nIt's rich that their attorney is saying there's no science behind this and it should be better regulated.\n\n\nNo. It should be banned outright. And also, I don't think the parents are blameless. Take your kid to a fucking doctor. I know these places are predatory but take your kid to a fucking doctor. \n\n\nMy kid has ADHD and is the same age as this kid, and we live not too far from there. Breaks my heart. ",
                "The reason why details are scarce is likely because the victims are identifiable and it was likely related to health (even if it was pseudo science bullshit), so there are probably concerns about HIPAA.",
                "Calling a hyperbaric chamber a “combustible device” is inaccurate. Oxygen supports combustion but is not combustible.",
                "Sounds like the only reason charges were filed is because someone wants to increase regulation; attorneys smell profit in suffering like sharks do blood."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Seven men arrested in Japan for raping daughters, sharing footage in chat group.",
            "external_url": "https://www.straitstimes.com/asia/east-asia/seven-men-arrested-in-japan-for-raping-daughters-sharing-footage-in-chat-group",
            "upvotes": 587,
            "date": "03/11/2025",
            "thumbnail": "https://cassette.sphdigital.com.sg/image/straitstimes/cbb298abcce5ca7335e17c5dc6540bd83acce49d9a88a567e58400a2045ea275",
            "top_comments": [
                "These guys raped their own daughters regularly, youngest girl was six years old.  \nFilmed it and then circulate/share within their own chat group with other men/fathers.   \nHow muthaf\\*\\*king sick can one be to come up with such stuff!",
                "adblocker blocks the whole entire website. like, nothing at all shows up and the block counter just goes and goes",
                "Just looked at the charges for stuff like this in Japan and got pissed off at how light of a sentence they could get",
                "\"Seven men arrested in Japan for raping daughters, sharing footage in chat group\nThe seven were in the same chat group for incest and paedophilia.\nThe seven were in the same chat group for incest and paedophilia.PHOTO: LIANHE ZAOBAO\nUPDATED Mar 11, 2025, 08:21 PM\n\n\nPolice from Aichi Prefecture in Japan have arrested seven men as of March 11 on suspicion of raping their daughters or stepdaughters and sharing footage of the abuse on social media, reported the Mainichi Shimbun.\n\n\nThe men are in their 30s to 50s.\n\n\nThey are accused of penetrative sexual assault, and violations of anti-child prostitution and anti-child pornography laws, reported the Japanese newspaper.\n\n\n\n\nFour of the men allegedly violated their biological or foster daughters and sent videos of the abuse in a social media group.\n\n\nThe victims were between six and 14 years old at the time.\n\n\nThe other three men allegedly owned obscene images of minors.\n\n\n\n\nThe seven were in the same chat group for incest and paedophilia, and the Aichi police believe they sexually abused their daughters and other children regularly.\n\n\nThey were discovered after one of the men was arrested in November 2024 for suspected penetrative sexual assault of a minor, and a probe of his mobile phone revealed the group were sharing explicit videos.\n\n\nThe group is thought to have started exchanging information around December 2023, reported Mainichi Shimbun.\"",
                "Investigative sources revealed that the seven men, aged in their 30s to 50s and living in Aichi Prefecture and elsewhere, stand accused of penetrative sexual assault as well as violations of anti-child prostitution and anti-child pornography laws. Four of the men allegedly filmed the scenes of them sexually assaulting their biological or foster daughters, aged between 6 and 14 at the time, and shared the footage within a social media group, while the other three owned obscene images of underage individuals.\n\nIn the messaging app used by the group, there were comments reading, \"I've trained her since she was 3,\" \"Just telling her, 'If you tell your mom, you wouldn't be able to be with your dad. Can you keep a secret?' worked for me,\" and, \"Because my wife is away on a trip.\" The prefectural police believe that the men continued to sexually abuse their own daughters and others on a regular basis.\n\nIn November last year, one of the men was arrested on suspicion of penetrative sexual assault of an underage person, and a probe of his mobile phone revealed that the group was sharing obscene videos.\n\nIt is thought that the group, comprised of men fond of incest with minors, started exchanging information in around December 2023. The seven suspects came to know each other through another online website, and one of them managed the chat group in question. The police suspect that several other men had joined the group, and are continuing to investigate the case.",
                "They need their thing to be chopped off!",
                "Horrific!\n\n Japan had a real problem for a long time with schoolgirls being abused by older guys - framed almost as if they were “dating” them. Like some kind of normal consenting “sugar daddy” relationship- but obviously with minors\n\nIt was a VERY common (if not necessarily ok) thing to be happening. Not an unusual / rare thing.  \n \nThis was a decade ago I read about it. I’ve no idea if it’s still as common. I think the government were trying to do something about it. \n\nI hope they succeeded .",
                "May they all die very slow, very painful deaths.",
                "I cannot even imagine the lifetime of trauma these girls will battle. They deserve the best care and support for the rest of their lives.  I'm not sure what kind of sentencing the Japanese legal system has, but I hope these men rot in prison. I hope every day until the end of their days is full of misery.",
                "Glad they caught them, if it were the U.S. they'd be running for public office as Republicans."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Southwest Airlines shifts to paid baggage policy to lift earnings",
            "external_url": "https://www.reuters.com/business/aerospace-defense/southwest-airlines-shifts-paid-baggage-policy-lift-earnings-2025-03-11/",
            "upvotes": 808,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "To lift earnings we are eliminating the competitive advantage that brings people to our airline.",
                "> The policy shift suggests a growing influence of activist investor Elliott Investment Management at the airline. The hedge fund, whose nominees hold five of 15 board seats, had criticized Southwest's leadership for not charging a fee for checking bags like other airlines to boost its revenue.\n\nMotherfucking hedge funds, leeching off of society while generating nothing of real value for us.",
                "In the email they sent announcing this, they rolled out multiple anti-passenger changes at the same time:\n\n* Paid checked bags\n* Flight credit expiration\n* Lower earn ratio on rapid reward points\n* No more free changes on Basic (though oddly you can still cancel and get a flight credit, so the key difference here is inconvenience)\n\nI'm going to bet the checked bags portion of this was the preplanned \"we heard you\" piece that can be easily carved out while they keep all the rest of the changes. Then they'll reintroduce the checked bag change later and there won't be nearly as much furor as the outrage was already spent once on this issue.\n\nMy company flies exclusively Southwest. I've taken hundreds of legs with them. I suspect that will change now.",
                "SW will file bankruptcy and/or be acquired within the next 10 years.",
                "Time to cancel that Southwest Rapid Rewards VISA",
                "As someone who has flown Southwest many times, I’ll repeat a comment I made in an earlier thread: Herb Kelleher is twirling in his grave with how this investment group is destroying his airline. Fuck these people.",
                "Southwest Fares for me were usually around the same price or slightly more expensive than Delta/United/American etc.. but when you added in a free checked bag for a round trip flight they often ended up cheaper. \n\nIf they go to a $35+ baggage fee I will have zero reason to fly on Southwest ever again unless their flight prices come down (which I doubt).",
                "South West shifts to never getting my business again",
                "\"Our business is failing because of poor management and terrible decisions. What can we do to attract more customers?\"\n\n\\[slience\\]\n\n\"What if instead of attracting more customers, we just bled the ones we have for more money, making everything worse for everyone?\"\n\nGREAT IDEA SIR!",
                "As an employee this makes me incredibly sad"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Ex-president Rodrigo Duterte arrested over crimes against humanity",
            "external_url": "https://www.rappler.com/philippines/rodrigo-duterte-arrested-crimes-against-humanity-icc/",
            "upvotes": 124,
            "date": "03/11/2025",
            "thumbnail": "https://www.rappler.com/tachyon/2024/11/rodrigo-duterte-congress-quadcomm-ejk-war-on-drugs-reuters-november-13-2024-001-scaled.jpg",
            "top_comments": [
                "Other countries are showing that they can bring corrupt leaders to justice. First Bolsonaro now Duterte... but we couldn't manage to throw the Mango Mussolini the book.",
                "Remember when Trump said he loved his policies? These exact policies that are crimes against humanity?\n\nEdit:\n\n>  “I just wanted to congratulate you because I am hearing of the unbelievable job on the drug problem. Many countries have the problem, we have a problem, but what a great job you are doing and I just wanted to call and tell you that.” - Trump 2017",
                "There is always one important downside to being a corrupt leader. Unless the position is for life, they will always have to face those they targeted while in office."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "DC begins removing ‘Black Lives Matter’ plaza near the White House",
            "external_url": "https://apnews.com/article/black-lives-matter-white-house-trump-bowser-f130daeb762e438fc8eddd3dd4da7982",
            "upvotes": 83,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">D.C. Mayor Muriel Bowser announced the change last week in response to pressure from Republicans in Congress.\n\nHow much will this unnecessary work cost, while the Republicans are also working overtime to drive inflation and grocery prices up?",
                "…because they don’t to this administration. Only rich right wing lives matter to the Trump administration.",
                "It would be a shame if it kept coming back every night",
                "And it will be paid for with your tax dollar.",
                "From AP News:\n\n>Starlette Thomas remembers coming down almost daily to the intersection of 16th and H streets, to protest police brutality and systemic racial iniquities during the summer of 2020. On Monday, the 45-year old Bowie, Maryland resident returned to the site of those protests to mourn the end of Black Lives Matter Plaza. \n\n>“I needed to be here today. I can’t just let this go away,” Thomas said, as jackhammers began tearing into the giant yellow letters in the street. Thomas discretely secured a chunk of pavement and said holding it made her feel conflicted. “To walk away with a piece of that, it means it’s not gone,” she said. “It’s more than brick and mortar.”\n\n>Crews started work Monday to remove the large yellow “Black Lives Matter” painted on the street one block from the White House. D.C. Mayor Muriel Bowser announced the change last week in response to pressure from Republicans in Congress. The work is expected to take about six weeks and the words will be replaced by an unspecified set of city-sponsored murals. \n\n>The painting of those words was an act of government-sponsored defiance during President Donald Trump’s first term. The removal amounts to a public acknowledgement of just how vulnerable the District of Columbia is now that Trump is back in the White House and Republicans control both houses of Congress.\n\n>Bowser, a Democrat, ordered the painting and renamed the intersection Black Lives Matter Plaza in June 2020. It came after days of chaotic protests at that location following the murder of George Floyd by a Minneapolis police officer; Bowser had clashed with Trump over her handling of the protests.\n\n>But now Bowser has little power to fend off encroachments on D.C.’s limited autonomy. Bowser said last week on X that, “The mural inspired millions of people and helped our city through a painful period, but now we can’t afford to be distracted by meaningless congressional interference. The devastating impacts of the federal job cuts must be our number one concern.”\n\n>Among those who gathered to witness the work Monday was Megan Bailiff, CEO of Equus Striping, the pavement marking company that originally painted the letters. Bailiff called the dismantling of Black Lives Matter Plaza, “historically obscene” and said its presence was, “more significant at this very moment than it ever has been in this country.” \n\n>The far right celebrated the shift online, with conservative provocateur Charlie Kirk visiting the site to hail, “the end of this mass race hysteria in our country.” \n\n>In Trump’s second term, Bowser has worked to avoid conflict and downplay any points of contention. She traveled to Mar-a-Lago in Florida to meet with Trump after the election and has publicly emphasized their points of agreement.\n\n>Trump recently revived a frequent campaign talking point about wanting a federal “takeover” of the nation’s capital, describing Washington as being riddled with crime, graffiti and homeless encampments. Bowser has refused to comment on reports that the White House is preparing an executive order targeting Washington. She publicly said that the greatest threat to the so-called Home Rule autonomy was “some of the people in Congress.”\n\n>Congressional Republicans have repeatedly threatened to interfere in city affairs in large and small ways. A measure currently before Congress, named the BOWSER Act, seeks to completely revoke the Home Rule Act of 1973, which grants the capital city limited autonomy.",
                "This is primarily paint, why are they ripping up the pavement?",
                "So do Black lives stil matter?",
                "I'm so glad Trump received so many Black votes.  They must be very proud of themselves for choosing this path."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "ICE accessed car trackers in sanctuary cities that could help in raids, files show",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/ice-car-trackers-sanctuary-cities",
            "upvotes": 447,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d9dedc528334a4887911e448f31e312aa88ddced/0_221_4571_2743/master/4571.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=78eff3fbf2a5d68c5d2586cbdcaeff4b",
            "top_comments": [
                "Reminder that the government can and will track your car and use that information against you.",
                "Regardless of how you feel about the immigration situation in this country, it's only a matter of time before they start using these same tactics to track down political dissidents.",
                "> When announcing the contract to install 172 Flock cameras across Norfolk, the police chief Mark Talbot said his office wanted to create “a nice curtain of technology” that would make it “difficult to drive anywhere of any distance without running into a camera somewhere”. Lee Schmidt, one of the plaintiffs, said four of the cameras had fenced in his neighborhood.\n\n\"nice\" is the last word I would use to describe this.",
                "These ICE guys sound like a bunch of goombas.",
                "Anti flock maps are out there. Stay safe everyone.",
                "All this effort just to hurt people.",
                "They’re installing trackers in my city of less than 5,000 people. Seems ridiculous.",
                "I think statistics show members of the church are more detrimental to American children than raids on migrant workers. I understand ICE needs a paycheck but this is becoming egregiously wasteful of my taxes and decreasing my crop prices",
                "Another click bait headline. Makes it sound like they can access car data from cars. Spoiler: they're just using license plate trade data from traffic cams.  \nStill sketchy, of course. But not that big brothery."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "New York fires 2,000 prison guards, declares strike over",
            "external_url": "https://www.cbsnews.com/newyork/news/new-yorks-prison-strike-poised-to-end-monday/",
            "upvotes": 1216,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/03/60609003-572c-4d8b-9f73-987802bcfc0c/thumbnail/1200x630/d42a6c315c0444cfb5330c6c71fc87bf/ap25058732974698.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Nothing like having disgruntled employees watching over felons. Surely this is a recipe for good things only.",
                "Work condition just got worse now with 2000 less guards = More mandatory overtimes.",
                "Does anyone have any info on why these 2000 guards held out? The article says a deal was struck, but these were the hold outs and fired because of it.",
                "To be clear, these prison guards went on strike because of a law put in place over solitary confinement.",
                "This has Trump disillusionment vibes",
                "Ss: DOCCS said no penalties were waived as part of the agreement.",
                "Naw screw those prison guards, striking over being mad they can't just send people to solitary confinement willy nilly.",
                "For those unfamiliar as to why they're striking, the cause was their deep anger that their coworkers didn't get away with beating an inmate to death. Like they were used to. They are upset about having to wear body camera, which would make them more accountable for the rapes, beatings and murders they have gotten away with for generations. \n\nIt's a dangerous job for sure and we need a lot more guards than we have, but we need to smash their culture and mindset with a hammer.\n\n[6 Corrections Officers Charged With Murder in New York Inmate’s Death](https://www.nytimes.com/2025/02/20/nyregion/robert-brooks-corrections-officers-charged-murder.html?smid=nytcore-android-share)",
                "corp dems like Hochul are just as bad as any republican when it comes to workers' rights",
                "Maybe they should stop being corrupt and murdering inmates? "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Moscow airports suspend flights after ‘massive’ Ukrainian drone attack",
            "external_url": "https://www.theguardian.com/world/2025/mar/11/moscow-airports-suspend-flights-after-massive-ukrainian-drone-attack",
            "upvotes": 2083,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1ecdcfb1374f87704afac6b6e5567b26715df9de/0_175_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=693fad69bc0bf93d7d0feb0082b77a57",
            "top_comments": [
                "If i remember one of hold outs preventing Ukraine from doing this before was the US as part of arms deal. Might be wrong",
                "Wonderful news! Keep up the fight and defeat putin and his asset, the traitorous felon krasnov.",
                "Well, it's what anyone would do!",
                "As far as I'm concerned, Russia was attacking the apartments and hospitals first. Why would that be a surprise?",
                "Good, some of their own medicine.",
                "I love a positive news story like this. \n\nKeep it up.",
                "This is not a good week for Elon and friends.",
                "Russia still has planes?",
                "[removed]",
                "Russia attacked itself again. Wake up"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 9155,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                "[removed]",
                "Jamie Whites murder was a hoax by the deep state. He and the other people involved are just crisis actors. Let's make a buncha podcasts making millions off arguing this and just insist Alex Jones is crazy.\n\nGive him a taste of his own.",
                "[removed]",
                "Nah probably a crisis actor this never happened",
                "I guess he lost the info war",
                "I am fortunate enough to never have heard of this person.",
                "It's his fault he got shot. If he didn't want to get shot, he shouldn't have been dressed like that. His body had a way of shutting down that bullet. Totally the victims fault.",
                "I see were using the term \"journalist\" real, real loosely here. \n\n\nAnyway, tots and pears I guess. Best I can do.  "
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Seven men arrested in Japan for raping daughters, sharing footage in chat group.",
            "external_url": "https://www.straitstimes.com/asia/east-asia/seven-men-arrested-in-japan-for-raping-daughters-sharing-footage-in-chat-group",
            "upvotes": 583,
            "date": "03/11/2025",
            "thumbnail": "https://cassette.sphdigital.com.sg/image/straitstimes/cbb298abcce5ca7335e17c5dc6540bd83acce49d9a88a567e58400a2045ea275",
            "top_comments": [
                "These guys raped their own daughters regularly, youngest girl was six years old.  \nFilmed it and then circulate/share within their own chat group with other men/fathers.   \nHow muthaf\\*\\*king sick can one be to come up with such stuff!",
                "adblocker blocks the whole entire website. like, nothing at all shows up and the block counter just goes and goes",
                "Just looked at the charges for stuff like this in Japan and got pissed off at how light of a sentence they could get",
                "\"Seven men arrested in Japan for raping daughters, sharing footage in chat group\nThe seven were in the same chat group for incest and paedophilia.\nThe seven were in the same chat group for incest and paedophilia.PHOTO: LIANHE ZAOBAO\nUPDATED Mar 11, 2025, 08:21 PM\n\n\nPolice from Aichi Prefecture in Japan have arrested seven men as of March 11 on suspicion of raping their daughters or stepdaughters and sharing footage of the abuse on social media, reported the Mainichi Shimbun.\n\n\nThe men are in their 30s to 50s.\n\n\nThey are accused of penetrative sexual assault, and violations of anti-child prostitution and anti-child pornography laws, reported the Japanese newspaper.\n\n\n\n\nFour of the men allegedly violated their biological or foster daughters and sent videos of the abuse in a social media group.\n\n\nThe victims were between six and 14 years old at the time.\n\n\nThe other three men allegedly owned obscene images of minors.\n\n\n\n\nThe seven were in the same chat group for incest and paedophilia, and the Aichi police believe they sexually abused their daughters and other children regularly.\n\n\nThey were discovered after one of the men was arrested in November 2024 for suspected penetrative sexual assault of a minor, and a probe of his mobile phone revealed the group were sharing explicit videos.\n\n\nThe group is thought to have started exchanging information around December 2023, reported Mainichi Shimbun.\"",
                "Investigative sources revealed that the seven men, aged in their 30s to 50s and living in Aichi Prefecture and elsewhere, stand accused of penetrative sexual assault as well as violations of anti-child prostitution and anti-child pornography laws. Four of the men allegedly filmed the scenes of them sexually assaulting their biological or foster daughters, aged between 6 and 14 at the time, and shared the footage within a social media group, while the other three owned obscene images of underage individuals.\n\nIn the messaging app used by the group, there were comments reading, \"I've trained her since she was 3,\" \"Just telling her, 'If you tell your mom, you wouldn't be able to be with your dad. Can you keep a secret?' worked for me,\" and, \"Because my wife is away on a trip.\" The prefectural police believe that the men continued to sexually abuse their own daughters and others on a regular basis.\n\nIn November last year, one of the men was arrested on suspicion of penetrative sexual assault of an underage person, and a probe of his mobile phone revealed that the group was sharing obscene videos.\n\nIt is thought that the group, comprised of men fond of incest with minors, started exchanging information in around December 2023. The seven suspects came to know each other through another online website, and one of them managed the chat group in question. The police suspect that several other men had joined the group, and are continuing to investigate the case.",
                "They need their thing to be chopped off!",
                "Horrific!\n\n Japan had a real problem for a long time with schoolgirls being abused by older guys - framed almost as if they were “dating” them. Like some kind of normal consenting “sugar daddy” relationship- but obviously with minors\n\nIt was a VERY common (if not necessarily ok) thing to be happening. Not an unusual / rare thing.  \n \nThis was a decade ago I read about it. I’ve no idea if it’s still as common. I think the government were trying to do something about it. \n\nI hope they succeeded .",
                "May they all die very slow, very painful deaths.",
                "I cannot even imagine the lifetime of trauma these girls will battle. They deserve the best care and support for the rest of their lives.  I'm not sure what kind of sentencing the Japanese legal system has, but I hope these men rot in prison. I hope every day until the end of their days is full of misery.",
                "Glad they caught them, if it were the U.S. they'd be running for public office as Republicans."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "ICE accessed car trackers in sanctuary cities that could help in raids, files show",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/ice-car-trackers-sanctuary-cities",
            "upvotes": 449,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d9dedc528334a4887911e448f31e312aa88ddced/0_221_4571_2743/master/4571.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=78eff3fbf2a5d68c5d2586cbdcaeff4b",
            "top_comments": [
                "Reminder that the government can and will track your car and use that information against you.",
                "Regardless of how you feel about the immigration situation in this country, it's only a matter of time before they start using these same tactics to track down political dissidents.",
                "> When announcing the contract to install 172 Flock cameras across Norfolk, the police chief Mark Talbot said his office wanted to create “a nice curtain of technology” that would make it “difficult to drive anywhere of any distance without running into a camera somewhere”. Lee Schmidt, one of the plaintiffs, said four of the cameras had fenced in his neighborhood.\n\n\"nice\" is the last word I would use to describe this.",
                "These ICE guys sound like a bunch of goombas.",
                "Anti flock maps are out there. Stay safe everyone.",
                "All this effort just to hurt people.",
                "They’re installing trackers in my city of less than 5,000 people. Seems ridiculous.",
                "I think statistics show members of the church are more detrimental to American children than raids on migrant workers. I understand ICE needs a paycheck but this is becoming egregiously wasteful of my taxes and decreasing my crop prices",
                "Another click bait headline. Makes it sound like they can access car data from cars. Spoiler: they're just using license plate trade data from traffic cams.  \nStill sketchy, of course. But not that big brothery."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Southwest Airlines shifts to paid baggage policy to lift earnings",
            "external_url": "https://www.reuters.com/business/aerospace-defense/southwest-airlines-shifts-paid-baggage-policy-lift-earnings-2025-03-11/",
            "upvotes": 807,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "To lift earnings we are eliminating the competitive advantage that brings people to our airline.",
                "> The policy shift suggests a growing influence of activist investor Elliott Investment Management at the airline. The hedge fund, whose nominees hold five of 15 board seats, had criticized Southwest's leadership for not charging a fee for checking bags like other airlines to boost its revenue.\n\nMotherfucking hedge funds, leeching off of society while generating nothing of real value for us.",
                "In the email they sent announcing this, they rolled out multiple anti-passenger changes at the same time:\n\n* Paid checked bags\n* Flight credit expiration\n* Lower earn ratio on rapid reward points\n* No more free changes on Basic (though oddly you can still cancel and get a flight credit, so the key difference here is inconvenience)\n\nI'm going to bet the checked bags portion of this was the preplanned \"we heard you\" piece that can be easily carved out while they keep all the rest of the changes. Then they'll reintroduce the checked bag change later and there won't be nearly as much furor as the outrage was already spent once on this issue.\n\nMy company flies exclusively Southwest. I've taken hundreds of legs with them. I suspect that will change now.",
                "SW will file bankruptcy and/or be acquired within the next 10 years.",
                "Time to cancel that Southwest Rapid Rewards VISA",
                "As someone who has flown Southwest many times, I’ll repeat a comment I made in an earlier thread: Herb Kelleher is twirling in his grave with how this investment group is destroying his airline. Fuck these people.",
                "Southwest Fares for me were usually around the same price or slightly more expensive than Delta/United/American etc.. but when you added in a free checked bag for a round trip flight they often ended up cheaper. \n\nIf they go to a $35+ baggage fee I will have zero reason to fly on Southwest ever again unless their flight prices come down (which I doubt).",
                "South West shifts to never getting my business again",
                "\"Our business is failing because of poor management and terrible decisions. What can we do to attract more customers?\"\n\n\\[slience\\]\n\n\"What if instead of attracting more customers, we just bled the ones we have for more money, making everything worse for everyone?\"\n\nGREAT IDEA SIR!",
                "As an employee this makes me incredibly sad"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Moscow airports suspend flights after ‘massive’ Ukrainian drone attack",
            "external_url": "https://www.theguardian.com/world/2025/mar/11/moscow-airports-suspend-flights-after-massive-ukrainian-drone-attack",
            "upvotes": 2080,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1ecdcfb1374f87704afac6b6e5567b26715df9de/0_175_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=693fad69bc0bf93d7d0feb0082b77a57",
            "top_comments": [
                "If i remember one of hold outs preventing Ukraine from doing this before was the US as part of arms deal. Might be wrong",
                "Wonderful news! Keep up the fight and defeat putin and his asset, the traitorous felon krasnov.",
                "Well, it's what anyone would do!",
                "As far as I'm concerned, Russia was attacking the apartments and hospitals first. Why would that be a surprise?",
                "Good, some of their own medicine.",
                "I love a positive news story like this. \n\nKeep it up.",
                "This is not a good week for Elon and friends.",
                "Russia still has planes?",
                "[removed]",
                "Russia attacked itself again. Wake up"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ukraine's biggest drone attack on Moscow kills one, disrupts air and train transport",
            "external_url": "https://www.reuters.com/world/europe/ukraine-launches-drone-attacks-targeting-moscow-russia-says-2025-03-11/",
            "upvotes": 1230,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Russia could just give up territory, dismantle their military, vowing never to join a defensive alliance, sell their minerals cheap to Germany and this won’t happen again.\n\n;P",
                "Well since Trump pulled aid Ukraine is now free to attack Ruzzia as much as they like.\n\nUS is really destroying itself lmfao.",
                "Oh well, they started it.",
                "***adding War Pigs to my play list***",
                "The russian people need to stand up to Putin and demand a ceasefire. Like America needs too",
                "Great news! \n\nDon’t stop until these murderous russian invaders surrender and pay for what they have done.",
                "No one was killed. A human meat interceptor blocked an incoming drone. /s"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "New York fires 2,000 prison guards, declares strike over",
            "external_url": "https://www.cbsnews.com/newyork/news/new-yorks-prison-strike-poised-to-end-monday/",
            "upvotes": 1209,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/03/60609003-572c-4d8b-9f73-987802bcfc0c/thumbnail/1200x630/d42a6c315c0444cfb5330c6c71fc87bf/ap25058732974698.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Nothing like having disgruntled employees watching over felons. Surely this is a recipe for good things only.",
                "Work condition just got worse now with 2000 less guards = More mandatory overtimes.",
                "Does anyone have any info on why these 2000 guards held out? The article says a deal was struck, but these were the hold outs and fired because of it.",
                "To be clear, these prison guards went on strike because of a law put in place over solitary confinement.",
                "This has Trump disillusionment vibes",
                "Ss: DOCCS said no penalties were waived as part of the agreement.",
                "Naw screw those prison guards, striking over being mad they can't just send people to solitary confinement willy nilly.",
                "For those unfamiliar as to why they're striking, the cause was their deep anger that their coworkers didn't get away with beating an inmate to death. Like they were used to. They are upset about having to wear body camera, which would make them more accountable for the rapes, beatings and murders they have gotten away with for generations. \n\nIt's a dangerous job for sure and we need a lot more guards than we have, but we need to smash their culture and mindset with a hammer.\n\n[6 Corrections Officers Charged With Murder in New York Inmate’s Death](https://www.nytimes.com/2025/02/20/nyregion/robert-brooks-corrections-officers-charged-murder.html?smid=nytcore-android-share)",
                "corp dems like Hochul are just as bad as any republican when it comes to workers' rights",
                "Maybe they should stop being corrupt and murdering inmates? "
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 9156,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                "[removed]",
                "Jamie Whites murder was a hoax by the deep state. He and the other people involved are just crisis actors. Let's make a buncha podcasts making millions off arguing this and just insist Alex Jones is crazy.\n\nGive him a taste of his own.",
                "[removed]",
                "Nah probably a crisis actor this never happened",
                "I guess he lost the info war",
                "I am fortunate enough to never have heard of this person.",
                "It's his fault he got shot. If he didn't want to get shot, he shouldn't have been dressed like that. His body had a way of shutting down that bullet. Totally the victims fault.",
                "I see were using the term \"journalist\" real, real loosely here. \n\n\nAnyway, tots and pears I guess. Best I can do.  "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Texas army base poised to become mass deportation hub under new plan",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/08/texas-army-fort-bliss-deportation-detention",
            "upvotes": 1017,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2b686ca4ccf4a2d7b09134ea6bf357582a94180/0_88_2631_1580/master/2631.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1fa80dbce6850981de8ad2f33ea339c8",
            "top_comments": [
                "God i hate that they’re building a concentration camp right by my city. I already despise living in Texas, but this is rubbing salt on the wound.",
                "Fort Bliss \n\nWar is peace",
                "You misspelled \"concentration camp\"",
                ">Reports of Fort Bliss being used for detention as well as expulsion purposes spark outrage from critics\n\nIn case you were wondering which base",
                "Texaushwitz.\n\nThis will end well.",
                "\"Deportation Hub\". Sure, let's go with that. Just ignore all those open trenches and mysterious clouds of black smoke...",
                "So that’s the first concentration camp in the new America?",
                "of course in texas, Poll on which red state is the most evil at this point? people called this before they put one at gitmo.",
                "State prisons owners don’t trust the Trump administration to pay the inmate housing bills. ",
                "Spending all those millions to ship migrants everywhere else, and now Texas makes millions getting em all back. Not even sure it’s a smart grift but follow the money."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US rebrands immigration app to CBP Home with ‘self-deport’ function",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/10/us-self-deport-app-cbp-home-immigration",
            "upvotes": 1218,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6f794a259755f8a3a9d533a1fc5e5f514f2e1414/0_171_6365_3822/master/6365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4326e55c252ad9c4a6524d97c7a29fd1",
            "top_comments": [
                "I can say with nearly 100% confidence that a self-deport function was another one of Elon's ketamine-fueled ideas",
                "So by merely using the app your GPS position is logged, cross-referenced and ICE alerted to your whereabouts?\n\nHoney trap anyone?",
                "This is only Trump’s second month. At this rate in one year nobody wants to move to the U.S. or stay here anyway",
                "If I self deport, can I pick where to?  Asking on behalf of American citizens.",
                "Can I self deport myself. This maybe the ticket outta hell I need.",
                "The Kristi Noem ads where she touts “self-deportation” are chilling to watch. And cringeworthy, since they’re only run during the news, and in English only.",
                "Let me guess, the updated app will relay your GPS to the nearest ICE office. Hmm, I wonder what happens if more people get the app...",
                "We are living in an episode of black mirror.",
                "i wonder what would happen if a bunch of bored American citizens spam that.",
                "Can I self-deport myself if I’m a US citizen?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 53733,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "And we're only 2 months in.",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "I knew it was the right choice to not give up Mexican citizenship. Plus being Mexican is awesome.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "You MAGA heads proud of what trumpz has done to America so far? Feeling good about being a laughing stock on the world stage? Feeling good losing your rights to free speach and the right to protest? Feeling good about the economy? Guy is pathetic and worse he is a traitor to what makes America and previous American Presidents great."
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/11/2025 14:22:31 UTC"
}