{
    "posts": [
        {
            "category": "HOT",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 20376,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Dude, you're the attorney general. Just arrest the fucker.",
                "Arrest his punk ass as soon as he lands.",
                "I don't understand why we're \"suing\" people for committing felonies. What happened to arresting them?",
                "Sued, but not arrested for oh I don’t know….breaking a 💩 load of laws 🤔"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's xAI buys social media platform X for $45 billion",
            "external_url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/",
            "upvotes": 16892,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[deleted]",
                "Wait... so he raised money from investors for xAI, used that money to buy himself out of the $40B Twitter hole that he dug himself?? This seems very questionable at best...",
                "\"$45 billion\" of xAI stock... so you have to accept xAI's totally specious $75B valuation in order to believe this transaction is actually worth $45 billion.  What a joke.  \n\nxAI has raised around $20 billion from investors and sells nothing but vaporware.",
                "An all stock transaction... From one private company to another private company, both fundamentally controlled by the same person. This is really just economic sophistry isn't it?",
                "Okay... what?\n\nThis must be some tax/loan reshuffling thing I'm too plebeian to understand",
                "This is like when a no name influencer “sells” their shitty NFT to themselves for $10million",
                "Moving the trash from one garbage bin to the other.",
                "So he Bought it for 45 billion Tanked it into the Ground to get Trump Elected. Then somehow Magically with no Innovation/ increase in revenue/ Advertisers didn't come back/ Multiple boycotts and Still the value went back up magically to what he bought it for? \n\nHe then Sells it from himself to a company owned by him in order to pay back the 45 billion dollar loan on the saudi's before they make a call on his Tesla Stock which he was tanking. and Somehow in all of this i'm pretty sure he paid Zero taxes somehow. \n\nThis Feels like all smoke and mirrors and there's got to be some Legality involved. Where's the SEC and the FTC oh right their being defanged and Gutted by Musk as we speak. \n\n  \n/sigh",
                "This is exactly why he put his DOGE team within the SEC. Definitely committing fraud, but no one will be able to investigate him for it. We're so fucked in this country.",
                "Could this have something to do with him using Tesla shares to fund buying X? Now that Tesla price is dropping, does this do anything to shield himself from that?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 18733,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "What was she supposed to do with a dead fetus? At 19 weeks it was not close to viable. Women have been arrested for burying their stillborn children. Women miscarrying get turned away from hospitals because doctors are afraid to be accused of performing abortions. Maybe she didn’t even have the money to afford the ER visit (a whole other issue about how shitty the US is about healthcare).\n\nLook, I’ll be real with you. I used to work with animal control. Laws are different in different places, but when we had dead animals the law was two trash bags, into the dumpster. Trash bag/dumpster seems better to me than flushing it down the toilet. Burying it in the yard like a dead pet? If there are no laws regarding this, Tifton needs to leave this woman alone.",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "Step 1: Make healthcare insanely expensive, and allow insurance companies to deny legitimate services. \n\nStep 2:  Create draconian and constitutionally illegal laws around women's bodily autonomy.\n\nStep 3: Kill Medicare and Medicaid so there are no alternative options for health insurance for the middle and lower classes. \n\nStep 4: Force as many people into privatized for-profit prisons, which somehow can constitutionally use prisoners for slave labor\n\nStep 5: America has been made great again?",
                "Oh, look. That thing that women were told not to worry about happening has happened.\n\n  \nThey want to criminalize women for not being perfect broodmares."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Trump signs order ending union bargaining rights for wide swaths of federal employees",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5343474/trump-collective-bargaining-unions-federal-employees",
            "upvotes": 4233,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5313x2989+0+216/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fb4%2Fb1a0c5b24f54b1e0156c71e26852%2Fgettyimages-2202711755.jpg",
            "top_comments": [
                "Friend is a federal prison guard and he’s boiling over this. However, he did volunteer that “We all voted for him and now he does this to us….•",
                "Is anyone really surprised, this was explicitly called out in project 2025",
                "I'm sure this will come as quite the surprise to all the union members who voted for him.  \n I mean who could expect a guy who attacked unions over and over again, including federal unions in his last term, and who praised Musk for firing people who attempted to unionize would possibly do this?!",
                "I suspect the administration will begin to treat attempts at unionizing to be domestic terrorism soon.",
                "How can these people that voted for him not have seen this?  You idiots who voted for him willingly invited this as everyone else screamed at you that you're being conned in the most graceless,  obvious manner.",
                "Gotta think that’s not legal.\nSupreme Court better act quick ",
                "And how many of those Maga employees voted for Trump. Poetic.",
                "To be fair, he did say that he would be bringing DOGE in to \"do for the government what Elon did for Twitter\".  They're now doing exactly what they promised to do.  I'm all out of violins for the people that voted for him, or just couldn't get off their butts to vote against him, and are now getting what they were promised. \n\nThat being said, it's a shame that the folks who saw it coming and voted against Trump are now suffering for the actions of others.",
                "Everyone that \"used\" to be in the union should suddenly stop working.  Since they are not in a union it cannot be called a strike, but by golly it might have the same effect.",
                "The funny thing is unless we are introducing slavery you cannot force a group of people to work."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Dow sinks more than 600 points. Stocks are on track for their worst quarter since 2023",
            "external_url": "https://www.cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility",
            "upvotes": 20679,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2206185432.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Are we having fun yet?",
                "Trump's economy in action.",
                "Ever since January 20  the economy has tanked and being on downward spiral because of poor policies .",
                "They must be updating the headline. When I first saw it the headline said 500 points. OP posted 600. Clicking the link now at 1311 hours its 700 points.\n\nEDIT: Lol. On the top right under 'latest market news' there's a headline for 600 points and clicking on it takes you to the headline for 700 points. Silly website.",
                "Sec Treasury Bennet just included me in a chat about the declining stock market.  Will keep you all posted.",
                "Right now down 735. \n\nIt would need to fall another 700 points or so to hit the dip it was at a couple weeks ago. Another drop of that magnitude would take it to summer last year.",
                "Just wait until the unemployment figures come in.",
                "Somebody's winning.  It's just not us.",
                "Note to America - don’t elect idiots & crooks.",
                "I mean is anyone surprised? I literally can't think of any positive economic indicators or good news on the horizon. We haven't even started feeling the effects of the tariffs and the feds yanking billions of dollars of spending out of the economy, unemployment is going to spike with all the layoffs over the last couple of months, and inflation is taking off again.\n\nI've moved mostly into cash. I keep hearing people repeat a dumb slogan: \"Time in the market > timing the market!!!\" Maybe that's true sometimes, but not times like now where there is literally zero reason for the market to go up, and a zillion reasons it will continue going down."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 2165,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "\"In the wallet\" is his weak point.",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "Not if he destroys the justice system first.",
                "I only wish I could stop hearing about fucking Elon Musk and fucking Donald Trump every fucking second of every fucking day in every fucking social media platform on the god damn fucking internet.",
                "A more cynical person might think this has something to do with the announced \"sale\" of Xitter. A desperate attempt to shield himself from any personal liability.",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Wisconsin attorney general sues Musk over $2m election giveaway",
            "external_url": "https://www.bbc.com/news/articles/c8x4xd849eqo",
            "upvotes": 2420,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f204/live/d0db94a0-0c25-11f0-91f1-3bb93ded1c83.jpg",
            "top_comments": [
                "Someone help me understand why a violation of the law results in the Atty General filing a lawsuit, rather than law enforcement making an arrest?",
                "He's just doubling down on all the fraud and crimes now.",
                "When you're rich and you break the law, the government sues you.\n\nWhen you or I break the law, the government arrests us.\n\nThat's called \"small government\" by the 78 million of our Republican voting friends, family, coworkers, and neighbors.",
                "Remember when they wanted to say how handing out bottled water in election lines was bribery?",
                "Throw that fake nerd into jail",
                "Gee, what percentage is 1 million out of 337 billion? \n\nElon Musk has $337 Billion (as of March 27, 2025)  \n[https://engaging-data.com/how-rich-is-elon-musk/](https://engaging-data.com/how-rich-is-elon-musk/)\n\n# Answer:  0.000296736%\n\nJust to put that in real world perspective:\n\nWhat is 0.0003%  (rounding .000296736% to .0003%) of 100,000 dollars?   \nAnswer:  \n.30 cents.\n\nHere's a quarter and a nickel, now go vote for the activist judge I want.",
                "God, I’m sick of seeing this dumbfuck in a stupid hat and sunglasses.",
                "I really hate how nobody talked about this bullshit while it was happening",
                "Well, the letter said he would be arrested and handcuffed if he came here. What he posted was a felony in our state. And the cops here love to mix it up.",
                "Didn’t Elon do this several times during the presidential election?  How is this legal? Or even ethical?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "ICE detains University of Alabama doctoral student as government's college crackdown continues",
            "external_url": "https://www.nbcnews.com/news/us-news/university-alabama-doctoral-student-detained-ice-governments-college-c-rcna198320",
            "upvotes": 42615,
            "date": "03/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Alireza-Doroudi-mn-0745-bc5811.jpg",
            "top_comments": [
                "I remember hearing during winter break that exchange students should avoid going home because they might not be allowed back into the US.",
                "Whenever you get mad about this, remember that Congress (controlled by Republicans) could stop this at any time - and they choose not to because they like it.",
                "Where are the Don't Tread on Me guys now? This is rather...draconian.",
                "Man, I swear this is the kind of stuff that the right wing warned us would happen under liberal government....",
                "I earned my PhD a few years ago. One of the most stressful, engaging, and fucking stressful times of my life. To be suddenly deported? I can't imagine. So much of a PhD program is building and sustaining momentum. To be tanked out like this? These assholes are altering the lives of bright, intelligent, and young people.",
                "So we don't know where he is, what they say he's done, whether he has a lawyer, yet it's a \"crackdown\" as if there's something justifiable here in need of correction.\n\n\nFuck off. ",
                "Trump is making all of us less safe. He’s shredding the legal system and the constitution. And he’s crashing the economy.",
                "Abducted.  He was abducted not detained.",
                "This is 100% a trial run to cause some fear. This summer is going to have protests en masse and fully expect we'll start seeing even fully legal citizens start to disappear when those begin.",
                "This administration is lawless."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "U.S. turns to Europe for eggs to ease prices at home, but so far comes up empty-handed",
            "external_url": "https://www.cbsnews.com/news/egg-prices-us-europe-exports/",
            "upvotes": 2435,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/10/8b67d433-c1ec-4709-a5ad-5ffe86a0ab15/thumbnail/1200x630/5de92f083aafd8ea42c48e0bcf7711a7/gettyimages-2154882660.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Why would anyone want to help the US, at this point?",
                "Nobody is going to help. The word help is gone. My assumption is they don't outright say no, but are calling in demands for providing supplies. Trump works that way and he won't ever remember you \"helping\" him cause he feels he is entitled to that and deserves it. So, no... You want eggs well I want tariffs gone. No? Then go elsewhere for eggs.",
                "\"Greetings, former allies!\"",
                "Good. Don’t give us anything; we don’t deserve it.",
                "Why would any sovereign nation help the USA now? The government has abandoned all allies, is threatening their neighbors with invasion, and has begun an unnecessary trade war.\n\n\nI'm a citizen of the USA, and I say fuck our egg prices. The rest of the world will move on without us.",
                "Europeans: let them eat cake!",
                "Turns out the Carrot and Stick doesn't work if you have no carrot and the stick is flaccid.",
                "I often shit in my neighbors yard before I ask for sugar.",
                "i wonder what could’ve prevented this",
                "The US is just going to have to scrape the egg off their own faces.  There's plenty of it."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Kentucky GOP supermajority overrides nearly all of Democratic governor's vetoes in one day",
            "external_url": "https://www.lpm.org/news/2025-03-27/kentucky-gop-supermajority-overrides-nearly-all-beshear-vetoes-in-one-day",
            "upvotes": 9771,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/7c5bffd/2147483647/strip/true/crop/2000x1050+0+225/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F90%2F24%2Ff3fa41eb47ce80b17bbb1380f6e2%2Fjoe-morning-capitol.jpg",
            "top_comments": [
                "IIRC they didn't even need a supermajority to override a veto in Kentucky. \n\n\nIt's one of the few states where a simple majority overrides a veto.",
                "I was listening to a representative from Kentucky (not sure if Congressman or Senator) on Pod Save America. He was saying the impact on Bourbon sales was immediate and impactful to their economy. More interesting was his discussion about the Department of Education and Medicaid cuts. He said that the number 1 employer in most Kentucky towns is the school system, and the loss of block grants will require firing a lot of staff, and the number 2 employer is the local hospital which is funded by Medicaid. He also said 1/2 of the children in the state are covered by Medicaid.\n\nThe administration is targeting GOP voters for the most pain. Goofy.",
                ">another that would strip the state’s ability to regulate pollution in certain water sources.\n\nSo the \"Don't tread on me\" crowd is willingly ceding authority to the federal government they demonized for years because now the federal government is as aspirationally fascist as them.",
                "At least they have enough whiskey to drown in.",
                "Keep destroying that local economy Kentucky. ",
                "I hope they get everything they voted for.",
                "Most of these bill are bills that would hurt the people of Kentucky, so its time for those people to vote those representatives out.  That might mean voting for a democrat(oh no!) and if they don't then they get to suck it up and be happy with these horrible pieces of legislation.  Enjoy that brown water coming out of your tap.",
                ">Louisville Democrat Sen. Cassie Chambers Armstrong said these programs have already played out in other states and have hurt indigent Medicaid recipients who are already working but fail to fill out burdensome paperwork.\n\nPaperwork for billion $$ companies to prove they aren't destroying the environment or abusing workers rights = Bad\n\nPaperwork for a single mother working 2 jobs to support her kids = Good",
                "Gave them the power didn’t ya?",
                "If this continues, Kentucky won't exist by the end of trumps term."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Top vaccine official forced out of FDA",
            "external_url": "https://www.cnn.com/2025/03/28/health/fda-vaccine-peter-marks-resigns/index.html",
            "upvotes": 7,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1232822687.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Prepare for some serious epidemics (e.g., measles, MMR, influenza, COVID, etc.)."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport",
            "external_url": "https://www.cnn.com/2025/03/28/us/delta-military-jet-close-call-dca/index.html",
            "upvotes": 78,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This happened near the spot of the fatal plane collision 2 months ago.",
                "Why are they using commercial jets for training obstacles? Unconscionable. ",
                "I'm sure Pete Hegseth will see to this very quick-- ah nevermind. Good fucking luck, America.",
                "They should introduce some kind of incentive to avoid these kinds of mishaps.",
                "'...a review of tracking data from FlightRadar24 shows an Air Force T-38 jet flying past the Delta plane and DCA airport going more than *350 miles per hour at 800 feet*. The military jet took off and landed at Langley Air Force Base, in Hampton, Virginia.'\n\n*(emphasis* mine)"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
            "external_url": "https://www.bbc.com/news/articles/c62z2e5166eo",
            "upvotes": 442,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b881/live/81c00fe0-0c20-11f0-ad28-1164c064d080.jpg",
            "top_comments": [
                "That this piece of garbage, Andrew Tate, isn't rotting in prison, is proof that justice isn't fair.",
                "It’s always the ones you ~~least suspect~~ ~~most suspect~~ already knew about.",
                "Hope she wins the lawsuit",
                "I hope he’s bottom bunk in prison. ",
                "Me when the \"dating guru\" who claims to know everything about women is just a wife beater.",
                "Am I missing something?  The girlfriend sounds like a new one, not like a 2020 girlfriend right?\n\nLike a 2024 or 2025 girlfriend?",
                "Even if you didn't know who he was, what in the world would possess someone to look at THAT and want to smash?",
                "I'm shocked. SHOCKED! Well, not that shocked.",
                "It's always the people you most expect",
                "This has taught me the meaning of total surprise."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 2161,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "\"In the wallet\" is his weak point.",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "Not if he destroys the justice system first.",
                "I only wish I could stop hearing about fucking Elon Musk and fucking Donald Trump every fucking second of every fucking day in every fucking social media platform on the god damn fucking internet.",
                "A more cynical person might think this has something to do with the announced \"sale\" of Xitter. A desperate attempt to shield himself from any personal liability.",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "China blocks sale of Panama Canal shipping terminals to US investor: Reports",
            "external_url": "https://www.freightwaves.com/news/beijing-blocks-sale-of-panama-canal-shipping-terminals-to-us-investor-reports",
            "upvotes": 274,
            "date": "03/29/2025",
            "thumbnail": "https://www.freightwaves.com/uploads/2023/08/25/shutterstock_477438100-e1692983046745-1200x675.jpg",
            "top_comments": [
                "A DIGESTIBLE VERSION OF THE ARTICLE\n\n#China Throws a Spanner in the Works as US Eyes Panama Canal Ports\n\nIn a move that has ruffled feathers from Hong Kong to Washington, China appears to have slammed the brakes on a major port deal near the Panama Canal, leaving a high-stakes business agreement hanging in the balance.\n\nThe deal in question was supposed to see Hong Kong-based conglomerate CK Hutchison, owned by billionaire Li Ka-shing, sell off its global port operations outside China to a powerful US and European duo. The buyers? American investment giant BlackRock and TiL, the terminal arm of Swiss shipping heavyweight MSC. The price tag? A staggering 23 billion dollars.\n\nAmong the jewels in the crown were the key port terminals of Balboa and Cristobal, located at either end of the Panama Canal, a vital artery of world trade. The timing was no accident either. President Donald Trump has been vocal in recent months about his desire for the US to regain a strategic foothold in the region. The sale seemed to hand him a victory on a silver platter.\n\nBut just weeks after the plan was announced on 4 March, and with a 2 April deadline looming, Chinese government pressure seems to have upended the arrangement. Reports now suggest the signing will not go ahead as planned. While the deal is not officially dead, it is most certainly on life support.\n\nChina’s discomfort over the sale has been simmering for some time. According to Bloomberg, Beijing had already warned state-owned companies to steer clear of any new business linked to Li Ka-shing and his family. That quiet warning has now burst into the open, with state media and diplomatic murmurs throwing cold water over the entire transaction.\n\nThe Panama Canal has long been more than just a waterway. It is a symbol of global power and influence. China’s presence there, via CK Hutchison’s port operations, has irked Washington for years. Now, with Trump’s administration keen to shift the balance, this high-profile sale had all the makings of a geopolitical tug of war.\n\nFor now, the waiting game continues. The ports still sit in Panama, the ink is still dry on the contract, and the world watches as the great powers play their hand.",
                "We (Americans) have a disorganized government, flailing about on the world stage. Of course our competitors will take advantage of our weakness and pursue their own priorities.",
                "Trump and co-president Musk aren't going to like this...",
                "China should. The US is a joke.",
                "Well, that’s not a thing which is really up to them, is it?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin attorney general sues Musk over $2m election giveaway",
            "external_url": "https://www.bbc.com/news/articles/c8x4xd849eqo",
            "upvotes": 2418,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f204/live/d0db94a0-0c25-11f0-91f1-3bb93ded1c83.jpg",
            "top_comments": [
                "Someone help me understand why a violation of the law results in the Atty General filing a lawsuit, rather than law enforcement making an arrest?",
                "He's just doubling down on all the fraud and crimes now.",
                "When you're rich and you break the law, the government sues you.\n\nWhen you or I break the law, the government arrests us.\n\nThat's called \"small government\" by the 78 million of our Republican voting friends, family, coworkers, and neighbors.",
                "Remember when they wanted to say how handing out bottled water in election lines was bribery?",
                "Throw that fake nerd into jail",
                "Gee, what percentage is 1 million out of 337 billion? \n\nElon Musk has $337 Billion (as of March 27, 2025)  \n[https://engaging-data.com/how-rich-is-elon-musk/](https://engaging-data.com/how-rich-is-elon-musk/)\n\n# Answer:  0.000296736%\n\nJust to put that in real world perspective:\n\nWhat is 0.0003%  (rounding .000296736% to .0003%) of 100,000 dollars?   \nAnswer:  \n.30 cents.\n\nHere's a quarter and a nickel, now go vote for the activist judge I want.",
                "God, I’m sick of seeing this dumbfuck in a stupid hat and sunglasses.",
                "I really hate how nobody talked about this bullshit while it was happening",
                "Well, the letter said he would be arrested and handcuffed if he came here. What he posted was a felony in our state. And the cops here love to mix it up.",
                "Didn’t Elon do this several times during the presidential election?  How is this legal? Or even ethical?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Panama Canal ports sale has been put on hold by Chinese regulators",
            "external_url": "https://edition.cnn.com/2025/03/28/business/panama-canal-ports-deal-blocked/index.html",
            "upvotes": 95,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2197143001.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Before the regulators stepped in, the government pretty much ordered all Chinese businesses to boycott CK Hutchison (HK-based owner of ports) because of the deal",
                "This is a temporary bump. Even if the Chinese regulators disagree, this is in Panama.",
                "Growing up, I never thought I'd see the day I'm rooting for the chinese government.\n\nI'm glad to know now how much propoganda was the reason.",
                ">The deal, led by BlackRock, the world’s largest asset manager with an enormous pool of $11.6 trillion in assets, was announced earlier this month and was widely viewed as a way to ease tensions in the region.\n\nOh yeah, I'll bet that was it.",
                "Sadly I see this going one of three ways.\n\nCK Hutchison sells the ports.\n\nPanama nationalizes the ports and sells them.\n\nTrump gets distracted by something shiny and forgets about the canal.",
                "Why should Chinese regulators have any say over the sale of ports in Panama between a Cayman Island registered company (CK Hutchison) and a US company?",
                "the Chinese is meddling... oh shit we can't call them out now after what we have done,",
                "Why are Chinese regulators able to do things in the Panama Canal?"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "Russian researcher at Harvard being held after failing to declare frog embryos at customs",
            "external_url": "https://abcnews.go.com/US/russian-researcher-harvard-held-after-failing-declare-frog/story?id=120275976",
            "upvotes": 248,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/689d863a-ae49-45f7-8a7a-6fb2e4a3de5d/Petrova-1-ht-er-250328_1743192507251_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*\"Rather than imposing the appropriate monetary penalties for the customs violation, CBP improperly invoked their extensive immigration authority to impose a punishment grossly disproportionate to the situation,\" Petrova's attorney, Greg Romanovsky, said in a statement to ABC News.*\n\nOh I wonder what could possibly have inspired and gave assurance to this punitive over-reach.",
                ">*Ms. Petrova's situation is especially dire because the U.S. government is now seeking to deport her to Russia, where she faces the threat of immediate arrest due to her prior political activism and outspoken opposition to Russia's invasion of Ukraine*\n\nNormally such threat would actually be a reason for asylum, but...\n\n...embryos are persons now, thus .... no normal things to be expected soon.",
                "We're possibly going to deport a productive, highly educated, all around useful person and let her die in some horrible Russian gulag because of.... fucking frog embryos in jars...\n\nSomeone make all of this make sense.",
                "She was turning them gay wasn't she",
                "Yes, it can be a pain to import biologicals, but to do this in this environment speaks either to her scientific dedication or hubris. ",
                "\nwe’re turning  the friggin frog gay via ivf is the hottest conspiracy.",
                "Honestly I am surprised that her passport isn’t being treated like a get out of jail free card yet. ",
                "No fucking place to stay in Boston? Thrump customs enforcement is wasting millions.",
                "To be fair, there are good reasons why a lot of these regulations exist, but the way they were enforced is a whole other matter. It's like the woman here on a valid student visa who was \"arrested\" by ICE agents who were hiding their faces.",
                "Well, I suppose it's better than the virus samples coming from China that were undeclared awhile back"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Columbia University Interim President Katrina Armstrong Is Stepping Down",
            "external_url": "https://www.wsj.com/us-news/education/columbia-university-interim-president-katrina-armstrong-is-stepping-down-7644f880",
            "upvotes": 308,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Caves and then walks, prob with a very strong compensation package",
                "Anyone who would want that job is someone they should not want to hire.",
                "golden parachute out of the ivory tower",
                "Katrina Armstrong came from the Medical School and is fighting to preserve Med School funding. \n\nShe is probably being forced out by other faculty who want to fight.",
                "What do we think it’s gonna be, she couldn’t take it or the board forced her out? ",
                "Good. She was acting like a clown. Bowing down is a dumb way to approach a fascist.",
                "She's lost all credibility from now until the end of time. She had to step down.",
                "I hope their international student admission numbers **plummet** after this incident.",
                "The political situation at Columbia on at least a few fronts is so tough that even Interim Presidents step down.",
                "I don't know which actually qualified person would want to take this on right now and how much you'd have to pay them to make it worth the immense risk.\n\nYou're just going to be squeezed between increasingly hostile protestors who will target you and a facist government that is going to target you with a state monopoly on violence and a university that will be happy to heap the blame on you for failures to either comply with the government or address the concerns of the student body.\n\nGoodluck!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump signs order ending union bargaining rights for wide swaths of federal employees",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5343474/trump-collective-bargaining-unions-federal-employees",
            "upvotes": 4236,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5313x2989+0+216/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fb4%2Fb1a0c5b24f54b1e0156c71e26852%2Fgettyimages-2202711755.jpg",
            "top_comments": [
                "Friend is a federal prison guard and he’s boiling over this. However, he did volunteer that “We all voted for him and now he does this to us….•",
                "Is anyone really surprised, this was explicitly called out in project 2025",
                "I'm sure this will come as quite the surprise to all the union members who voted for him.  \n I mean who could expect a guy who attacked unions over and over again, including federal unions in his last term, and who praised Musk for firing people who attempted to unionize would possibly do this?!",
                "I suspect the administration will begin to treat attempts at unionizing to be domestic terrorism soon.",
                "How can these people that voted for him not have seen this?  You idiots who voted for him willingly invited this as everyone else screamed at you that you're being conned in the most graceless,  obvious manner.",
                "Gotta think that’s not legal.\nSupreme Court better act quick ",
                "And how many of those Maga employees voted for Trump. Poetic.",
                "To be fair, he did say that he would be bringing DOGE in to \"do for the government what Elon did for Twitter\".  They're now doing exactly what they promised to do.  I'm all out of violins for the people that voted for him, or just couldn't get off their butts to vote against him, and are now getting what they were promised. \n\nThat being said, it's a shame that the folks who saw it coming and voted against Trump are now suffering for the actions of others.",
                "Everyone that \"used\" to be in the union should suddenly stop working.  Since they are not in a union it cannot be called a strike, but by golly it might have the same effect.",
                "The funny thing is unless we are introducing slavery you cannot force a group of people to work."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 2161,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "\"In the wallet\" is his weak point.",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "Not if he destroys the justice system first.",
                "I only wish I could stop hearing about fucking Elon Musk and fucking Donald Trump every fucking second of every fucking day in every fucking social media platform on the god damn fucking internet.",
                "A more cynical person might think this has something to do with the announced \"sale\" of Xitter. A desperate attempt to shield himself from any personal liability.",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin attorney general sues Musk over $2m election giveaway",
            "external_url": "https://www.bbc.com/news/articles/c8x4xd849eqo",
            "upvotes": 2421,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f204/live/d0db94a0-0c25-11f0-91f1-3bb93ded1c83.jpg",
            "top_comments": [
                "Someone help me understand why a violation of the law results in the Atty General filing a lawsuit, rather than law enforcement making an arrest?",
                "He's just doubling down on all the fraud and crimes now.",
                "When you're rich and you break the law, the government sues you.\n\nWhen you or I break the law, the government arrests us.\n\nThat's called \"small government\" by the 78 million of our Republican voting friends, family, coworkers, and neighbors.",
                "Remember when they wanted to say how handing out bottled water in election lines was bribery?",
                "Throw that fake nerd into jail",
                "Gee, what percentage is 1 million out of 337 billion? \n\nElon Musk has $337 Billion (as of March 27, 2025)  \n[https://engaging-data.com/how-rich-is-elon-musk/](https://engaging-data.com/how-rich-is-elon-musk/)\n\n# Answer:  0.000296736%\n\nJust to put that in real world perspective:\n\nWhat is 0.0003%  (rounding .000296736% to .0003%) of 100,000 dollars?   \nAnswer:  \n.30 cents.\n\nHere's a quarter and a nickel, now go vote for the activist judge I want.",
                "God, I’m sick of seeing this dumbfuck in a stupid hat and sunglasses.",
                "I really hate how nobody talked about this bullshit while it was happening",
                "Well, the letter said he would be arrested and handcuffed if he came here. What he posted was a felony in our state. And the cops here love to mix it up.",
                "Didn’t Elon do this several times during the presidential election?  How is this legal? Or even ethical?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
            "external_url": "https://www.bbc.com/news/articles/c62z2e5166eo",
            "upvotes": 445,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b881/live/81c00fe0-0c20-11f0-ad28-1164c064d080.jpg",
            "top_comments": [
                "That this piece of garbage, Andrew Tate, isn't rotting in prison, is proof that justice isn't fair.",
                "It’s always the ones you ~~least suspect~~ ~~most suspect~~ already knew about.",
                "Hope she wins the lawsuit",
                "I hope he’s bottom bunk in prison. ",
                "Me when the \"dating guru\" who claims to know everything about women is just a wife beater.",
                "Am I missing something?  The girlfriend sounds like a new one, not like a 2020 girlfriend right?\n\nLike a 2024 or 2025 girlfriend?",
                "Even if you didn't know who he was, what in the world would possess someone to look at THAT and want to smash?",
                "I'm shocked. SHOCKED! Well, not that shocked.",
                "It's always the people you most expect",
                "This has taught me the meaning of total surprise."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "China blocks sale of Panama Canal shipping terminals to US investor: Reports",
            "external_url": "https://www.freightwaves.com/news/beijing-blocks-sale-of-panama-canal-shipping-terminals-to-us-investor-reports",
            "upvotes": 269,
            "date": "03/29/2025",
            "thumbnail": "https://www.freightwaves.com/uploads/2023/08/25/shutterstock_477438100-e1692983046745-1200x675.jpg",
            "top_comments": [
                "A DIGESTIBLE VERSION OF THE ARTICLE\n\n#China Throws a Spanner in the Works as US Eyes Panama Canal Ports\n\nIn a move that has ruffled feathers from Hong Kong to Washington, China appears to have slammed the brakes on a major port deal near the Panama Canal, leaving a high-stakes business agreement hanging in the balance.\n\nThe deal in question was supposed to see Hong Kong-based conglomerate CK Hutchison, owned by billionaire Li Ka-shing, sell off its global port operations outside China to a powerful US and European duo. The buyers? American investment giant BlackRock and TiL, the terminal arm of Swiss shipping heavyweight MSC. The price tag? A staggering 23 billion dollars.\n\nAmong the jewels in the crown were the key port terminals of Balboa and Cristobal, located at either end of the Panama Canal, a vital artery of world trade. The timing was no accident either. President Donald Trump has been vocal in recent months about his desire for the US to regain a strategic foothold in the region. The sale seemed to hand him a victory on a silver platter.\n\nBut just weeks after the plan was announced on 4 March, and with a 2 April deadline looming, Chinese government pressure seems to have upended the arrangement. Reports now suggest the signing will not go ahead as planned. While the deal is not officially dead, it is most certainly on life support.\n\nChina’s discomfort over the sale has been simmering for some time. According to Bloomberg, Beijing had already warned state-owned companies to steer clear of any new business linked to Li Ka-shing and his family. That quiet warning has now burst into the open, with state media and diplomatic murmurs throwing cold water over the entire transaction.\n\nThe Panama Canal has long been more than just a waterway. It is a symbol of global power and influence. China’s presence there, via CK Hutchison’s port operations, has irked Washington for years. Now, with Trump’s administration keen to shift the balance, this high-profile sale had all the makings of a geopolitical tug of war.\n\nFor now, the waiting game continues. The ports still sit in Panama, the ink is still dry on the contract, and the world watches as the great powers play their hand.",
                "We (Americans) have a disorganized government, flailing about on the world stage. Of course our competitors will take advantage of our weakness and pursue their own priorities.",
                "Trump and co-president Musk aren't going to like this...",
                "China should. The US is a joke.",
                "Well, that’s not a thing which is really up to them, is it?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 20385,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Dude, you're the attorney general. Just arrest the fucker.",
                "Arrest his punk ass as soon as he lands.",
                "I don't understand why we're \"suing\" people for committing felonies. What happened to arresting them?",
                "Sued, but not arrested for oh I don’t know….breaking a 💩 load of laws 🤔"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump signs order ending union bargaining rights for wide swaths of federal employees",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5343474/trump-collective-bargaining-unions-federal-employees",
            "upvotes": 4238,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5313x2989+0+216/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fb4%2Fb1a0c5b24f54b1e0156c71e26852%2Fgettyimages-2202711755.jpg",
            "top_comments": [
                "Friend is a federal prison guard and he’s boiling over this. However, he did volunteer that “We all voted for him and now he does this to us….•",
                "Is anyone really surprised, this was explicitly called out in project 2025",
                "I'm sure this will come as quite the surprise to all the union members who voted for him.  \n I mean who could expect a guy who attacked unions over and over again, including federal unions in his last term, and who praised Musk for firing people who attempted to unionize would possibly do this?!",
                "I suspect the administration will begin to treat attempts at unionizing to be domestic terrorism soon.",
                "How can these people that voted for him not have seen this?  You idiots who voted for him willingly invited this as everyone else screamed at you that you're being conned in the most graceless,  obvious manner.",
                "Gotta think that’s not legal.\nSupreme Court better act quick ",
                "And how many of those Maga employees voted for Trump. Poetic.",
                "To be fair, he did say that he would be bringing DOGE in to \"do for the government what Elon did for Twitter\".  They're now doing exactly what they promised to do.  I'm all out of violins for the people that voted for him, or just couldn't get off their butts to vote against him, and are now getting what they were promised. \n\nThat being said, it's a shame that the folks who saw it coming and voted against Trump are now suffering for the actions of others.",
                "Everyone that \"used\" to be in the union should suddenly stop working.  Since they are not in a union it cannot be called a strike, but by golly it might have the same effect.",
                "The funny thing is unless we are introducing slavery you cannot force a group of people to work."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "U.S. turns to Europe for eggs to ease prices at home, but so far comes up empty-handed",
            "external_url": "https://www.cbsnews.com/news/egg-prices-us-europe-exports/",
            "upvotes": 2443,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/10/8b67d433-c1ec-4709-a5ad-5ffe86a0ab15/thumbnail/1200x630/5de92f083aafd8ea42c48e0bcf7711a7/gettyimages-2154882660.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Why would anyone want to help the US, at this point?",
                "Nobody is going to help. The word help is gone. My assumption is they don't outright say no, but are calling in demands for providing supplies. Trump works that way and he won't ever remember you \"helping\" him cause he feels he is entitled to that and deserves it. So, no... You want eggs well I want tariffs gone. No? Then go elsewhere for eggs.",
                "\"Greetings, former allies!\"",
                "Good. Don’t give us anything; we don’t deserve it.",
                "Why would any sovereign nation help the USA now? The government has abandoned all allies, is threatening their neighbors with invasion, and has begun an unnecessary trade war.\n\n\nI'm a citizen of the USA, and I say fuck our egg prices. The rest of the world will move on without us.",
                "Europeans: let them eat cake!",
                "Turns out the Carrot and Stick doesn't work if you have no carrot and the stick is flaccid.",
                "I often shit in my neighbors yard before I ask for sugar.",
                "i wonder what could’ve prevented this",
                "The US is just going to have to scrape the egg off their own faces.  There's plenty of it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Russian researcher at Harvard being held after failing to declare frog embryos at customs",
            "external_url": "https://abcnews.go.com/US/russian-researcher-harvard-held-after-failing-declare-frog/story?id=120275976",
            "upvotes": 245,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/689d863a-ae49-45f7-8a7a-6fb2e4a3de5d/Petrova-1-ht-er-250328_1743192507251_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*\"Rather than imposing the appropriate monetary penalties for the customs violation, CBP improperly invoked their extensive immigration authority to impose a punishment grossly disproportionate to the situation,\" Petrova's attorney, Greg Romanovsky, said in a statement to ABC News.*\n\nOh I wonder what could possibly have inspired and gave assurance to this punitive over-reach.",
                ">*Ms. Petrova's situation is especially dire because the U.S. government is now seeking to deport her to Russia, where she faces the threat of immediate arrest due to her prior political activism and outspoken opposition to Russia's invasion of Ukraine*\n\nNormally such threat would actually be a reason for asylum, but...\n\n...embryos are persons now, thus .... no normal things to be expected soon.",
                "We're possibly going to deport a productive, highly educated, all around useful person and let her die in some horrible Russian gulag because of.... fucking frog embryos in jars...\n\nSomeone make all of this make sense.",
                "She was turning them gay wasn't she",
                "Yes, it can be a pain to import biologicals, but to do this in this environment speaks either to her scientific dedication or hubris. ",
                "\nwe’re turning  the friggin frog gay via ivf is the hottest conspiracy.",
                "Honestly I am surprised that her passport isn’t being treated like a get out of jail free card yet. ",
                "No fucking place to stay in Boston? Thrump customs enforcement is wasting millions.",
                "To be fair, there are good reasons why a lot of these regulations exist, but the way they were enforced is a whole other matter. It's like the woman here on a valid student visa who was \"arrested\" by ICE agents who were hiding their faces.",
                "Well, I suppose it's better than the virus samples coming from China that were undeclared awhile back"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Over 2000 protest in wake of student detainment",
            "external_url": "https://www.tuftsdaily.com/article/2025/03/over-2000-protest-in-wake-of-student-detainment",
            "upvotes": 2274,
            "date": "03/28/2025",
            "thumbnail": "https://snworksceo.imgix.net/ttd/892ebf50-7170-4741-bd2d-38007efd0704.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "It’s a relief to see that people are standing up, if nothing else. Not much to feel happy about these days",
                "This is response to this video of a PhD student being abducted by ICE for writing an op-ed in the school newspaper. She committed no crime. She is in the US legally \n\n\nEven if you disagree with her opinion, she has a right to say it.\n\n\n\nhttps://www.youtube.com/watch?v=PuFIs7OkzYY",
                "I have family in the country legally with visas and they are terrified this will happen to them.",
                "Don't stop protesting until they undo it, otherwise you're wasting your time.",
                "Don't stop protesting boycotting, or this country will fall to government power abuse.",
                "I applaud them for their bravery. We need to continue to speak truth to power.",
                "*“It is the immigrant communities, the undocumented communities, the working communities who are leading this struggle for our own liberation,” another said earlier.   Local residents of all ages attended the protest in addition to Tufts students, faculty and staff.*\n\nThe voices of connection vs the voices of FEAR, Repression, and Detainment.",
                "Remember, the early propaganda of the Hitler regime was demonizing Jewish people as 'dangerous foreigners/criminal immigrants'.",
                "At least some students have some courage to protest!?  The rest of us are pitiful and lazy!",
                "Good job guys! Well done. Let's get her back!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Measles update: Texas reports West Texas outbreak has seen 400 cases since January",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-03-28/measles-update-texas-reports-west-texas-outbreak-has-seen-400-cases-since-january",
            "upvotes": 551,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/1ee44ea/2147483647/strip/true/crop/5124x2690+0+1230/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe5%2F38%2F4e68a43243a7874e2fea5a65d696%2F2024-10-11t000000z-566783405-mt1imgost000rstxjp-rtrmadp-3-imago-images.JPG",
            "top_comments": [
                "You call it measles, Texans call it Freedom Cough",
                "Remember, denying vaccines was never about safety.\n\nIt's because scientists are the enemy, and the enemy is never allowed to be right about something.",
                "Well this is a interesting thing to watch.  The most infectious disease on the planet to date versus a mostly vaccinated public.  So it looks like it will just sit there and simmer.  Never going away and never getting free.  Unless it mutates that is.",
                "This update adds 73 cases to the number of reported cases in Texas associated with the outbreak. Tuesday’s update added 18 cases. Last Friday's update added 30 cases. Last Tuesday’s update added 20 new cases.\n\nOne new hospitalization (up to 41 from 40) was reported, while no new deaths were reported for Texas.",
                "Kansas has begun reporting cases that are, according to authorities, possibly linked to the Texas outbreak. They reported 10 cases last Friday and reported 13 additional cases yesterday.\n\nhttps://www.kansas.com/news/state/article302927824.html\n\nKansas will be updating their case counts on Wednesdays.",
                "Their Vitamin A supplements from Amazon must have been delayed",
                "Texans must enjoy catching measles.  After all, it really is \"no big deal\" to them.",
                "It's now in 20 states. The total for the country is 483 cases as of March 27th. \n\n[https://www.cdc.gov/measles/data-research/index.html#cdc\\_data\\_surveillance\\_section\\_10-measles-cases-in-2025](https://www.cdc.gov/measles/data-research/index.html#cdc_data_surveillance_section_10-measles-cases-in-2025)",
                "MAHA is a death cult. This is so obvious.",
                "And this should have been preventable!"
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "03/29/2025 04:10:31 UTC"
}