{
    "posts": [
        {
            "category": "HOT",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 11966,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "Just waiting for polio to make a comeback. I’ve already bought stock in iron lung manufacturers.",
                "Measles outbreaks = making America great Again.",
                "Anti vaccine folks, wake up to science."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Bay Area's oldest prison is getting a Scandinavian makeover",
            "external_url": "https://www.sfgate.com/bayarea/article/california-oldest-prison-scandinavian-makeover-20267618.php",
            "upvotes": 1361,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"The project draws inspiration from Scandinavian incarceration models that prioritize dignity, autonomy and reintegration. This approach has been linked to lower recidivism rates, as Norway’s two-year rate is [17.6%](https://www.sciencedirect.com/science/article/pii/S0047235223000867), compared with 61.5% in the U.S.\"\n\nThat's a significant reduction, by anyone's standards. I hope it works, and that they use it as a blueprint for more comprehensive prison reform.",
                "San Quentin is getting the Ikea treatment?",
                "It will be interesting to see how this works.",
                "It might be based on this project. https://www.youtube.com/watch?v=gTC1KI0STIY",
                "Seems they're aiming to give It a bigger Focus on rehabilitation? It could be good ^^",
                "Exciting!  I hope this works well in CA so it can be expanded nation wide",
                "That’s bound to piss off so many Conservatives. “Bad” people getting humane treatment, not to mention probably non-whites in that bunch, too.",
                "I think this could work but they need to be low level first time offenders. Plus this a west coast prison and they are usually very racially segregated.",
                "This is awesome. Great to see this happening in America.",
                "Presenting “fengsel” by IKEA"
            ],
            "aggregate_sentiment": 51.0
        },
        {
            "category": "HOT",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 1334,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 1509,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "Just another day in the land of the freedumb.",
                "At least he didn't die on a subway",
                "[deleted]",
                "Something something.. when your top assassin wants to quit just let him go."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Placed Before the Memo: Suspicious AAPL Options Bet on a Policy Shift That Hadn't Happened Yet",
            "external_url": "https://www.democraticunderground.com/100220232748",
            "upvotes": 358,
            "date": "04/13/2025",
            "thumbnail": "https://www.democraticunderground.com/imgs/du100x100.gif",
            "top_comments": [
                "Oh look, open and shut case of illegal insider trading, good thing the Justice Department is doing it too, so it won't be prosecuted.",
                "Also, the insanity in its linked article about this week’s once-in-4400-days bets.",
                "How can  you trust in the American currency value when rules don't exist?",
                "It's actually somewhat comforting to think his goal is making his taint kissers rich, rather than destabilize the country."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 12083,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "[Don't Call the Police](https://dontcallthepolice.com)",
                "Cops are not trained to deal with people who have disabilities or are autistic.  I used to work with adults who were autistic, we had a neighbor of the group home call the cops because someone was being loud. Cops came out, they kept on yelling at him to follow orders. They were about to shoot him until we came out, a case worker and myself. Had to intervene and tell the cops he couldn't understand them; he was autistic. They arrested him; later the sheriff's dept decided it was a brilliant idea to release him in the middle of the night. No vehicle. No phone for us to track his location. He had to walk next to the highway for hours in the rain until we found him sitting down beside a street drenched in rain. There needs to be accountability and retraining for their officers. This is beyond bs.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "Never point a cop at anything you don't intend to kill.",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione defense asks judge to block death penalty in CEO slay case",
            "external_url": "https://www.cnbc.com/2025/04/11/luigi-mangione-death-penalty-brian-thompson-case.html",
            "upvotes": 48282,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105908-17401702152025-02-21t202801z_1440528033_rc27zcal85co_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "“The Attorney General's television appearance was similar to her first two public statements\nin that she never mentioned that Mr. Mangione was **not indicted** nor that he has the presumption of innocence. \n\nShe emphasized, for the third time, that her decision to seek the death penalty was based on the President's directive, specifically that the administration will seek the death sentence \"whenever possible.\" She then invoked her personal experience, saying that she was a capital prosecutor, who tried death penalty cases and that \"If there was ever a death case, this is one.\" **The Attorney General stated during her television appearance that a reason she ordered the death sentence was because the alleged victim was a CEO. Counsel is aware of no provision in the death penalty statute or in the Department of Justice's death penalty protocol that allows for consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.”**\n\nI encourage everyone to read the motion, it makes some strong points.",
                "I'd publicly ask for a pardon while I was at it. Just to get it on record.",
                "Why does he need a cop breathing down his neck in every shot lmao. They just get closer and closer every time I see him it's getting a bit intimate. By the time Luigi actually receives his sentence, half the precinct is going to be on his lap.",
                "This trial is gonna be a whole media spectacle. I wonder what the reaction from the oligarchs will be if the jury refuses to convict him.",
                "But Pammy doesn’t care about the husband and father they “accidentally sent” to a brutal prison in El Salvador and refuses to get him removed.",
                "I'm still wondering how hard jury selection will be for this. It's going to be difficult considering how many people have strong opinions about the healthcare industry.",
                ">Counsel is aware of **no** provision in the death\npenalty statute or in the Department of Justice’s death penalty protocol that allows for\n**consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.**\n\n>Rather than relying on these reasons, **the Attorney General cited the professional status of\nthe victim as a CEO**, the fact that the previous administration had not sought the death penalty in\nfour years and that her decision to order it here was due to the **president’s policy to “Make America Safe Again.” **Also, if the death penalty was being ordered pursuant to policy instead of publicity, the** Attorney General would not have put her directive in the form of a press release followed by an Instagram post that effectively launched a new government social media account.**\n\nSome excellent points by his attorneys.",
                "When are they going to go after the people that killed the Boeing Whistleblowers?",
                "Absolutely crazy that from the start he’s been treated as guilty. What happened to due process?",
                "Didn't Trump already pardon him when he said, \"if it's good for the country, it's not illegal\"?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 8600,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [
                ">Khalil, who has a green card, is a lawful permanent resident. In ordering Khalil's deportation, Rubio relied on a rarely used federal statute from the 1950s that played a major role in shaping American immigration during the Cold War. The McCarran-Walter Act, or the Immigration Nationality Act of 1952, gives the secretary of state authority to decide that a noncitizen's presence in the United States threatens the country's foreign policy goals.\n\nJust what are America's foreign policy goals?",
                "If lawful permanent residents can be deported for exercising their first amendment rights, don't fool yourself, citizens can be next.",
                "ICE is moving people to states with friendly judges for kangaroo like courts",
                "The depressing thing is that \"deported\" now can mean sent back to your country of origin or locked up for life in a Salvadoran black site with no hope of anyone ever seeing you alive again.\n\nEdit: I still can't believe our media has played along with that abuse of language. It's not \"deporting\" someone to imprison them for life without trial in a foreign country.",
                "During the Red Scare the United States exiled such brilliant minds as native US citizen Frank Malina, one of the founders of CalTech’s Jet Propulsion Laboratory, for having ties to Communism. \n\nWe’re doing it again. ",
                "Congratulations, the first amendment and due process no longer matter in America. This is truly unbelievable that a judge would allow the SoS to violate someone’s constitutional rights so blatantly.",
                "“Criminal” migrants\n\n“Illegal” migrants\n\nPermanent residents  <- We are here\n\nNaturalized citizens\n\n“Criminal” citizens\n\n“Dissenting” citizens\n\nDemocrats\n\nAnyone who opposes Trump\n\nIf you think this isn’t the natural progression, wake the fuck up. This has happened before more than once throughout history.",
                "Louisiana judge.  They moved him there to avoid NE judges.  \n\nThis is why they grab people off the street and fly them to LA.",
                "This is an immigration judge.  There is also a case in federal court.",
                "Just remember folks, you might think you're safe because you are a US citizen. But there is already precedence for \"accidently\" sending a citizen to El Salvador and then claiming they can't do anything to get them back."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man has sex with corpse on NYC subway, sources say",
            "external_url": "https://www.nbcnewyork.com/new-york-city/man-sex-corpse-nyc-subway-video-r-train-body/6220060/",
            "upvotes": 13399,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/r-train-body.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Wait... so it sounds like this guy didn't bring the corpse there. Like, someone died on the subway, and someone decided to sexually assault the body.",
                "Well that's a new thought I should've never had \n\n\"Boy I sure hope I don't die on a train in New York.Wont even be able to rest peacefully.\"",
                "I wonder what the possible range of sentences in NYC for public necrophilia is.\n\nI also wonder what led us to the point in society where I can use 'public necrophilia' in a sentence and have it be 100% serious (and relevant).",
                "How does this decision process even work? You're in New York, for whatever reason you're a necrophiliac....You're out shopping, because I imagine necrophiliacs still need certain essentials, you take the Subway..\n\n\"Dear diary...JACKPOT.\"",
                "Can you imagine being the cops watching the surveillance video to see what happened to the dead guy and then seeing this whole sordid tale play out? ",
                "\"Investigators believe the body may have been on the train for hours...\"\n\nWhy are there so many NYPD cops down there then? Couldn't stop a shooting, a woman being burned alive, a dead person being violated sexually, etc. Literally what the fuck do they actually do besides play games on their phones like the adult versions of iPad babies?",
                ">“It's believed the entire assault... took several minutes.”\n\nGoodness... it's truly shocking to think about how long this went on, and I can't even fathom the level of depravity required to commit such an act, it's absolutely sickening, and I just hope that whoever did this is caught and brought to justice quickly, seriously, what kind of person does something like that?",
                "And I thought “fake Down’s syndrome influencers created with AI to promote onlyfans” was the worst news story I’d read this week, but nope, necrophilia had to come in & lower the bar",
                "Not even Florida Man will top that.",
                "JFC...what a terrible day to be literate"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Trump orders probes of two former officials who defied him",
            "external_url": "https://www.nbcnews.com/politics/national-security/trump-orders-probes-two-former-officials-defied-rcna200523?utm_source=NBC&utm_medium=iframely",
            "upvotes": 6256,
            "date": "04/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-05/230531-Christopher-Krebs-mjf-1024-27e3cc.jpg",
            "top_comments": [
                "Here it is from the horse’s mouth: https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/\n\nOfficial white house communication is starting to read like a ”conservative” news outlet.\n\n“Unite America” my ass.",
                "Dictator doing Dictator things ",
                "Trump, you stupid, fat, dumb, fat idiot, why don’t you do something to help this country? Like stuffing your fat fucking face with Big Macs till the cholesterol tipping point hits. ",
                "Kim Jong Trump on duty.\n\nThe USA is the most ludicrous country in existence. Becoming a dictatorship by founding a cult around one of the shittiest people you can find on earth and then elect this person twice.",
                "Dolores Trumpbridge : I am **a** tolerant man, but the **one thing** I will not **stand** for is **disloyalty!**",
                "Something like this has never happened in America before. The man who for years wailed and called his rightful prosecution a witch hunt is now sicing the DOJ right after his perceived enemies. \n\nFor someone who can't help but commit crimes, you'd think this is something he'll refrain from. Except he plans to die in office, Trump will still face the law coming after him when he leaves the white house and this time, under an attorney general who has no fucks to give. \n\nLike clockwork, he will go back to screaming witchhunt again but will he have the slimy skunk shit who refer to themselves as maga come out for him again? I think not. \n\nTrump cannot end well. His actions have made that impossible. He will keep looking over his back for the rest of his life. Him being in the whitehouse just makes that impractical now but it will happen.",
                "Petty vindictive behavior like this looks like weakness. People with confidence and strength don’t need to lash out at others.",
                "If I recall \"Just following orders\" is not a valid defense.",
                "Imagine giving power to this biblical level criminal. Again.",
                "This is one of the most terrifying things they have done yet. He named two private citizens by name, and ordered an investigation for treason because they had the temerity to be critical of the ~~regime~~ administration. And a reminder that treason is a capital offense."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Placed Before the Memo: Suspicious AAPL Options Bet on a Policy Shift That Hadn't Happened Yet",
            "external_url": "https://www.democraticunderground.com/100220232748",
            "upvotes": 354,
            "date": "04/13/2025",
            "thumbnail": "https://www.democraticunderground.com/imgs/du100x100.gif",
            "top_comments": [
                "Oh look, open and shut case of illegal insider trading, good thing the Justice Department is doing it too, so it won't be prosecuted.",
                "Also, the insanity in its linked article about this week’s once-in-4400-days bets.",
                "How can  you trust in the American currency value when rules don't exist?",
                "It's actually somewhat comforting to think his goal is making his taint kissers rich, rather than destabilize the country."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Bay Area's oldest prison is getting a Scandinavian makeover",
            "external_url": "https://www.sfgate.com/bayarea/article/california-oldest-prison-scandinavian-makeover-20267618.php",
            "upvotes": 1364,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"The project draws inspiration from Scandinavian incarceration models that prioritize dignity, autonomy and reintegration. This approach has been linked to lower recidivism rates, as Norway’s two-year rate is [17.6%](https://www.sciencedirect.com/science/article/pii/S0047235223000867), compared with 61.5% in the U.S.\"\n\nThat's a significant reduction, by anyone's standards. I hope it works, and that they use it as a blueprint for more comprehensive prison reform.",
                "San Quentin is getting the Ikea treatment?",
                "It will be interesting to see how this works.",
                "It might be based on this project. https://www.youtube.com/watch?v=gTC1KI0STIY",
                "Seems they're aiming to give It a bigger Focus on rehabilitation? It could be good ^^",
                "Exciting!  I hope this works well in CA so it can be expanded nation wide",
                "That’s bound to piss off so many Conservatives. “Bad” people getting humane treatment, not to mention probably non-whites in that bunch, too.",
                "I think this could work but they need to be low level first time offenders. Plus this a west coast prison and they are usually very racially segregated.",
                "This is awesome. Great to see this happening in America.",
                "Presenting “fengsel” by IKEA"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 11963,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "Just waiting for polio to make a comeback. I’ve already bought stock in iron lung manufacturers.",
                "Measles outbreaks = making America great Again.",
                "Anti vaccine folks, wake up to science."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 1328,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 1513,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "Just another day in the land of the freedumb.",
                "At least he didn't die on a subway",
                "[deleted]",
                "Something something.. when your top assassin wants to quit just let him go."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 12087,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "[Don't Call the Police](https://dontcallthepolice.com)",
                "Cops are not trained to deal with people who have disabilities or are autistic.  I used to work with adults who were autistic, we had a neighbor of the group home call the cops because someone was being loud. Cops came out, they kept on yelling at him to follow orders. They were about to shoot him until we came out, a case worker and myself. Had to intervene and tell the cops he couldn't understand them; he was autistic. They arrested him; later the sheriff's dept decided it was a brilliant idea to release him in the middle of the night. No vehicle. No phone for us to track his location. He had to walk next to the highway for hours in the rain until we found him sitting down beside a street drenched in rain. There needs to be accountability and retraining for their officers. This is beyond bs.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "Never point a cop at anything you don't intend to kill.",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Judge rules Menendez brothers resentencing bid can move forward",
            "external_url": "https://www.bbc.com/news/articles/cp8kmrg1p8go",
            "upvotes": 843,
            "date": "04/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ea13/live/f5ca4e00-15b7-11f0-a658-83a7b9f03655.jpg",
            "top_comments": [
                "Oh this should be interesting",
                "If the sons were right about the fathers' sexual abuse as motive for the killing,  then they served more than enough time--but then again why kill the mother too (her silence doesn't seem like a good reason for guys who were young adults around 20 years old)",
                "Lets just go straight to Trump issuing some sort of pardon and giving them a medal on the ~~used car lot~~ Rose Lawn.",
                "These are the guys who said it was a mafia hit before one of them told their srink. And people actually believe them how gullible are you guys",
                "There's zero question about what the father did, there's already been another accuser independent of the brothers",
                "\"We wouldn't want this to ruin the lives of these two boys.  I'm going to pardon them\" - You know exactly who.",
                "I personally just don't know how you don't let them out if Gypsy Rose was let out.",
                "Yeah no, if you’re being abused you wouldn’t say they were murdered by the mob and change the story when it’s convenient",
                "Basically it came down to the boys wanting to be rid of their parents, but to not risk losing out on their wealth and inheritance.  It appears as though they planned this murder to accomplish that - which is why it seems to have been premeditated (and why they didn’t just leave the household to stop the abuse from continuing)",
                "[deleted]"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "In One Colorado Town, People Experiencing Homelessness Can Sleep in Their Car — if They Have a Job",
            "external_url": "https://www.nytimes.com/2025/04/11/realestate/colorado-homeless-parking-lot-affordable-housing.html?unlocked_article_code=1.-04.9C5S.OB5RRj2hZlYR&smid=url-share",
            "upvotes": 1731,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Here in cars, trucks and vans, behind foggy windshields and zipped in sleeping bags, those who serve the vacationers who come to enjoy the snow tried to fall asleep on a recent night — two ski instructors, two snow plow drivers, a ski lift operator, an ice fishing guide, a dog sledding guide, the employee of a ski resort whose job includes scanning ski passes, two ER nurses who treat their injuries, a cashier at a drugstore, multiple servers at local restaurants, as well as Kristine Litchfield, who earns $24 an hour at a ski shop fitting people for their boots.\n\nThe cost of living affordability crisis is real. People demonize the homeless because it's easier than facing how easy it is to become homeless these days.",
                "Working homeless is a thing, sadly.\n\nWorst offender is Disneyland. Multi-billion dollar parent company, profitable theme parks, has workers who cannot afford a place and also has a community funded food pantry for the workers.",
                "I HATE that they harass people sleeping in their cars! Giant empty store parking lots patrolled by security and police kicking people out for what?! What are they going to do to cement?",
                "And I'm sure they provide facilities for homeless in exchange of this ridiculous arbitrary decision right?\n\nRight?",
                "It's ok to be homeless but only if you have a job is some next level dystopian bullshit",
                "So if I download the Uber Driver app, does this mean I can sleep in my car at this one Colorado town?",
                "Someone should form a non-profit. And they should hire every single homeless person in town, for 1 minute a day per year.  Or, you know, more If they can find some stuff for people to do. \n\nAs I have seen mentioned many times, there is plenty of work to be done. There are just no jobs to do those things because nobody can make a profit on getting them done.",
                "Maybe this is a weird question, but if you own a parking lot, can you decide whether people can sleep in their cars in it or is there some law or regulation that supersedes property rights in many places?\n\nThe reason I ask is why would strip malls or other places with parking lots not just charge like $5 from like 9pm to 7am to sleep in your car? You aren’t making any money during those hours anyway so it’s basically found revenue. And the agreement is just that at 7am the car has to leave for the day.",
                "Man i know this is not the point of the thread BUT i spent years trying to live out of my car in the Bay Area only to constantly be awoken by security or law enforcement at anywhere from public streets to gym, hotel, and walmart parking spaces.  I had a decent paying daytime job that I thoroughly enjoyed but i just didn’t care about spending all my income sharing a space with strangers AND this regulation would have been great then for someone like me.  Anyways after the last incidence when i had cops pointing guns at me at 4 am, i relocated to the Midwest, found a decent job, and eventually met my now wife so not all lost.",
                "I had to check the sub because I feel like this is the kind of late stage capitalist shit that gets posted on r/upliftingnews all the time and just ends up pissing me off more, which defeats the purpose of why I'm even subbed there haha."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Taiwan charges Chinese ship captain with damaging undersea cables for the first time",
            "external_url": "https://www.abc.net.au/news/2025-04-11/taiwan-charges-chinese-ship-captain-damaging-undersea-cables/105166868",
            "upvotes": 1384,
            "date": "04/11/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/7f80cae752d1315b45235d43472a690d?impolicy=wcms_watermark_news&cropH=1329&cropW=2363&xPos=0&yPos=222&width=862&height=485&imformat=generic",
            "top_comments": [
                "China pls don't do this. You literally just have to do nothing and you win the economic war bro pls",
                "It’s not an accident,He ordered the anchor to drop in an area marked as a no-anchoring spot because it had cables underneath ,and started doing Z shape moves .",
                "This is not going to work out well.",
                "West Taiwan needs to calm the fuck down",
                "Why do China and Russia hate subsea cables",
                "They have been doing this globally .",
                "Let's tamp it down there folks"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "CDC denies help for lead poisoning in Milwaukee schools due to layoffs",
            "external_url": "https://www.cbsnews.com/news/milwaukee-schools-lead-poisoning-cdc-denies-help/",
            "upvotes": 3520,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/11/21f4e718-d7b9-4e1b-b0c0-48b2f0f561db/thumbnail/1200x630/de4ece6ff65a86c46f617dfb69e8ad7b/gettyimages-1331361574.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "“Well, MY kids go to a private school so why would this be my problem?”\n- ELECTED Republican Leaders",
                "So many kids will be in danger because of this.",
                "> Beyond lead poisoning, now-eliminated teams had also housed the federal government's public health experts for helping local and state health departments respond to a range of other environmental emergencies, said CDC officials, who spoke on the condition of anonymity.\n\"All expertise related to radiological and nuclear threats is eliminated. All capacity for natural disasters response has been eliminated,\" agency officials said in a memo after the layoffs.\nHealth experts tasked with investigating cancer clusters, overseeing chemical weapons demolition and responding to toxic substance spills, like the 2023 East Palestine train derailment, were also cut, multiple officials said.\n\nIt's not like any of those issues pose an extreme risk to the health and safety of Americans. /S",
                "fluoride makes you dumber so we recommend you remove it from water supply... anyway on an unrelated note sorry about the lead poison we cant help",
                "Wow. So who ordered the lay offs? Who hired the guy who ordered the lay offs? Maybe Wisconsin parents need to take this issue up with their representatives.",
                "Trump is responsible for every death that occurs from this.",
                "> “It's extremely concerning that there's no one who is going to be responding.”\n\nSeriously, this is just... unbelievable. Children are at risk, and the government is basically saying \"not our problem\", how could they even think that's okay? I mean, it's completely shocking, and I feel so angry about this, our kids deserve better protection. It's sickening to think about the potential harm, and the lack of accountability just makes it even worse, somebody needs to be held responsible for this failure. It's absolutely egregious.",
                "It's all fun and games owning the libs until your kid gets lead poisoning.",
                "Wtf are we even having this conversion? We knew 50 years ago lead paint kills. Has it been that long since the last paint job? \n\nAnd yeah, fuck the idiot’s for cutting CDC funding  at a time when it ought to be increased.",
                "But we want our future voters to be brain dead, easily swayed, Fox News addicted moron Republicans."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 11975,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "Just waiting for polio to make a comeback. I’ve already bought stock in iron lung manufacturers.",
                "Measles outbreaks = making America great Again.",
                "Anti vaccine folks, wake up to science."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Placed Before the Memo: Suspicious AAPL Options Bet on a Policy Shift That Hadn't Happened Yet",
            "external_url": "https://www.democraticunderground.com/100220232748",
            "upvotes": 358,
            "date": "04/13/2025",
            "thumbnail": "https://www.democraticunderground.com/imgs/du100x100.gif",
            "top_comments": [
                "Oh look, open and shut case of illegal insider trading, good thing the Justice Department is doing it too, so it won't be prosecuted.",
                "Also, the insanity in its linked article about this week’s once-in-4400-days bets.",
                "How can  you trust in the American currency value when rules don't exist?",
                "It's actually somewhat comforting to think his goal is making his taint kissers rich, rather than destabilize the country."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 1328,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Bay Area's oldest prison is getting a Scandinavian makeover",
            "external_url": "https://www.sfgate.com/bayarea/article/california-oldest-prison-scandinavian-makeover-20267618.php",
            "upvotes": 1361,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"The project draws inspiration from Scandinavian incarceration models that prioritize dignity, autonomy and reintegration. This approach has been linked to lower recidivism rates, as Norway’s two-year rate is [17.6%](https://www.sciencedirect.com/science/article/pii/S0047235223000867), compared with 61.5% in the U.S.\"\n\nThat's a significant reduction, by anyone's standards. I hope it works, and that they use it as a blueprint for more comprehensive prison reform.",
                "San Quentin is getting the Ikea treatment?",
                "It will be interesting to see how this works.",
                "It might be based on this project. https://www.youtube.com/watch?v=gTC1KI0STIY",
                "Seems they're aiming to give It a bigger Focus on rehabilitation? It could be good ^^",
                "Exciting!  I hope this works well in CA so it can be expanded nation wide",
                "That’s bound to piss off so many Conservatives. “Bad” people getting humane treatment, not to mention probably non-whites in that bunch, too.",
                "I think this could work but they need to be low level first time offenders. Plus this a west coast prison and they are usually very racially segregated.",
                "This is awesome. Great to see this happening in America.",
                "Presenting “fengsel” by IKEA"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 1514,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "Just another day in the land of the freedumb.",
                "At least he didn't die on a subway",
                "[deleted]",
                "Something something.. when your top assassin wants to quit just let him go."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 12084,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "[Don't Call the Police](https://dontcallthepolice.com)",
                "Cops are not trained to deal with people who have disabilities or are autistic.  I used to work with adults who were autistic, we had a neighbor of the group home call the cops because someone was being loud. Cops came out, they kept on yelling at him to follow orders. They were about to shoot him until we came out, a case worker and myself. Had to intervene and tell the cops he couldn't understand them; he was autistic. They arrested him; later the sheriff's dept decided it was a brilliant idea to release him in the middle of the night. No vehicle. No phone for us to track his location. He had to walk next to the highway for hours in the rain until we found him sitting down beside a street drenched in rain. There needs to be accountability and retraining for their officers. This is beyond bs.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "Never point a cop at anything you don't intend to kill.",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione defense asks judge to block death penalty in CEO slay case",
            "external_url": "https://www.cnbc.com/2025/04/11/luigi-mangione-death-penalty-brian-thompson-case.html",
            "upvotes": 48290,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105908-17401702152025-02-21t202801z_1440528033_rc27zcal85co_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "“The Attorney General's television appearance was similar to her first two public statements\nin that she never mentioned that Mr. Mangione was **not indicted** nor that he has the presumption of innocence. \n\nShe emphasized, for the third time, that her decision to seek the death penalty was based on the President's directive, specifically that the administration will seek the death sentence \"whenever possible.\" She then invoked her personal experience, saying that she was a capital prosecutor, who tried death penalty cases and that \"If there was ever a death case, this is one.\" **The Attorney General stated during her television appearance that a reason she ordered the death sentence was because the alleged victim was a CEO. Counsel is aware of no provision in the death penalty statute or in the Department of Justice's death penalty protocol that allows for consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.”**\n\nI encourage everyone to read the motion, it makes some strong points.",
                "I'd publicly ask for a pardon while I was at it. Just to get it on record.",
                "Why does he need a cop breathing down his neck in every shot lmao. They just get closer and closer every time I see him it's getting a bit intimate. By the time Luigi actually receives his sentence, half the precinct is going to be on his lap.",
                "This trial is gonna be a whole media spectacle. I wonder what the reaction from the oligarchs will be if the jury refuses to convict him.",
                "But Pammy doesn’t care about the husband and father they “accidentally sent” to a brutal prison in El Salvador and refuses to get him removed.",
                "I'm still wondering how hard jury selection will be for this. It's going to be difficult considering how many people have strong opinions about the healthcare industry.",
                ">Counsel is aware of **no** provision in the death\npenalty statute or in the Department of Justice’s death penalty protocol that allows for\n**consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.**\n\n>Rather than relying on these reasons, **the Attorney General cited the professional status of\nthe victim as a CEO**, the fact that the previous administration had not sought the death penalty in\nfour years and that her decision to order it here was due to the **president’s policy to “Make America Safe Again.” **Also, if the death penalty was being ordered pursuant to policy instead of publicity, the** Attorney General would not have put her directive in the form of a press release followed by an Instagram post that effectively launched a new government social media account.**\n\nSome excellent points by his attorneys.",
                "When are they going to go after the people that killed the Boeing Whistleblowers?",
                "Absolutely crazy that from the start he’s been treated as guilty. What happened to due process?",
                "Didn't Trump already pardon him when he said, \"if it's good for the country, it's not illegal\"?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 8606,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [
                ">Khalil, who has a green card, is a lawful permanent resident. In ordering Khalil's deportation, Rubio relied on a rarely used federal statute from the 1950s that played a major role in shaping American immigration during the Cold War. The McCarran-Walter Act, or the Immigration Nationality Act of 1952, gives the secretary of state authority to decide that a noncitizen's presence in the United States threatens the country's foreign policy goals.\n\nJust what are America's foreign policy goals?",
                "If lawful permanent residents can be deported for exercising their first amendment rights, don't fool yourself, citizens can be next.",
                "ICE is moving people to states with friendly judges for kangaroo like courts",
                "The depressing thing is that \"deported\" now can mean sent back to your country of origin or locked up for life in a Salvadoran black site with no hope of anyone ever seeing you alive again.\n\nEdit: I still can't believe our media has played along with that abuse of language. It's not \"deporting\" someone to imprison them for life without trial in a foreign country.",
                "During the Red Scare the United States exiled such brilliant minds as native US citizen Frank Malina, one of the founders of CalTech’s Jet Propulsion Laboratory, for having ties to Communism. \n\nWe’re doing it again. ",
                "Congratulations, the first amendment and due process no longer matter in America. This is truly unbelievable that a judge would allow the SoS to violate someone’s constitutional rights so blatantly.",
                "“Criminal” migrants\n\n“Illegal” migrants\n\nPermanent residents  <- We are here\n\nNaturalized citizens\n\n“Criminal” citizens\n\n“Dissenting” citizens\n\nDemocrats\n\nAnyone who opposes Trump\n\nIf you think this isn’t the natural progression, wake the fuck up. This has happened before more than once throughout history.",
                "Louisiana judge.  They moved him there to avoid NE judges.  \n\nThis is why they grab people off the street and fly them to LA.",
                "This is an immigration judge.  There is also a case in federal court.",
                "Just remember folks, you might think you're safe because you are a US citizen. But there is already precedence for \"accidently\" sending a citizen to El Salvador and then claiming they can't do anything to get them back."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Man has sex with corpse on NYC subway, sources say",
            "external_url": "https://www.nbcnewyork.com/new-york-city/man-sex-corpse-nyc-subway-video-r-train-body/6220060/",
            "upvotes": 13394,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/r-train-body.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Wait... so it sounds like this guy didn't bring the corpse there. Like, someone died on the subway, and someone decided to sexually assault the body.",
                "Well that's a new thought I should've never had \n\n\"Boy I sure hope I don't die on a train in New York.Wont even be able to rest peacefully.\"",
                "I wonder what the possible range of sentences in NYC for public necrophilia is.\n\nI also wonder what led us to the point in society where I can use 'public necrophilia' in a sentence and have it be 100% serious (and relevant).",
                "How does this decision process even work? You're in New York, for whatever reason you're a necrophiliac....You're out shopping, because I imagine necrophiliacs still need certain essentials, you take the Subway..\n\n\"Dear diary...JACKPOT.\"",
                "Can you imagine being the cops watching the surveillance video to see what happened to the dead guy and then seeing this whole sordid tale play out? ",
                "\"Investigators believe the body may have been on the train for hours...\"\n\nWhy are there so many NYPD cops down there then? Couldn't stop a shooting, a woman being burned alive, a dead person being violated sexually, etc. Literally what the fuck do they actually do besides play games on their phones like the adult versions of iPad babies?",
                ">“It's believed the entire assault... took several minutes.”\n\nGoodness... it's truly shocking to think about how long this went on, and I can't even fathom the level of depravity required to commit such an act, it's absolutely sickening, and I just hope that whoever did this is caught and brought to justice quickly, seriously, what kind of person does something like that?",
                "And I thought “fake Down’s syndrome influencers created with AI to promote onlyfans” was the worst news story I’d read this week, but nope, necrophilia had to come in & lower the bar",
                "Not even Florida Man will top that.",
                "JFC...what a terrible day to be literate"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump orders probes of two former officials who defied him",
            "external_url": "https://www.nbcnews.com/politics/national-security/trump-orders-probes-two-former-officials-defied-rcna200523?utm_source=NBC&utm_medium=iframely",
            "upvotes": 6258,
            "date": "04/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-05/230531-Christopher-Krebs-mjf-1024-27e3cc.jpg",
            "top_comments": [
                "Here it is from the horse’s mouth: https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/\n\nOfficial white house communication is starting to read like a ”conservative” news outlet.\n\n“Unite America” my ass.",
                "Dictator doing Dictator things ",
                "Trump, you stupid, fat, dumb, fat idiot, why don’t you do something to help this country? Like stuffing your fat fucking face with Big Macs till the cholesterol tipping point hits. ",
                "Kim Jong Trump on duty.\n\nThe USA is the most ludicrous country in existence. Becoming a dictatorship by founding a cult around one of the shittiest people you can find on earth and then elect this person twice.",
                "Dolores Trumpbridge : I am **a** tolerant man, but the **one thing** I will not **stand** for is **disloyalty!**",
                "Something like this has never happened in America before. The man who for years wailed and called his rightful prosecution a witch hunt is now sicing the DOJ right after his perceived enemies. \n\nFor someone who can't help but commit crimes, you'd think this is something he'll refrain from. Except he plans to die in office, Trump will still face the law coming after him when he leaves the white house and this time, under an attorney general who has no fucks to give. \n\nLike clockwork, he will go back to screaming witchhunt again but will he have the slimy skunk shit who refer to themselves as maga come out for him again? I think not. \n\nTrump cannot end well. His actions have made that impossible. He will keep looking over his back for the rest of his life. Him being in the whitehouse just makes that impractical now but it will happen.",
                "Petty vindictive behavior like this looks like weakness. People with confidence and strength don’t need to lash out at others.",
                "If I recall \"Just following orders\" is not a valid defense.",
                "Imagine giving power to this biblical level criminal. Again.",
                "This is one of the most terrifying things they have done yet. He named two private citizens by name, and ordered an investigation for treason because they had the temerity to be critical of the ~~regime~~ administration. And a reminder that treason is a capital offense."
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "04/13/2025 02:08:20 UTC"
}