{
    "posts": [
        {
            "category": "HOT",
            "title": "Teacher ordered to remove signs from classroom, including one saying 'Everyone is welcome here'",
            "external_url": "https://www.nbcnews.com/news/us-news/teacher-ordered-remove-signs-classroom-rcna196582",
            "upvotes": 7589,
            "date": "03/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/everyone-is-welcome-here-idaho-mc-1x1-250314-copy-b9fd8e.jpg",
            "top_comments": [
                "She should call them out on it: \"Provide a list of who isn't welcome, and I'll consider amending the sign\"",
                ">An Idaho teacher is in a standoff with her own school district after officials ordered her to remove classroom signs, including one that reads, “Everyone is welcome here.” \n\n>Sarah Inama, a sixth-grade history teacher at Lewis and Clark Middle School in Meridian, Idaho, says she won’t comply with the order, arguing that the message is a fundamental part to ensuring a positive learning environment for her students.\n\n>Inama, who has taught at the school for five years, says her commitment to inclusivity isn’t about politics. It’s about her passion for education and students.\n\n>“I love the area that I teach,” she says in an interview with TODAY.com. “It’s really a valuable thing for people to know our human history, things that humans have accomplished, our time on this earth, things that they’ve overcome, patterns that exist.”\n\n>Five years ago, when she first put up the two signs, it was to make sure students knew they were in an open and welcoming space. Now, she says she is risking her job in the name of those values.\n\n>Inama says the controversy began in January when her principal and vice principal came to her classroom to inform her that two posters on her walls were controversial and needed to be removed, a detail the district verified in an email to TODAY.com. Inama says other teachers were given similar instruction, but she was caught off guard by the directive.\n\nGood for her for refusing to back down from the \"controversial\" view that *Everyone is welcome here.*",
                "those officials are such grim people. it speaks to the wider regime in the current day but for this instance, I would jot what my kids in that district ",
                "Change it to “everyone but Nazis” and see if that works better.",
                "I fucking hate sharing a Country with Republikkkans.",
                "There is zero defensible position with the school district's mandate. The teacher's sign only echoes their official policy of inclusion and respect, so either they're lying (they don't actually believe everyone deserves respect and/or inclusion), or they're just suppressing individual speech. There's zero wiggle room here.\n\n\nMy opinion? My guess is they're lying. We know very well that Jim Crow, segregation, and the KKK were the official responses to emancipation. They were legislated into the closet, forced to use dog whistles. Now they're getting comfy and coming back out.\n\n\n\"Red and yellow, black and white, they are precious in his sight. Jesus loves the little children of the world.\" Haven't heard this song since my childhood, seems about time to revive it. You have to fight these kooks with their own values.",
                "Lovely Robert Jenrick, who was immigration minister in the (now fallen) UK Conservative government, [ordered friendly murals painted over](https://www.theguardian.com/uk-news/2023/jul/07/robert-jenrick-has-cartoon-murals-painted-over-at-childrens-asylum-centre) in a reception centre for unaccompanied refugee children.\n\nEnsuring that frightened little children are more miserable is the purest form of hate for some people. It is as cowardly as it is pointless  consisting only of meanness inflicted on the defenceless for the sake of it.\n\nI suppose there is also a frisson of excitement in violating basic biological instincts regarding the protection of the young. In movies, satanic cults get their kicks like this. In real life, its Christians.",
                "Her decorations seem pretty benign and somewhat “content-neutral”\n\nI guess it’s now controversial and innapropriate to state that all people are equal? Administration should clearly define why the given decoration goes against their policy in detail…",
                "They're acting like this a big deal, but letting her stay the rest of the school year - they know they're wrong and they just need a teacher in that classroom. She is right to stand up to them and keep her sign, it's a beautiful message.\n\nhttps://www.westada.org/o/lcms/page/contact-us",
                "Take the sign down. Bring it to the next school board meeting. Lay it down on the table in front of them, and then calmly and simply ask, “Please point to the hands that are not welcome here.”\n\nDon’t leave until each board member gets a chance to participate."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Investigation: We tried to buy American chips as a Russian defense manufacturer — and it worked",
            "external_url": "https://kyivindependent.com/investigation-we-tried-to-buy-american-chips-as-a-russian-defense-manufacturer-heres-why-its-possible/",
            "upvotes": 4025,
            "date": "03/15/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2025/03/1206.jpg",
            "top_comments": [
                "Tl;dr Ukrainian reporters successfully bought US chips from a Russian company sourced from China.\n\nMany US companies outsource their chip manufacturing to China. These companies ship the chips to distributors that in turn sell them to Russia. These chips are used in Russian missiles and drones.\n\n“If you’re Texas Instruments or Intel, you have large distributors. The distributors sell components to all sorts of entities all over the world. Let’s say you sell to some distributor in Hong Kong, and then they sell to another entity in Hong Kong, and that entity ships them to the Russians. I think it’s a difficult problem to solve, but it doesn’t mean it’s impossible.”",
                "Arms dealers buy from and sell to anyone.  Silicon is just a component of arms.",
                "When there is a growing war concern and the currency markets are in disarray, history has shown that many investors trade local currency for gold, first for stability, and second...when many investors are doing that, the price of gold typically goes up.\n\n\nWhen the Russians invaded Afghanistan, the price of gold actually went down...so why?\n\n\nPresident Carter employed trade bans, one of which was a ban on selling US wheat to Russia, because that years Russian harvest was weak, and Carter hoped it would have some effect with negotiations.\n\n\nRussia decided to have Argentina buy huge orders of US wheat, then the cargoships actually went to Russia, with Argentina marking up the trade maybe 20%\n\n\nThe problem was that...Russia did not trade in Rubles, and had no way to pay for it. They ended up paying from their gold reserve, and the fresh flood of gold lowered prices.",
                "To capitalists a sale is a sale.",
                "Or they buy boatload of gaming consoles.",
                "Fraud, waste, abuse and treason",
                "Am I incorrect that this was a corner concern reason why the gov passed a plan a few years ago to move “important” or “sensitive” chip manufacturing inside the US so it be ‘easier’ to keep track of them? \n\nOr is that only half true?",
                "*surprised Pikachu face in capitalism*",
                "Unless the chips are restricted because of dual-use etc, it's probably not illegal. I couldn't find anything in the article as to what the chips were, I'm guessing something more technical than a 555.",
                "As the Arab saying goes (من أعان ظالما علي ظلمه سلطه الله عليه). It means he who aids a tyrant in his tyranny, God will turn that tyrant against him.\n\nEurope and Ukraine are now realising that the USA has turned against them after all the crimes that the USA has done and they aided them in."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Los Angeles man awarded $50 million in case against Starbucks after suffering permanent injury from spilled tea",
            "external_url": "https://www.cbsnews.com/losangeles/news/los-angeles-man-awarded-50-million-in-case-against-starbucks-after-suffering-permanent-injury-from-spilled-tea/",
            "upvotes": 3489,
            "date": "03/15/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/15/89fcf677-2a10-4cd5-9999-c9440c0380ed/thumbnail/1200x630/de9d75095f1ddf658fdb1004e377d8d6/screenshot-2025-03-15-111605.png?v=e7f44f50e1cf6b32bb81cbfeaec70acf",
            "top_comments": [
                ">Starbucks had initially offered $3 million to Garcia pre-trial, later upping that amount to $30 million to settle. Garcia agreed, but under the condition that they apologize, change their policies and issue a memo to all store locations to double-check their hot drinks before handing them to customers, attorneys said. \n\n>When they declined to agree to those terms, the jury eventually decided to award Garcia with Friday's total. \n\nShame the judge didn't also order Starbucks to comply with those terms instead of just letting them pay to get out of it.",
                "At least this headline included “permanent injury” so people can’t jump to conclusions about the win being undeserved.",
                "Starbucks is so entrenched in corporate culture that instead of saying sorry and agreeing to double check the lids are secure they declined a lesser amount and now have to pay 20 million more.",
                "\"Hey, I've seen this one before\"\n\"What are you talking about? It's brand new\"",
                "Starbucks had initially offered $3 million to Garcia pre-trial, later upping that amount to $30 million to settle. Garcia agreed, but under the condition that they apologize, change their policies and issue a memo to all store locations to double-check their hot drinks before handing them to customers, attorneys said. \n\nSo the redline was an apology and a memo?",
                "> The spill left Garcia was life-changing injuries. He suffered third degree burns, nerve damage and permanent injury to his genitals. Lawyers say that he's already had multiple surgeries and that he still experiences pain every day. On top of this, they say that he suffers from severe PTSD. \n\nJust like that poor McDonald’s lady whose labia literally fused together from the hot coffee. \n\nAnd just think of all the plastic cup lining that’s melting in the drink from being that hot.",
                "I’m assuming it was spilled in his lap, the tea was probably very hot, and his lap doesn’t work anymore.",
                "Didn’t they learn this lesson after it happened to McDonald’s, years ago?  There’s no reason coffee/tea should ever be kept that hot.",
                "Can we not McDonald's this victim ",
                "Good for him. You’re in the drive through trying to get a drink when an incredibly hot tea with an unsecured lid gets dumped in your lap causing 3rd degree burns, nerve damage, and permanent genital injuries…\n\nThen they play this game:\n“Starbucks says if our hands are off the drink, then no matter what happens, we’re not responsible,” said Garcia’s trial attorney Nicholas Rowley. “So, if I’m Starbucks and I hand you a drink that doesn’t have a lid that’s secured, and it’s a scalding hot 180 degree drink, or if I hand you a drink that’s in a container and it’s loose and it’s not secured, and it falls right on you — the moment that I take my hands off of it, then you’re responsible and I, the corporation, am not.”\n\nHe had accepted $30 million + apology and ensuring lids are secure and they declined. Now they pay $50 million."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Arlington Cemetery strips content on black and female veterans from website",
            "external_url": "https://www.bbc.com/news/articles/cz03gjnxe25o",
            "upvotes": 2103,
            "date": "03/15/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a32/live/523070a0-01b5-11f0-8027-b77ec2a48801.jpg",
            "top_comments": [
                "What does this accomplish?",
                "I guess nobody is processing that it cost more money to remove shit like this than, you know, averting your fking eyes.",
                "Will that make groceries cheaper or should I wait until tomorrow?",
                "Will Arlington now start digging up non-white and non-male graves?",
                "Just like bigoted American Jesus intended.",
                "they even removed all mention of general colin powell, the first black man to become chairman of the joint chiefs of staff and is buried there!",
                "They are LITERALLY erasing women and black people from history and from social awareness.\n\nHow the ever-loving fuck is this even remotely acceptable? Why are millions of citizens not marching on Washington to lay siege to the city and demanding for this to stop?\n\nI don’t think I understand this world anymore.",
                "Man all the people who bitched and moaned about feminism and how the west isnt sexist is gonna have to explain the complete censoring and deletion of women in history.",
                "Elect white supremacists, and they're gonna do shit like this. \n\nThis is just the beginning.",
                "#Vanishing History: Arlington Cemetery Erases Stories of Black and Female Veterans\n\nSomething strange is happening at Arlington National Cemetery. The sprawling burial ground, where hundreds of thousands of American veterans rest, has quietly erased large chunks of its history from public view. Information about black, Hispanic and female service members, once readily available on its website, has vanished. The pages once told the stories of men and women who broke barriers and gave their all for a country that did not always give back. Now, with a few clicks, they are simply gone.\n\nThe move is part of President Donald Trump's sweeping effort to rid the US military and federal government of diversity, equity and inclusion policies. His administration has been swift in shutting down initiatives that highlight the contributions of minority groups, and Arlington has not been spared.\n\nVisitors looking for details about notable graves have run into dead ends. The pages once dedicated to figures such as General Colin Powell, the first black chairman of the Joint Chiefs of Staff, and the legendary Tuskegee Airmen, the country's first black military pilots, have disappeared. The same goes for Hector Santa Anna, a World War II hero and decorated bomber pilot. Even broader categories of history have been stripped away. Sections on African American, Hispanic and Women's history are no longer easily accessible from the main site.\n\nOfficially, Arlington insists it is working to restore some of the missing content, though it also says it wants to ensure everything aligns with Trump's executive orders and the policies of Defence Secretary Pete Hegseth. Hegseth, a former Fox News host and military veteran, has been vocal about his desire to root out what he calls “woke” culture from the armed forces. He was instrumental in removing General CQ Brown, the first black chairman of the Joint Chiefs of Staff, who had supported diversity efforts.\n\nThe backlash has already begun. Representative Adam Smith, a senior Democrat on the House Armed Services Committee, called the situation “deeply concerning” and suggested there was never a problem with diversity in the military to begin with. Earlier this year, a similar attempt to remove training materials on the Tuskegee Airmen sparked national outrage, forcing the Pentagon to reverse course.\n\nThe US military today is a complex institution, with more than two million people serving in active duty or reserves. A significant portion of them come from minority backgrounds. Thirty per cent identify as black, Native American or other underrepresented groups, while nearly one-fifth are women. The stories now missing from Arlington's website belong to people who paved the way for them.\n\nHistory cannot be deleted as easily as a webpage. The soldiers buried at Arlington, no matter their background, are not just names etched into headstones. They were real people who lived, fought and sacrificed. Whether or not their stories remain in an online archive, their contributions cannot be erased. But the question remains, why is their history being buried once again?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Monster storm across the US sparks threat of tornadoes and fire, killing at least 16",
            "external_url": "https://apnews.com/article/tornadoes-wildfires-deaths-eb53f6b2463a96b18a08ca9e2db266ab",
            "upvotes": 1269,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like a great time to defund NOAA and dismantle the National Weather Service. ",
                " DOGE is cutting  jobs at NOAA  in a time of violate climate .",
                "I thought red states were safe now that Republicans are in control of the weather. What happened?",
                "Luckily we have FEMA to help these people and that's great !\n\n/s ?",
                "Must be DEI hired storm",
                "Ngl, I first read that as \"A monster storms across the US\" and was disappointed that I didn't have kaiju on my 2025 Disasters bingo card.",
                "Huh, God seems pissed.",
                "I thought the Republicans controlled the weater machines now? /s",
                "The consequences of global warming have finally arrived. The cyberpunk dystopia has finally arrived. Capitalism in America is reaching it's apex.\n\nThe apocalypse is scheduled for next week.",
                "But let's shut down NOAA."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "USDA cancels $11 million in federal funding for North Carolina food banks",
            "external_url": "https://www.wunc.org/news/2025-03-14/usda-cancels-federal-funding-north-carolina-food-banks",
            "upvotes": 23104,
            "date": "03/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/f49be1d/2147483647/strip/true/crop/1920x1008+0+136/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F88%2F9813b4f34728a68ed1ad97eb76e1%2Ffood-banks.jpg",
            "top_comments": [
                "It’s always going to be the people that deserve it the least that get the worst of it",
                "Food shelves across the country are anxious because they're expecting, on average, a doubling of people who need help this coming year, and yet are dreading this kind of news that funding will be cut.  Where will my fellow Americans go when we've cut the safety nets out from underneath them? The vast majority of people who use our foodshelf aren't foreigners, terrorists, welfare riders, or villians. They're locals who live here, seniors who don't have enough to retire on and feed themselves, disabled people that can't work enough to make ends meet and pay piling up medical bills, all sorts of sad stories of good regular local people falling through the cracks. And this administration is making those cracks bigger and bigger. SHAME. SHAME ON EVERY SINGLE ONE OF THEM THAT SUPPORTS HURTING AMERICANS.",
                "The cruelty is the point.  Thanks MAGA for even more hungry North Carolinians.",
                "Don't worry. Trump says you'll have so much money you won't even know what to spend it on! \n\nOr maybe he was just referring to himself there...",
                "No food for the needy, but a 4.5 TRILLION tax cut for the wealthy. \nThat’s not right.  I don’t care who you are or what side you’re on, that is just not right.",
                "Every visit Trump makes to Mar-A-Lago costs the US taxpayers $3 million.",
                "I volunteer at a food bank 1-2x a week and it’s going to get bad bad. We were always scrambling for enough food already. Im retired so it’s the least I can do. But we’re all scared we just won’t have enough and there’s nothing worse than telling a mom who’s just scraping by we’re out of food.",
                "But but but, during the campaign there were AI photos of Trump wading in flood waters to save puppies after Helene to own the libs! 😧 You don’t mean to tell me he never cared about North Carolinians?! WHAAAAAAAAA!!!!?",
                "America is back, baby\n\nWhatever that means",
                "And the hits just keep on coming"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Consumers and Businesses Send Distress Signal as Economic Fear Sets In",
            "external_url": "https://www.wsj.com/economy/consumers/consumers-and-businesses-send-distress-signal-as-economic-fear-sets-in-f58d0659",
            "upvotes": 709,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've dealt with abusive people in the past.\n\nWhat comes next is the person responsible for all this, will go into absolute denial .. simultaneously claiming it isn't happening while also blaming everyone else for it. Somehow the people pointing out the problem that person is causing, will be painted as the cause of it.",
                "1. Cause recession\n2. Billionaires buy up distressed assets for pennies on the dollar\n3. idk feudalism?",
                "Will end up a world wide recession .",
                "> On Friday morning, Armstrong, 63 years old, canceled his daughter’s high-school class trip to Spain to free up cash. The trip was going to cost him $322 a month until the trip in spring 2026. The single dad, an independent who voted for Kamala Harris, has also cut back on buying new clothes and ordering food from Grubhub, a treat he and his daughter used to indulge in once a week. \n\n\n> “Things look increasingly bleak for us for the next few years,” he said. “We are cutting back on virtually everything.”\n\n\nThere are of course more important things than a trip to Spain, but there's just something so tragic about stories like this to me. The US is the richest country in the world, and that high school girl should get to go on a trip (both educational and fun) that she'd remember for a lifetime. Every kid should get a few things like that, and this country could be run so that so many more could afford it.\n\n\nAnd this dad should be able to order out for him and his daughter once a week. That should be bare minimum in a country that prides itself on consumerism and wealth. \n\nInstead, this single dad working two jobs can't send his kid on a trip *so that a bunch of obscenely rich fucking assholes who can already afford anything they want or need can make themselves wealthier.*\n\nFucked country. Completely fucked.",
                "So I just had a thought, back with Biden when people were feeling things were expensive (eggs excluded - bird flu), maybe some of it was because people were feeling confident enough to even consider the more luxurious options? People would say “I have more money in my pocket but I don’t feel like it buys as much.” People had a good economy for so long that they forgot what it was REALLY like to have to worry about their financial fragility. \n\nIt’s like vaccines, we are the victims of our own success.",
                "Hear that big sucking sound? That’s America going down the toilet.",
                "I've seen people whose lives are tied up in the stock market really having to lean into cognitive dissonance lately. \n\n\nThings are fundamentally changing in this country and most people have only gotten worse at facing reality in the last few years. ",
                "The real effects are starting. It's not an immediate collapse, it's not groceries going back to normal, home prices aren't going to correct this month. \n\nYou're setting up everyone below 40 to become frugal. To fear economic uncertainty even when the economy is \"growing healthily.\" \n\n2 generations of frugal consumers with a constant paranoia that their life is going to be stripped down at a moments notice. \n\nWe're being offered 200k homes for 550k with interest. The average car payment is close to becoming the average mortgage payment in the 90s. Minimum wage hasn't changed, college degrees don't guarantee success, and our leaders don't give a shit unless they get a profit. \n\nI wanted to get out of school and live on the beach, have a sports car, basically the standard kids' idea of success. Now, I just want a small home without paying absurd taxes. I want a chicken coop and garden. Even that is a monumental feat for a single person.  \n\nWhy are my taxes going up more and more while we all receive so much less? We pay 10% less taxes than Germany. We receive less protections from employers. 0 guarantee of vacation. Our Healthcare is more expensive and worse than Germany. We pay considerably more for home loans. Our roads are worse, our police are worse, our food is worse, are homes are built worse, our infrastructure is failing, we have companies paying 250k fines for poisoning entire towns. \n\nOur leaders have decided that every citizen under the top 10% will now pay more taxes as a way to maintain our fabulously vile standard of living. \n\nI just want out. I have to be in this country for just less than a decade. I'm not sure I want a house here anymore. I'd rather save, finish another degree, and leave. This rat race is a joke.",
                "[removed]",
                "We are heading into a recession or perhaps a depression…."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Parents deported to Mexico while seeking brain cancer treatment for young American daughter | CNN",
            "external_url": "https://edition.cnn.com/2025/03/15/us/parents-deported-mexico-daughter-cancer-treatment/index.html",
            "upvotes": 453,
            "date": "03/15/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/8a7acf8d-c949-4197-af35-83c195e67084.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Is this the “compassionate conservatism” I heard about way back in the ‘90s or …?",
                "Americans, if you don’t like what is happening to your country DO SOMETHING… protest, boycott (twitter, tesla, etc), harass your elected officials.  Don’t be apathetic and say it won’t work, just do it.",
                "Shit like this puts a smile on trumps face.",
                "We already had this thread",
                "Cruelty at work. The heart of the self-serving conservatives.\n\nNo wonder the Nazi jerk boasts that empathy is something we should avoid.",
                "Just racking up those human rights violations. Maybe the ICC can save us",
                "I'm ignorant to American laws, but if you're living clean productive lives in America with enough time to have kids and raise them what's stopping you from getting the document's you need to be legal?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Local students art project for Women’s History Month partially removed after it’s deemed “inappropriate”",
            "external_url": "https://www.wcpo.com/news/local-news/art-is-supposed-to-get-people-talking-adams-county-students-womens-history-mural-deemed-inappropriate",
            "upvotes": 507,
            "date": "03/15/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/db5cb8b/2147483647/strip/true/crop/3184x1672+0+128/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fbc%2Fa5%2F661cb9144455a2f8962ea7f9dff4%2Fscreenshot-2025-03-14-at-9-21-14-pm.png",
            "top_comments": [
                "And now an art project that would have been limited to a single high school audience has gone nationwide. :) Hope the young artist is rightfully enjoying this moment and keeps at it.",
                "And just like that, they've proven the point the artist was trying to make.",
                "r/nottheonion \n\nArtist: \"Women's voices are being shunned\" \n\nSchool: \"Shut your damn mouth, woman!\"",
                "Officials recommended that the tape depicting the taped mouth and hands be removed, but that changes the art drastically. The message is completely different with this level of tampering. I think her art should be sold as is.",
                "Now the art piece is getting a much larger reach.\n\nThe duct-tape over the mouth really represented how women’s voices are always shunned,” Greenfield said. “And then the hands being tied back, how they’re always like kind of trapped.”\n\nAdams County Ohio Valley School District Superintendent Dawn Wallace, who said the mural was “inappropriate” and “depicted bondage and teen pregnancy.”",
                "God forbid anyone ever interact with anything that might make them uncomfortable or be thought provoking about current day issues. What is the point in even making art if it cannot try to evoke a single thought?",
                "Today we learned of Adams County Ohio Valley School District Superintendent Dawn Wallace’s kink - pregnancy bondage. No judgement from me, just own it Dawn.",
                "\"Promotes bondage and teen pregnancy\" is Elon Musk levels of media/art illiteracy.",
                "They took the tape off the mural and stuck it squarely over the artist’s mouth.",
                "As a former student I feel safe in saying that little cover-up sign will have a short, violent existence."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Green card holder from New Hampshire 'interrogated' at Logan Airport, detained",
            "external_url": "https://www.wgbh.org/news/local/2025-03-14/green-card-holder-from-new-hampshire-interrogated-at-logan-airport-detained",
            "upvotes": 5729,
            "date": "03/15/2025",
            "thumbnail": "https://cdn.grove.wgbh.org/dims4/default/48f53c4/2147483647/strip/true/crop/3024x1588+0+151/resize/1200x630!/quality/70/?url=https%3A%2F%2Fk1-prod-gbh.s3.us-east-2.amazonaws.com%2Fbrightspot%2F96%2F9a%2F848279af4b5db8bb6e2386e64e2b%2Fimg-8795.jpeg",
            "top_comments": [
                "“Senior described Schmidt being “violently interrogated” at Logan Airport for hours, and being stripped naked, put in a cold shower by two officials, and being put back onto a chair.\n\nShe said Schmidt told her immigration agents pressured him to give up his green card. She said he was placed on a mat in a bright room with other people at the airport, with little food or water, suffered sleep deprivation, and was denied access to his medication for anxiety and depression.”\n\n———\n\nWtf? The amount of civil rights violations these ppl pull off.",
                "I got lucky with an official once. (The first week of Donald’s first presidency). He was nice about it, put me in a cell “but I wasn’t arrested” searched my bags for an hour or two. Gave me access to my medication. Asked me a hundred questions, called my contacts. All while a crazy old white guy official was screaming there’s something about me and I need to go home. Thankgod that nicer official grabbed me first when he saw I was upset.\n\nThey eventually let me leave, but I was given trouble all the way out because they wrote on my exit ticket. \n\nTrump empowers assholes.",
                "All our civilized rules, law and order are just a paper thin shell. The moment they think they can get away with it, people go hogwild.",
                "So this is what we do to legal immigrants who follow the legal process? How exactly does that encourage people to “do it the right way”?\n\nDamn shame, I hope this person is alright .",
                "Ice is the new Gestapo and SS combined. They don’t need warrants or any other due process!",
                "Think I'll avoid visiting the US of A",
                "This man was tortured",
                "So it’s not “illegals” they’re going after. It’s anyone not a US citizen that they can harass. Then it’s student visas, and then tourists will find it just too ridiculous to visit. \n\n Enjoy all the damage that will bring.\n\nIt’ll be Americans soon. Where are they going to be deported to? Yeah.\n\nEdited for grammar",
                "Yep tbh this is my main reason I've cancelled my trips to the US this year.\n\nCompany opened an office last year and I was going out to visit, but I've effectively told them they're on their own until shit calms down.  The US is just too unstable right now.",
                "Take note of the agents for when the crime trials begin. “Just following orders” wasn’t acceptable as an excuse back then and it won’t be in the future"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Long Island man is first in New York history to be cured of sickle cell anemia",
            "external_url": "https://www.cbsnews.com/newyork/news/sickle-cell-anemia-cure-new-york/?fbclid=IwZXh0bgNhZW0CMTEAAR2aGV-hO1-rSlr-x90l2eazoLzN5tB3iYCNuK2d9rJIgs0v4xASoa1S0yM_aem_y3h7BZbFRQe-q9KJ9wN-1A#5pyixb34gp5ot4bulyygwe4ghh2ajayr4",
            "upvotes": 4,
            "date": "03/15/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/13/6d203796-7ec1-4d80-98b3-b2f128ae3517/thumbnail/1200x630/70b2cfddbcb02c6f2f8fceeb586736b3/mclogan-6p-pkg-new-sick-wcbsdan5-hi-res-still-00-01-3124.jpg?v=e7f44f50e1cf6b32bb81cbfeaec70acf",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Monster storm system across U.S. sparks threat of tornadoes and fire, killing at least 17",
            "external_url": "https://dbrnews.com/news/nation-world/weather/article_7c5492d4-fdb2-5f86-8538-36a59b3d53a9.html%20co",
            "upvotes": 95,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Link to article doesn't work",
                "“Violent tornadoes that ripped through parts of the U.S. proved deadly as well as destructive as whipping winds moved east Saturday into the Mississippi Valley and Deep South, with at least 17 people killed and scores of homes decimated.”\n“…. We have teams out surveying the damage from last night’s tornadoes and have first responders on the ground to assist,” Arkansas Gov. Sarah Huckabee Sanders said on social media.\nShe and Georgia Gov. Brian Kemp declared states of emergency in their respective states. Kemp said he was making the declaration in anticipation of severe weather moving toward the state later Saturday.”\n\nMy thoughts are with anyone in danger of losing homes or their life due to this.\nMy outrage is directed at the governors who applauded the raping of the agencies that were established to help in these situations.\nNow you’re calling on these agencies to help. With what funds?",
                "We had a wind storm yesterday like I’ve never seen in my life. I assume it was the prelude to this system to our east. The entire sky was bright red, vehicles were being flipped, terrible visibility, roofs torn off and trees destroyed, fires hauling ass across the counties, power outages all over. \n\nThe dust was so thick people actually wore masks. Never thought I’d see the day they did that voluntarily. \n\nThe crazy thing is this is just a week or so after the previous worst winds I had ever seen. No storms, just full on wind. I wonder if this will be a thing now.",
                "Let’s see how the felon Trump will handle this if anything unfortunate would happen ….. my bet he will blame Biden …Trump is scum ….",
                "Trump will blame Biden for that storm.",
                "Sorry and thanks for letting me know\n\nhttps://dbrnews.com/news/nation-world/weather/article_7c5492d4-fdb2-5f86-8538-36a59b3d53a9.html",
                "Sitting here in Jackson, MS and tornadoes went north and south of us thankfully. Alabama is about to get hit hard I imagine.",
                "The US has the most volatile weather on the planet. You need to pay attention to it.",
                "Use Sharpie and send it to the Gulf of America towards the US Canal.",
                "Wind storm broke off half a tree that fell and barely missed the back of my home. Ripped my gutter off, an overhang above my back door, crushed the roof of my shed, and smashed the back window of my car. It is also blocking my driveway so my wife's van is blocked in as well. Going to be thousands in damage and probably more. Family is OK but I couldn't sleep for the rest of the night."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Arlington Cemetery strips content on black and female veterans from website",
            "external_url": "https://www.bbc.com/news/articles/cz03gjnxe25o",
            "upvotes": 2093,
            "date": "03/15/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a32/live/523070a0-01b5-11f0-8027-b77ec2a48801.jpg",
            "top_comments": [
                "What does this accomplish?",
                "I guess nobody is processing that it cost more money to remove shit like this than, you know, averting your fking eyes.",
                "Will that make groceries cheaper or should I wait until tomorrow?",
                "Will Arlington now start digging up non-white and non-male graves?",
                "Just like bigoted American Jesus intended.",
                "they even removed all mention of general colin powell, the first black man to become chairman of the joint chiefs of staff and is buried there!",
                "They are LITERALLY erasing women and black people from history and from social awareness.\n\nHow the ever-loving fuck is this even remotely acceptable? Why are millions of citizens not marching on Washington to lay siege to the city and demanding for this to stop?\n\nI don’t think I understand this world anymore.",
                "Man all the people who bitched and moaned about feminism and how the west isnt sexist is gonna have to explain the complete censoring and deletion of women in history.",
                "Elect white supremacists, and they're gonna do shit like this. \n\nThis is just the beginning.",
                "#Vanishing History: Arlington Cemetery Erases Stories of Black and Female Veterans\n\nSomething strange is happening at Arlington National Cemetery. The sprawling burial ground, where hundreds of thousands of American veterans rest, has quietly erased large chunks of its history from public view. Information about black, Hispanic and female service members, once readily available on its website, has vanished. The pages once told the stories of men and women who broke barriers and gave their all for a country that did not always give back. Now, with a few clicks, they are simply gone.\n\nThe move is part of President Donald Trump's sweeping effort to rid the US military and federal government of diversity, equity and inclusion policies. His administration has been swift in shutting down initiatives that highlight the contributions of minority groups, and Arlington has not been spared.\n\nVisitors looking for details about notable graves have run into dead ends. The pages once dedicated to figures such as General Colin Powell, the first black chairman of the Joint Chiefs of Staff, and the legendary Tuskegee Airmen, the country's first black military pilots, have disappeared. The same goes for Hector Santa Anna, a World War II hero and decorated bomber pilot. Even broader categories of history have been stripped away. Sections on African American, Hispanic and Women's history are no longer easily accessible from the main site.\n\nOfficially, Arlington insists it is working to restore some of the missing content, though it also says it wants to ensure everything aligns with Trump's executive orders and the policies of Defence Secretary Pete Hegseth. Hegseth, a former Fox News host and military veteran, has been vocal about his desire to root out what he calls “woke” culture from the armed forces. He was instrumental in removing General CQ Brown, the first black chairman of the Joint Chiefs of Staff, who had supported diversity efforts.\n\nThe backlash has already begun. Representative Adam Smith, a senior Democrat on the House Armed Services Committee, called the situation “deeply concerning” and suggested there was never a problem with diversity in the military to begin with. Earlier this year, a similar attempt to remove training materials on the Tuskegee Airmen sparked national outrage, forcing the Pentagon to reverse course.\n\nThe US military today is a complex institution, with more than two million people serving in active duty or reserves. A significant portion of them come from minority backgrounds. Thirty per cent identify as black, Native American or other underrepresented groups, while nearly one-fifth are women. The stories now missing from Arlington's website belong to people who paved the way for them.\n\nHistory cannot be deleted as easily as a webpage. The soldiers buried at Arlington, no matter their background, are not just names etched into headstones. They were real people who lived, fought and sacrificed. Whether or not their stories remain in an online archive, their contributions cannot be erased. But the question remains, why is their history being buried once again?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Parents deported to Mexico while seeking brain cancer treatment for young American daughter | CNN",
            "external_url": "https://edition.cnn.com/2025/03/15/us/parents-deported-mexico-daughter-cancer-treatment/index.html",
            "upvotes": 449,
            "date": "03/15/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/8a7acf8d-c949-4197-af35-83c195e67084.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Is this the “compassionate conservatism” I heard about way back in the ‘90s or …?",
                "Americans, if you don’t like what is happening to your country DO SOMETHING… protest, boycott (twitter, tesla, etc), harass your elected officials.  Don’t be apathetic and say it won’t work, just do it.",
                "Shit like this puts a smile on trumps face.",
                "We already had this thread",
                "Cruelty at work. The heart of the self-serving conservatives.\n\nNo wonder the Nazi jerk boasts that empathy is something we should avoid.",
                "Just racking up those human rights violations. Maybe the ICC can save us",
                "I'm ignorant to American laws, but if you're living clean productive lives in America with enough time to have kids and raise them what's stopping you from getting the document's you need to be legal?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Nine killed in Israeli attack in northern Gaza, officials say, in deadliest strike since ceasefire began | CNN",
            "external_url": "https://edition.cnn.com/2025/03/15/middleeast/israeli-attack-gaza-intl/index.html",
            "upvotes": 228,
            "date": "03/15/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-15t131025z-1148523927-rc2kddarmb14-rtrmadp-3-israel-palestinians-gaza.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Real \"ceasefire\" they got going there.\n\n\nNine *charity workers*, to be clear.",
                "Is the phrase “deadliest strike since ceasefire began” not an oxymoron? Like do people think this is actually a ceasefire?",
                "It was nine charity workers… That should absolutely be included in headline.",
                "\"Deadliest strike since ceasefire began.\" So it's now not even just one goodness.",
                "Ceasefire for Israel means they can kill whoever they want and the other side can’t fire back.",
                "Be careful, posting this may get you arrested",
                "Another day, another IDF war crime. ",
                "Is it worth telling the devil he's evil?\n\n\nAnyone without brain damage knows Isreal is a terrorist state.",
                "ceasefire for israel means the opps cease while they fire i suppose",
                "2 people operating a drone. Additional people collected drone operating equipment and entered a vehicle. Israel bombed that vehicle. Of the 9 killed 3 were media team documenting humanitarian relief efforts in Gaza. It’s likely that they were indeed all humanitarian people. It’s also possible that they were terrorists taking cover as humanitarians to spy or drop bombs on Israeli troops."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Teacher ordered to remove signs from classroom, including one saying 'Everyone is welcome here'",
            "external_url": "https://www.nbcnews.com/news/us-news/teacher-ordered-remove-signs-classroom-rcna196582",
            "upvotes": 7604,
            "date": "03/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/everyone-is-welcome-here-idaho-mc-1x1-250314-copy-b9fd8e.jpg",
            "top_comments": [
                "She should call them out on it: \"Provide a list of who isn't welcome, and I'll consider amending the sign\"",
                ">An Idaho teacher is in a standoff with her own school district after officials ordered her to remove classroom signs, including one that reads, “Everyone is welcome here.” \n\n>Sarah Inama, a sixth-grade history teacher at Lewis and Clark Middle School in Meridian, Idaho, says she won’t comply with the order, arguing that the message is a fundamental part to ensuring a positive learning environment for her students.\n\n>Inama, who has taught at the school for five years, says her commitment to inclusivity isn’t about politics. It’s about her passion for education and students.\n\n>“I love the area that I teach,” she says in an interview with TODAY.com. “It’s really a valuable thing for people to know our human history, things that humans have accomplished, our time on this earth, things that they’ve overcome, patterns that exist.”\n\n>Five years ago, when she first put up the two signs, it was to make sure students knew they were in an open and welcoming space. Now, she says she is risking her job in the name of those values.\n\n>Inama says the controversy began in January when her principal and vice principal came to her classroom to inform her that two posters on her walls were controversial and needed to be removed, a detail the district verified in an email to TODAY.com. Inama says other teachers were given similar instruction, but she was caught off guard by the directive.\n\nGood for her for refusing to back down from the \"controversial\" view that *Everyone is welcome here.*",
                "those officials are such grim people. it speaks to the wider regime in the current day but for this instance, I would jot what my kids in that district ",
                "Change it to “everyone but Nazis” and see if that works better.",
                "I fucking hate sharing a Country with Republikkkans.",
                "There is zero defensible position with the school district's mandate. The teacher's sign only echoes their official policy of inclusion and respect, so either they're lying (they don't actually believe everyone deserves respect and/or inclusion), or they're just suppressing individual speech. There's zero wiggle room here.\n\n\nMy opinion? My guess is they're lying. We know very well that Jim Crow, segregation, and the KKK were the official responses to emancipation. They were legislated into the closet, forced to use dog whistles. Now they're getting comfy and coming back out.\n\n\n\"Red and yellow, black and white, they are precious in his sight. Jesus loves the little children of the world.\" Haven't heard this song since my childhood, seems about time to revive it. You have to fight these kooks with their own values.",
                "Lovely Robert Jenrick, who was immigration minister in the (now fallen) UK Conservative government, [ordered friendly murals painted over](https://www.theguardian.com/uk-news/2023/jul/07/robert-jenrick-has-cartoon-murals-painted-over-at-childrens-asylum-centre) in a reception centre for unaccompanied refugee children.\n\nEnsuring that frightened little children are more miserable is the purest form of hate for some people. It is as cowardly as it is pointless  consisting only of meanness inflicted on the defenceless for the sake of it.\n\nI suppose there is also a frisson of excitement in violating basic biological instincts regarding the protection of the young. In movies, satanic cults get their kicks like this. In real life, its Christians.",
                "Her decorations seem pretty benign and somewhat “content-neutral”\n\nI guess it’s now controversial and innapropriate to state that all people are equal? Administration should clearly define why the given decoration goes against their policy in detail…",
                "They're acting like this a big deal, but letting her stay the rest of the school year - they know they're wrong and they just need a teacher in that classroom. She is right to stand up to them and keep her sign, it's a beautiful message.\n\nhttps://www.westada.org/o/lcms/page/contact-us",
                "Take the sign down. Bring it to the next school board meeting. Lay it down on the table in front of them, and then calmly and simply ask, “Please point to the hands that are not welcome here.”\n\nDon’t leave until each board member gets a chance to participate."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Investigation: We tried to buy American chips as a Russian defense manufacturer — and it worked",
            "external_url": "https://kyivindependent.com/investigation-we-tried-to-buy-american-chips-as-a-russian-defense-manufacturer-heres-why-its-possible/",
            "upvotes": 4023,
            "date": "03/15/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2025/03/1206.jpg",
            "top_comments": [
                "Tl;dr Ukrainian reporters successfully bought US chips from a Russian company sourced from China.\n\nMany US companies outsource their chip manufacturing to China. These companies ship the chips to distributors that in turn sell them to Russia. These chips are used in Russian missiles and drones.\n\n“If you’re Texas Instruments or Intel, you have large distributors. The distributors sell components to all sorts of entities all over the world. Let’s say you sell to some distributor in Hong Kong, and then they sell to another entity in Hong Kong, and that entity ships them to the Russians. I think it’s a difficult problem to solve, but it doesn’t mean it’s impossible.”",
                "Arms dealers buy from and sell to anyone.  Silicon is just a component of arms.",
                "When there is a growing war concern and the currency markets are in disarray, history has shown that many investors trade local currency for gold, first for stability, and second...when many investors are doing that, the price of gold typically goes up.\n\n\nWhen the Russians invaded Afghanistan, the price of gold actually went down...so why?\n\n\nPresident Carter employed trade bans, one of which was a ban on selling US wheat to Russia, because that years Russian harvest was weak, and Carter hoped it would have some effect with negotiations.\n\n\nRussia decided to have Argentina buy huge orders of US wheat, then the cargoships actually went to Russia, with Argentina marking up the trade maybe 20%\n\n\nThe problem was that...Russia did not trade in Rubles, and had no way to pay for it. They ended up paying from their gold reserve, and the fresh flood of gold lowered prices.",
                "To capitalists a sale is a sale.",
                "Or they buy boatload of gaming consoles.",
                "Fraud, waste, abuse and treason",
                "Am I incorrect that this was a corner concern reason why the gov passed a plan a few years ago to move “important” or “sensitive” chip manufacturing inside the US so it be ‘easier’ to keep track of them? \n\nOr is that only half true?",
                "*surprised Pikachu face in capitalism*",
                "Unless the chips are restricted because of dual-use etc, it's probably not illegal. I couldn't find anything in the article as to what the chips were, I'm guessing something more technical than a 555.",
                "As the Arab saying goes (من أعان ظالما علي ظلمه سلطه الله عليه). It means he who aids a tyrant in his tyranny, God will turn that tyrant against him.\n\nEurope and Ukraine are now realising that the USA has turned against them after all the crimes that the USA has done and they aided them in."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Consumers and Businesses Send Distress Signal as Economic Fear Sets In",
            "external_url": "https://www.wsj.com/economy/consumers/consumers-and-businesses-send-distress-signal-as-economic-fear-sets-in-f58d0659",
            "upvotes": 711,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've dealt with abusive people in the past.\n\nWhat comes next is the person responsible for all this, will go into absolute denial .. simultaneously claiming it isn't happening while also blaming everyone else for it. Somehow the people pointing out the problem that person is causing, will be painted as the cause of it.",
                "1. Cause recession\n2. Billionaires buy up distressed assets for pennies on the dollar\n3. idk feudalism?",
                "Will end up a world wide recession .",
                "> On Friday morning, Armstrong, 63 years old, canceled his daughter’s high-school class trip to Spain to free up cash. The trip was going to cost him $322 a month until the trip in spring 2026. The single dad, an independent who voted for Kamala Harris, has also cut back on buying new clothes and ordering food from Grubhub, a treat he and his daughter used to indulge in once a week. \n\n\n> “Things look increasingly bleak for us for the next few years,” he said. “We are cutting back on virtually everything.”\n\n\nThere are of course more important things than a trip to Spain, but there's just something so tragic about stories like this to me. The US is the richest country in the world, and that high school girl should get to go on a trip (both educational and fun) that she'd remember for a lifetime. Every kid should get a few things like that, and this country could be run so that so many more could afford it.\n\n\nAnd this dad should be able to order out for him and his daughter once a week. That should be bare minimum in a country that prides itself on consumerism and wealth. \n\nInstead, this single dad working two jobs can't send his kid on a trip *so that a bunch of obscenely rich fucking assholes who can already afford anything they want or need can make themselves wealthier.*\n\nFucked country. Completely fucked.",
                "So I just had a thought, back with Biden when people were feeling things were expensive (eggs excluded - bird flu), maybe some of it was because people were feeling confident enough to even consider the more luxurious options? People would say “I have more money in my pocket but I don’t feel like it buys as much.” People had a good economy for so long that they forgot what it was REALLY like to have to worry about their financial fragility. \n\nIt’s like vaccines, we are the victims of our own success.",
                "Hear that big sucking sound? That’s America going down the toilet.",
                "I've seen people whose lives are tied up in the stock market really having to lean into cognitive dissonance lately. \n\n\nThings are fundamentally changing in this country and most people have only gotten worse at facing reality in the last few years. ",
                "The real effects are starting. It's not an immediate collapse, it's not groceries going back to normal, home prices aren't going to correct this month. \n\nYou're setting up everyone below 40 to become frugal. To fear economic uncertainty even when the economy is \"growing healthily.\" \n\n2 generations of frugal consumers with a constant paranoia that their life is going to be stripped down at a moments notice. \n\nWe're being offered 200k homes for 550k with interest. The average car payment is close to becoming the average mortgage payment in the 90s. Minimum wage hasn't changed, college degrees don't guarantee success, and our leaders don't give a shit unless they get a profit. \n\nI wanted to get out of school and live on the beach, have a sports car, basically the standard kids' idea of success. Now, I just want a small home without paying absurd taxes. I want a chicken coop and garden. Even that is a monumental feat for a single person.  \n\nWhy are my taxes going up more and more while we all receive so much less? We pay 10% less taxes than Germany. We receive less protections from employers. 0 guarantee of vacation. Our Healthcare is more expensive and worse than Germany. We pay considerably more for home loans. Our roads are worse, our police are worse, our food is worse, are homes are built worse, our infrastructure is failing, we have companies paying 250k fines for poisoning entire towns. \n\nOur leaders have decided that every citizen under the top 10% will now pay more taxes as a way to maintain our fabulously vile standard of living. \n\nI just want out. I have to be in this country for just less than a decade. I'm not sure I want a house here anymore. I'd rather save, finish another degree, and leave. This rat race is a joke.",
                "[removed]",
                "We are heading into a recession or perhaps a depression…."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Los Angeles man awarded $50 million in case against Starbucks after suffering permanent injury from spilled tea",
            "external_url": "https://www.cbsnews.com/losangeles/news/los-angeles-man-awarded-50-million-in-case-against-starbucks-after-suffering-permanent-injury-from-spilled-tea/",
            "upvotes": 3489,
            "date": "03/15/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/15/89fcf677-2a10-4cd5-9999-c9440c0380ed/thumbnail/1200x630/de9d75095f1ddf658fdb1004e377d8d6/screenshot-2025-03-15-111605.png?v=e7f44f50e1cf6b32bb81cbfeaec70acf",
            "top_comments": [
                ">Starbucks had initially offered $3 million to Garcia pre-trial, later upping that amount to $30 million to settle. Garcia agreed, but under the condition that they apologize, change their policies and issue a memo to all store locations to double-check their hot drinks before handing them to customers, attorneys said. \n\n>When they declined to agree to those terms, the jury eventually decided to award Garcia with Friday's total. \n\nShame the judge didn't also order Starbucks to comply with those terms instead of just letting them pay to get out of it.",
                "At least this headline included “permanent injury” so people can’t jump to conclusions about the win being undeserved.",
                "Starbucks is so entrenched in corporate culture that instead of saying sorry and agreeing to double check the lids are secure they declined a lesser amount and now have to pay 20 million more.",
                "\"Hey, I've seen this one before\"\n\"What are you talking about? It's brand new\"",
                "Starbucks had initially offered $3 million to Garcia pre-trial, later upping that amount to $30 million to settle. Garcia agreed, but under the condition that they apologize, change their policies and issue a memo to all store locations to double-check their hot drinks before handing them to customers, attorneys said. \n\nSo the redline was an apology and a memo?",
                "> The spill left Garcia was life-changing injuries. He suffered third degree burns, nerve damage and permanent injury to his genitals. Lawyers say that he's already had multiple surgeries and that he still experiences pain every day. On top of this, they say that he suffers from severe PTSD. \n\nJust like that poor McDonald’s lady whose labia literally fused together from the hot coffee. \n\nAnd just think of all the plastic cup lining that’s melting in the drink from being that hot.",
                "I’m assuming it was spilled in his lap, the tea was probably very hot, and his lap doesn’t work anymore.",
                "Didn’t they learn this lesson after it happened to McDonald’s, years ago?  There’s no reason coffee/tea should ever be kept that hot.",
                "Can we not McDonald's this victim ",
                "Good for him. You’re in the drive through trying to get a drink when an incredibly hot tea with an unsecured lid gets dumped in your lap causing 3rd degree burns, nerve damage, and permanent genital injuries…\n\nThen they play this game:\n“Starbucks says if our hands are off the drink, then no matter what happens, we’re not responsible,” said Garcia’s trial attorney Nicholas Rowley. “So, if I’m Starbucks and I hand you a drink that doesn’t have a lid that’s secured, and it’s a scalding hot 180 degree drink, or if I hand you a drink that’s in a container and it’s loose and it’s not secured, and it falls right on you — the moment that I take my hands off of it, then you’re responsible and I, the corporation, am not.”\n\nHe had accepted $30 million + apology and ensuring lids are secure and they declined. Now they pay $50 million."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Local students art project for Women’s History Month partially removed after it’s deemed “inappropriate”",
            "external_url": "https://www.wcpo.com/news/local-news/art-is-supposed-to-get-people-talking-adams-county-students-womens-history-mural-deemed-inappropriate",
            "upvotes": 503,
            "date": "03/15/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/db5cb8b/2147483647/strip/true/crop/3184x1672+0+128/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fbc%2Fa5%2F661cb9144455a2f8962ea7f9dff4%2Fscreenshot-2025-03-14-at-9-21-14-pm.png",
            "top_comments": [
                "And now an art project that would have been limited to a single high school audience has gone nationwide. :) Hope the young artist is rightfully enjoying this moment and keeps at it.",
                "And just like that, they've proven the point the artist was trying to make.",
                "r/nottheonion \n\nArtist: \"Women's voices are being shunned\" \n\nSchool: \"Shut your damn mouth, woman!\"",
                "Officials recommended that the tape depicting the taped mouth and hands be removed, but that changes the art drastically. The message is completely different with this level of tampering. I think her art should be sold as is.",
                "Now the art piece is getting a much larger reach.\n\nThe duct-tape over the mouth really represented how women’s voices are always shunned,” Greenfield said. “And then the hands being tied back, how they’re always like kind of trapped.”\n\nAdams County Ohio Valley School District Superintendent Dawn Wallace, who said the mural was “inappropriate” and “depicted bondage and teen pregnancy.”",
                "God forbid anyone ever interact with anything that might make them uncomfortable or be thought provoking about current day issues. What is the point in even making art if it cannot try to evoke a single thought?",
                "Today we learned of Adams County Ohio Valley School District Superintendent Dawn Wallace’s kink - pregnancy bondage. No judgement from me, just own it Dawn.",
                "\"Promotes bondage and teen pregnancy\" is Elon Musk levels of media/art illiteracy.",
                "They took the tape off the mural and stuck it squarely over the artist’s mouth.",
                "As a former student I feel safe in saying that little cover-up sign will have a short, violent existence."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Investigation: We tried to buy American chips as a Russian defense manufacturer — and it worked",
            "external_url": "https://kyivindependent.com/investigation-we-tried-to-buy-american-chips-as-a-russian-defense-manufacturer-heres-why-its-possible/",
            "upvotes": 4042,
            "date": "03/15/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2025/03/1206.jpg",
            "top_comments": [
                "Tl;dr Ukrainian reporters successfully bought US chips from a Russian company sourced from China.\n\nMany US companies outsource their chip manufacturing to China. These companies ship the chips to distributors that in turn sell them to Russia. These chips are used in Russian missiles and drones.\n\n“If you’re Texas Instruments or Intel, you have large distributors. The distributors sell components to all sorts of entities all over the world. Let’s say you sell to some distributor in Hong Kong, and then they sell to another entity in Hong Kong, and that entity ships them to the Russians. I think it’s a difficult problem to solve, but it doesn’t mean it’s impossible.”",
                "Arms dealers buy from and sell to anyone.  Silicon is just a component of arms.",
                "When there is a growing war concern and the currency markets are in disarray, history has shown that many investors trade local currency for gold, first for stability, and second...when many investors are doing that, the price of gold typically goes up.\n\n\nWhen the Russians invaded Afghanistan, the price of gold actually went down...so why?\n\n\nPresident Carter employed trade bans, one of which was a ban on selling US wheat to Russia, because that years Russian harvest was weak, and Carter hoped it would have some effect with negotiations.\n\n\nRussia decided to have Argentina buy huge orders of US wheat, then the cargoships actually went to Russia, with Argentina marking up the trade maybe 20%\n\n\nThe problem was that...Russia did not trade in Rubles, and had no way to pay for it. They ended up paying from their gold reserve, and the fresh flood of gold lowered prices.",
                "To capitalists a sale is a sale.",
                "Or they buy boatload of gaming consoles.",
                "Fraud, waste, abuse and treason",
                "Am I incorrect that this was a corner concern reason why the gov passed a plan a few years ago to move “important” or “sensitive” chip manufacturing inside the US so it be ‘easier’ to keep track of them? \n\nOr is that only half true?",
                "*surprised Pikachu face in capitalism*",
                "Unless the chips are restricted because of dual-use etc, it's probably not illegal. I couldn't find anything in the article as to what the chips were, I'm guessing something more technical than a 555.",
                "As the Arab saying goes (من أعان ظالما علي ظلمه سلطه الله عليه). It means he who aids a tyrant in his tyranny, God will turn that tyrant against him.\n\nEurope and Ukraine are now realising that the USA has turned against them after all the crimes that the USA has done and they aided them in."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Parents deported to Mexico while seeking brain cancer treatment for young American daughter | CNN",
            "external_url": "https://edition.cnn.com/2025/03/15/us/parents-deported-mexico-daughter-cancer-treatment/index.html",
            "upvotes": 449,
            "date": "03/15/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/8a7acf8d-c949-4197-af35-83c195e67084.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Is this the “compassionate conservatism” I heard about way back in the ‘90s or …?",
                "Americans, if you don’t like what is happening to your country DO SOMETHING… protest, boycott (twitter, tesla, etc), harass your elected officials.  Don’t be apathetic and say it won’t work, just do it.",
                "Shit like this puts a smile on trumps face.",
                "We already had this thread",
                "Cruelty at work. The heart of the self-serving conservatives.\n\nNo wonder the Nazi jerk boasts that empathy is something we should avoid.",
                "Just racking up those human rights violations. Maybe the ICC can save us",
                "I'm ignorant to American laws, but if you're living clean productive lives in America with enough time to have kids and raise them what's stopping you from getting the document's you need to be legal?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Teacher ordered to remove signs from classroom, including one saying 'Everyone is welcome here'",
            "external_url": "https://www.nbcnews.com/news/us-news/teacher-ordered-remove-signs-classroom-rcna196582",
            "upvotes": 7619,
            "date": "03/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/everyone-is-welcome-here-idaho-mc-1x1-250314-copy-b9fd8e.jpg",
            "top_comments": [
                "She should call them out on it: \"Provide a list of who isn't welcome, and I'll consider amending the sign\"",
                ">An Idaho teacher is in a standoff with her own school district after officials ordered her to remove classroom signs, including one that reads, “Everyone is welcome here.” \n\n>Sarah Inama, a sixth-grade history teacher at Lewis and Clark Middle School in Meridian, Idaho, says she won’t comply with the order, arguing that the message is a fundamental part to ensuring a positive learning environment for her students.\n\n>Inama, who has taught at the school for five years, says her commitment to inclusivity isn’t about politics. It’s about her passion for education and students.\n\n>“I love the area that I teach,” she says in an interview with TODAY.com. “It’s really a valuable thing for people to know our human history, things that humans have accomplished, our time on this earth, things that they’ve overcome, patterns that exist.”\n\n>Five years ago, when she first put up the two signs, it was to make sure students knew they were in an open and welcoming space. Now, she says she is risking her job in the name of those values.\n\n>Inama says the controversy began in January when her principal and vice principal came to her classroom to inform her that two posters on her walls were controversial and needed to be removed, a detail the district verified in an email to TODAY.com. Inama says other teachers were given similar instruction, but she was caught off guard by the directive.\n\nGood for her for refusing to back down from the \"controversial\" view that *Everyone is welcome here.*",
                "those officials are such grim people. it speaks to the wider regime in the current day but for this instance, I would jot what my kids in that district ",
                "Change it to “everyone but Nazis” and see if that works better.",
                "I fucking hate sharing a Country with Republikkkans.",
                "There is zero defensible position with the school district's mandate. The teacher's sign only echoes their official policy of inclusion and respect, so either they're lying (they don't actually believe everyone deserves respect and/or inclusion), or they're just suppressing individual speech. There's zero wiggle room here.\n\n\nMy opinion? My guess is they're lying. We know very well that Jim Crow, segregation, and the KKK were the official responses to emancipation. They were legislated into the closet, forced to use dog whistles. Now they're getting comfy and coming back out.\n\n\n\"Red and yellow, black and white, they are precious in his sight. Jesus loves the little children of the world.\" Haven't heard this song since my childhood, seems about time to revive it. You have to fight these kooks with their own values.",
                "Lovely Robert Jenrick, who was immigration minister in the (now fallen) UK Conservative government, [ordered friendly murals painted over](https://www.theguardian.com/uk-news/2023/jul/07/robert-jenrick-has-cartoon-murals-painted-over-at-childrens-asylum-centre) in a reception centre for unaccompanied refugee children.\n\nEnsuring that frightened little children are more miserable is the purest form of hate for some people. It is as cowardly as it is pointless  consisting only of meanness inflicted on the defenceless for the sake of it.\n\nI suppose there is also a frisson of excitement in violating basic biological instincts regarding the protection of the young. In movies, satanic cults get their kicks like this. In real life, its Christians.",
                "Her decorations seem pretty benign and somewhat “content-neutral”\n\nI guess it’s now controversial and innapropriate to state that all people are equal? Administration should clearly define why the given decoration goes against their policy in detail…",
                "They're acting like this a big deal, but letting her stay the rest of the school year - they know they're wrong and they just need a teacher in that classroom. She is right to stand up to them and keep her sign, it's a beautiful message.\n\nhttps://www.westada.org/o/lcms/page/contact-us",
                "Take the sign down. Bring it to the next school board meeting. Lay it down on the table in front of them, and then calmly and simply ask, “Please point to the hands that are not welcome here.”\n\nDon’t leave until each board member gets a chance to participate."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Arlington Cemetery strips content on black and female veterans from website",
            "external_url": "https://www.bbc.com/news/articles/cz03gjnxe25o",
            "upvotes": 2098,
            "date": "03/15/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a32/live/523070a0-01b5-11f0-8027-b77ec2a48801.jpg",
            "top_comments": [
                "What does this accomplish?",
                "I guess nobody is processing that it cost more money to remove shit like this than, you know, averting your fking eyes.",
                "Will that make groceries cheaper or should I wait until tomorrow?",
                "Will Arlington now start digging up non-white and non-male graves?",
                "Just like bigoted American Jesus intended.",
                "they even removed all mention of general colin powell, the first black man to become chairman of the joint chiefs of staff and is buried there!",
                "They are LITERALLY erasing women and black people from history and from social awareness.\n\nHow the ever-loving fuck is this even remotely acceptable? Why are millions of citizens not marching on Washington to lay siege to the city and demanding for this to stop?\n\nI don’t think I understand this world anymore.",
                "Man all the people who bitched and moaned about feminism and how the west isnt sexist is gonna have to explain the complete censoring and deletion of women in history.",
                "Elect white supremacists, and they're gonna do shit like this. \n\nThis is just the beginning.",
                "#Vanishing History: Arlington Cemetery Erases Stories of Black and Female Veterans\n\nSomething strange is happening at Arlington National Cemetery. The sprawling burial ground, where hundreds of thousands of American veterans rest, has quietly erased large chunks of its history from public view. Information about black, Hispanic and female service members, once readily available on its website, has vanished. The pages once told the stories of men and women who broke barriers and gave their all for a country that did not always give back. Now, with a few clicks, they are simply gone.\n\nThe move is part of President Donald Trump's sweeping effort to rid the US military and federal government of diversity, equity and inclusion policies. His administration has been swift in shutting down initiatives that highlight the contributions of minority groups, and Arlington has not been spared.\n\nVisitors looking for details about notable graves have run into dead ends. The pages once dedicated to figures such as General Colin Powell, the first black chairman of the Joint Chiefs of Staff, and the legendary Tuskegee Airmen, the country's first black military pilots, have disappeared. The same goes for Hector Santa Anna, a World War II hero and decorated bomber pilot. Even broader categories of history have been stripped away. Sections on African American, Hispanic and Women's history are no longer easily accessible from the main site.\n\nOfficially, Arlington insists it is working to restore some of the missing content, though it also says it wants to ensure everything aligns with Trump's executive orders and the policies of Defence Secretary Pete Hegseth. Hegseth, a former Fox News host and military veteran, has been vocal about his desire to root out what he calls “woke” culture from the armed forces. He was instrumental in removing General CQ Brown, the first black chairman of the Joint Chiefs of Staff, who had supported diversity efforts.\n\nThe backlash has already begun. Representative Adam Smith, a senior Democrat on the House Armed Services Committee, called the situation “deeply concerning” and suggested there was never a problem with diversity in the military to begin with. Earlier this year, a similar attempt to remove training materials on the Tuskegee Airmen sparked national outrage, forcing the Pentagon to reverse course.\n\nThe US military today is a complex institution, with more than two million people serving in active duty or reserves. A significant portion of them come from minority backgrounds. Thirty per cent identify as black, Native American or other underrepresented groups, while nearly one-fifth are women. The stories now missing from Arlington's website belong to people who paved the way for them.\n\nHistory cannot be deleted as easily as a webpage. The soldiers buried at Arlington, no matter their background, are not just names etched into headstones. They were real people who lived, fought and sacrificed. Whether or not their stories remain in an online archive, their contributions cannot be erased. But the question remains, why is their history being buried once again?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Local students art project for Women’s History Month partially removed after it’s deemed “inappropriate”",
            "external_url": "https://www.wcpo.com/news/local-news/art-is-supposed-to-get-people-talking-adams-county-students-womens-history-mural-deemed-inappropriate",
            "upvotes": 503,
            "date": "03/15/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/db5cb8b/2147483647/strip/true/crop/3184x1672+0+128/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fbc%2Fa5%2F661cb9144455a2f8962ea7f9dff4%2Fscreenshot-2025-03-14-at-9-21-14-pm.png",
            "top_comments": [
                "And now an art project that would have been limited to a single high school audience has gone nationwide. :) Hope the young artist is rightfully enjoying this moment and keeps at it.",
                "And just like that, they've proven the point the artist was trying to make.",
                "r/nottheonion \n\nArtist: \"Women's voices are being shunned\" \n\nSchool: \"Shut your damn mouth, woman!\"",
                "Officials recommended that the tape depicting the taped mouth and hands be removed, but that changes the art drastically. The message is completely different with this level of tampering. I think her art should be sold as is.",
                "Now the art piece is getting a much larger reach.\n\nThe duct-tape over the mouth really represented how women’s voices are always shunned,” Greenfield said. “And then the hands being tied back, how they’re always like kind of trapped.”\n\nAdams County Ohio Valley School District Superintendent Dawn Wallace, who said the mural was “inappropriate” and “depicted bondage and teen pregnancy.”",
                "God forbid anyone ever interact with anything that might make them uncomfortable or be thought provoking about current day issues. What is the point in even making art if it cannot try to evoke a single thought?",
                "Today we learned of Adams County Ohio Valley School District Superintendent Dawn Wallace’s kink - pregnancy bondage. No judgement from me, just own it Dawn.",
                "\"Promotes bondage and teen pregnancy\" is Elon Musk levels of media/art illiteracy.",
                "They took the tape off the mural and stuck it squarely over the artist’s mouth.",
                "As a former student I feel safe in saying that little cover-up sign will have a short, violent existence."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "RISING",
            "title": "Nine killed in Israeli attack in northern Gaza, officials say, in deadliest strike since ceasefire began | CNN",
            "external_url": "https://edition.cnn.com/2025/03/15/middleeast/israeli-attack-gaza-intl/index.html",
            "upvotes": 226,
            "date": "03/15/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-15t131025z-1148523927-rc2kddarmb14-rtrmadp-3-israel-palestinians-gaza.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Real \"ceasefire\" they got going there.\n\n\nNine *charity workers*, to be clear.",
                "Is the phrase “deadliest strike since ceasefire began” not an oxymoron? Like do people think this is actually a ceasefire?",
                "It was nine charity workers… That should absolutely be included in headline.",
                "\"Deadliest strike since ceasefire began.\" So it's now not even just one goodness.",
                "Ceasefire for Israel means they can kill whoever they want and the other side can’t fire back.",
                "Be careful, posting this may get you arrested",
                "Another day, another IDF war crime. ",
                "Is it worth telling the devil he's evil?\n\n\nAnyone without brain damage knows Isreal is a terrorist state.",
                "ceasefire for israel means the opps cease while they fire i suppose",
                "2 people operating a drone. Additional people collected drone operating equipment and entered a vehicle. Israel bombed that vehicle. Of the 9 killed 3 were media team documenting humanitarian relief efforts in Gaza. It’s likely that they were indeed all humanitarian people. It’s also possible that they were terrorists taking cover as humanitarians to spy or drop bombs on Israeli troops."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Los Angeles man awarded $50 million in case against Starbucks after suffering permanent injury from spilled tea",
            "external_url": "https://www.cbsnews.com/losangeles/news/los-angeles-man-awarded-50-million-in-case-against-starbucks-after-suffering-permanent-injury-from-spilled-tea/",
            "upvotes": 3486,
            "date": "03/15/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/15/89fcf677-2a10-4cd5-9999-c9440c0380ed/thumbnail/1200x630/de9d75095f1ddf658fdb1004e377d8d6/screenshot-2025-03-15-111605.png?v=e7f44f50e1cf6b32bb81cbfeaec70acf",
            "top_comments": [
                ">Starbucks had initially offered $3 million to Garcia pre-trial, later upping that amount to $30 million to settle. Garcia agreed, but under the condition that they apologize, change their policies and issue a memo to all store locations to double-check their hot drinks before handing them to customers, attorneys said. \n\n>When they declined to agree to those terms, the jury eventually decided to award Garcia with Friday's total. \n\nShame the judge didn't also order Starbucks to comply with those terms instead of just letting them pay to get out of it.",
                "At least this headline included “permanent injury” so people can’t jump to conclusions about the win being undeserved.",
                "Starbucks is so entrenched in corporate culture that instead of saying sorry and agreeing to double check the lids are secure they declined a lesser amount and now have to pay 20 million more.",
                "\"Hey, I've seen this one before\"\n\"What are you talking about? It's brand new\"",
                "Starbucks had initially offered $3 million to Garcia pre-trial, later upping that amount to $30 million to settle. Garcia agreed, but under the condition that they apologize, change their policies and issue a memo to all store locations to double-check their hot drinks before handing them to customers, attorneys said. \n\nSo the redline was an apology and a memo?",
                "> The spill left Garcia was life-changing injuries. He suffered third degree burns, nerve damage and permanent injury to his genitals. Lawyers say that he's already had multiple surgeries and that he still experiences pain every day. On top of this, they say that he suffers from severe PTSD. \n\nJust like that poor McDonald’s lady whose labia literally fused together from the hot coffee. \n\nAnd just think of all the plastic cup lining that’s melting in the drink from being that hot.",
                "I’m assuming it was spilled in his lap, the tea was probably very hot, and his lap doesn’t work anymore.",
                "Didn’t they learn this lesson after it happened to McDonald’s, years ago?  There’s no reason coffee/tea should ever be kept that hot.",
                "Can we not McDonald's this victim ",
                "Good for him. You’re in the drive through trying to get a drink when an incredibly hot tea with an unsecured lid gets dumped in your lap causing 3rd degree burns, nerve damage, and permanent genital injuries…\n\nThen they play this game:\n“Starbucks says if our hands are off the drink, then no matter what happens, we’re not responsible,” said Garcia’s trial attorney Nicholas Rowley. “So, if I’m Starbucks and I hand you a drink that doesn’t have a lid that’s secured, and it’s a scalding hot 180 degree drink, or if I hand you a drink that’s in a container and it’s loose and it’s not secured, and it falls right on you — the moment that I take my hands off of it, then you’re responsible and I, the corporation, am not.”\n\nHe had accepted $30 million + apology and ensuring lids are secure and they declined. Now they pay $50 million."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Consumers and Businesses Send Distress Signal as Economic Fear Sets In",
            "external_url": "https://www.wsj.com/economy/consumers/consumers-and-businesses-send-distress-signal-as-economic-fear-sets-in-f58d0659",
            "upvotes": 711,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've dealt with abusive people in the past.\n\nWhat comes next is the person responsible for all this, will go into absolute denial .. simultaneously claiming it isn't happening while also blaming everyone else for it. Somehow the people pointing out the problem that person is causing, will be painted as the cause of it.",
                "1. Cause recession\n2. Billionaires buy up distressed assets for pennies on the dollar\n3. idk feudalism?",
                "Will end up a world wide recession .",
                "> On Friday morning, Armstrong, 63 years old, canceled his daughter’s high-school class trip to Spain to free up cash. The trip was going to cost him $322 a month until the trip in spring 2026. The single dad, an independent who voted for Kamala Harris, has also cut back on buying new clothes and ordering food from Grubhub, a treat he and his daughter used to indulge in once a week. \n\n\n> “Things look increasingly bleak for us for the next few years,” he said. “We are cutting back on virtually everything.”\n\n\nThere are of course more important things than a trip to Spain, but there's just something so tragic about stories like this to me. The US is the richest country in the world, and that high school girl should get to go on a trip (both educational and fun) that she'd remember for a lifetime. Every kid should get a few things like that, and this country could be run so that so many more could afford it.\n\n\nAnd this dad should be able to order out for him and his daughter once a week. That should be bare minimum in a country that prides itself on consumerism and wealth. \n\nInstead, this single dad working two jobs can't send his kid on a trip *so that a bunch of obscenely rich fucking assholes who can already afford anything they want or need can make themselves wealthier.*\n\nFucked country. Completely fucked.",
                "So I just had a thought, back with Biden when people were feeling things were expensive (eggs excluded - bird flu), maybe some of it was because people were feeling confident enough to even consider the more luxurious options? People would say “I have more money in my pocket but I don’t feel like it buys as much.” People had a good economy for so long that they forgot what it was REALLY like to have to worry about their financial fragility. \n\nIt’s like vaccines, we are the victims of our own success.",
                "Hear that big sucking sound? That’s America going down the toilet.",
                "I've seen people whose lives are tied up in the stock market really having to lean into cognitive dissonance lately. \n\n\nThings are fundamentally changing in this country and most people have only gotten worse at facing reality in the last few years. ",
                "The real effects are starting. It's not an immediate collapse, it's not groceries going back to normal, home prices aren't going to correct this month. \n\nYou're setting up everyone below 40 to become frugal. To fear economic uncertainty even when the economy is \"growing healthily.\" \n\n2 generations of frugal consumers with a constant paranoia that their life is going to be stripped down at a moments notice. \n\nWe're being offered 200k homes for 550k with interest. The average car payment is close to becoming the average mortgage payment in the 90s. Minimum wage hasn't changed, college degrees don't guarantee success, and our leaders don't give a shit unless they get a profit. \n\nI wanted to get out of school and live on the beach, have a sports car, basically the standard kids' idea of success. Now, I just want a small home without paying absurd taxes. I want a chicken coop and garden. Even that is a monumental feat for a single person.  \n\nWhy are my taxes going up more and more while we all receive so much less? We pay 10% less taxes than Germany. We receive less protections from employers. 0 guarantee of vacation. Our Healthcare is more expensive and worse than Germany. We pay considerably more for home loans. Our roads are worse, our police are worse, our food is worse, are homes are built worse, our infrastructure is failing, we have companies paying 250k fines for poisoning entire towns. \n\nOur leaders have decided that every citizen under the top 10% will now pay more taxes as a way to maintain our fabulously vile standard of living. \n\nI just want out. I have to be in this country for just less than a decade. I'm not sure I want a house here anymore. I'd rather save, finish another degree, and leave. This rat race is a joke.",
                "[removed]",
                "We are heading into a recession or perhaps a depression…."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Monster storm across the US sparks threat of tornadoes and fire, killing at least 16",
            "external_url": "https://apnews.com/article/tornadoes-wildfires-deaths-eb53f6b2463a96b18a08ca9e2db266ab",
            "upvotes": 1268,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like a great time to defund NOAA and dismantle the National Weather Service. ",
                " DOGE is cutting  jobs at NOAA  in a time of violate climate .",
                "I thought red states were safe now that Republicans are in control of the weather. What happened?",
                "Luckily we have FEMA to help these people and that's great !\n\n/s ?",
                "Must be DEI hired storm",
                "Ngl, I first read that as \"A monster storms across the US\" and was disappointed that I didn't have kaiju on my 2025 Disasters bingo card.",
                "Huh, God seems pissed.",
                "I thought the Republicans controlled the weater machines now? /s",
                "The consequences of global warming have finally arrived. The cyberpunk dystopia has finally arrived. Capitalism in America is reaching it's apex.\n\nThe apocalypse is scheduled for next week.",
                "But let's shut down NOAA."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "USDA cancels $11 million in federal funding for North Carolina food banks",
            "external_url": "https://www.wunc.org/news/2025-03-14/usda-cancels-federal-funding-north-carolina-food-banks",
            "upvotes": 23105,
            "date": "03/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/f49be1d/2147483647/strip/true/crop/1920x1008+0+136/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F88%2F9813b4f34728a68ed1ad97eb76e1%2Ffood-banks.jpg",
            "top_comments": [
                "It’s always going to be the people that deserve it the least that get the worst of it",
                "Food shelves across the country are anxious because they're expecting, on average, a doubling of people who need help this coming year, and yet are dreading this kind of news that funding will be cut.  Where will my fellow Americans go when we've cut the safety nets out from underneath them? The vast majority of people who use our foodshelf aren't foreigners, terrorists, welfare riders, or villians. They're locals who live here, seniors who don't have enough to retire on and feed themselves, disabled people that can't work enough to make ends meet and pay piling up medical bills, all sorts of sad stories of good regular local people falling through the cracks. And this administration is making those cracks bigger and bigger. SHAME. SHAME ON EVERY SINGLE ONE OF THEM THAT SUPPORTS HURTING AMERICANS.",
                "The cruelty is the point.  Thanks MAGA for even more hungry North Carolinians.",
                "Don't worry. Trump says you'll have so much money you won't even know what to spend it on! \n\nOr maybe he was just referring to himself there...",
                "No food for the needy, but a 4.5 TRILLION tax cut for the wealthy. \nThat’s not right.  I don’t care who you are or what side you’re on, that is just not right.",
                "Every visit Trump makes to Mar-A-Lago costs the US taxpayers $3 million.",
                "I volunteer at a food bank 1-2x a week and it’s going to get bad bad. We were always scrambling for enough food already. Im retired so it’s the least I can do. But we’re all scared we just won’t have enough and there’s nothing worse than telling a mom who’s just scraping by we’re out of food.",
                "But but but, during the campaign there were AI photos of Trump wading in flood waters to save puppies after Helene to own the libs! 😧 You don’t mean to tell me he never cared about North Carolinians?! WHAAAAAAAAA!!!!?",
                "America is back, baby\n\nWhatever that means",
                "And the hits just keep on coming"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/15/2025 20:08:08 UTC"
}